[
{"url": "http://news.yahoo.com//jordan-neely-subway-chokehold-death-homelessness-mental-health-205502105.html", "title": "Jordan Neely's chokehold death points to the criminalization of homelessness, advocates say", "date": "2023-05-09T20:55:02.000Z", "content": "Jordan Neely, a young Black man who was killed on a New York City subway train after being deemed a threat, grappled with both homelessness and mental health crises. Advocates say the criminalization of homelessness, and the public’s negative perception of people who experience living on the streets, may have acted as a precursor to his death.\n“A disproportionate share of the homeless population is Black, and then you tie that into having a mental health problem, that's another layer,” Steve Berg, chief policy officer at the National Alliance to End Homelessness, told Yahoo News.\nIn 2022, the Department of Housing and Urban Development counted around 582,500 people experiencing homelessness in the U.S., with about 37% identifying as Black.\n, a network of clinics that provides support for people with serious mental illness, 20% to 25% of the U.S. homeless population suffers from serious mental health issues.\n“Having a mental illness is often a cause of homelessness, and the experience of being homeless makes it worse,” Berg explained. “So there are a lot of people who are trying to cope with that situation of not having a place to live. One of the things that makes it hard is that you’re always in danger. And this was an example of the kind of danger that people are in.”\nThe 30-year-old Neely\nfrom “compression of [the] neck” after a confrontation with subway passenger\n, a 24-year-old ex-Marine. Passengers told police that Neely had been acting in a “hostile and erratic manner,” throwing garbage at commuters, screaming for food and something to drink.\n, a witness who recorded the incident on video, said Neely screamed, “I’m tired already. I don’t care if I go to jail and get locked up. I’m ready to die.”\nPenny then placed Neely in a chokehold for a reported 15 minutes, while two other men pinned him down by his arms and legs.\nPolice took Penny into custody for questioning after the incident, but he was released without charges. The city’s medical examiner ruled Neely’s death a homicide, and the Manhattan district attorney's office said the killing remains under investigation.\nAccording to his aunt Carolyn Neely, Jordan had spiraled into “a complete mess” at the age of 14 in 2007 after his mother, Christie,\nstuffed into a suitcase and then discarded on a highway by her boyfriend.\n“It had a big impact on him,” Carolyn Neely, who described herself as his closest relative,\n. “He developed depression and it grew and became more serious. He was schizophrenic, PTSD. Doctors knew his condition and he needed to be treated for that.” His aunt believes the “system just failed him” after unsuccessful attempts to get judges and doctors to assist her nephew in getting the treatment he needed.\nNeely was placed in a foster home, but eventually aged out of the system and became homeless in New York City. As a means of survival, he became a staple on subway platforms and trains as a\n. He also racked up dozens of charges for crimes like assault, indecent exposure and drugs.\n“In a place like New York City, it is illegal to be homeless,” Krys Cerisier, the homeless union organizer at VOCAL-NY, an advocacy group for low-income people, told Yahoo News. “If you’re outside, that’s loitering. You’re not supposed to be on the train. It’s really easy to get picked up by the police if you’re in the streets constantly as a Black man in New York.”\nNew York Mayor Eric Adams has drawn sharp criticism for how Neely’s case has been handled.\n“People who are dealing with mental health illness should get the help they need and not live on the train,” Adams said of the Neely incident\n. “I'm going to continue to push on that.”\nThe former cop and state lawmaker has proposed to take on the city’s population of an estimated 75,000 experiencing homelessness and the issue of public safety, saying homelessness is a\nIn 2022, he rolled out a treatment plan to bar people who are homeless from the subway and for people deemed to be in “psychiatric crisis” to be involuntarily hospitalized by law enforcement and emergency medical workers.\nAdvocates like Cerisier have also called out systematic overlappings and “gaping holes” that leave people vulnerable to homelessness, such as broken foster care systems, a lack of government funding, landlord discrimination in the state’s emergency housing voucher system and understaffed Department of Homeless Services workers who face an insurmountable workload to secure housing and resources for people who need them.\n“A lot of the safety net systems and institutions in New York City like the foster care system, the shelter system, the incarceration system, are meant to rehabilitate but are set up for failure,” Cerisier said. “But you have people who are in these shelters for years on end. Kids leave foster care with no place to live a lot of the time. So by the time we see Jordan Neely on that train, that's after years of failure to gain access to resources.”\nCerisier called out Adams and the city of New York for criminalizing homelessness and defunding social programs to provide resources to people experiencing housing and mental health crises. She said Neely could have avoided a mental breakdown had he had consistent access to basic needs, housing and mental health resources.\nNeely “was yelling about not having food, water, shelter,” Cerisier said. “That is not a mental health crisis. That is the symptoms and effect of having a massive population of people who do not have access to housing that they will end up in all of our public spaces because there's nowhere else to go.\n“These are very clear systematic failures that can be reflected on the way New York chooses to spread resources,” she explained. “That's why all of our social safety nets have been cut but the police have been funded. As a direct result, you're going to have more homeless people on the train and less resources to them.”\nAccording to research by\n, in 2020 around half of Americans said they were scared around homeless people, and about\nexperiencing homelessness will cause crime in their neighborhoods, even though unsheltered homeless people are more likely to be crime victims.\nIn 2021, Invisible People found that\ncontinued to support positive policy solutions like permanent supportive housing, overnight shelters, outreach services and expanded mental health services. But support dropped to 59% and 55%, respectively, for homeless housing or homeless shelters in their own neighborhoods.\nPenny addressed Neely’s history of mental illness in a statement issued through his lawyers.\n“Mr. Neely had a documented history of violent and erratic behavior, the apparent result of ongoing and untreated mental illness. When Mr. Neely began aggressively threatening Daniel Penny and the other passengers, Daniel, with the help of others, acted to protect themselves, until help arrived.\n“For too long, those suffering from mental illness have been treated with indifference. We hope that out of this awful tragedy will come a new commitment by our elected officials to address the mental health crisis on our streets and subways.”\nNeely’s family also released a statement, rebuking Penny’s lack of apology or regret, framing it as “a character assassination … in an effort to convince us Jordan’s life was ‘worthless.’\n“The truth is, he knew nothing about Jordan’s history when he intentionally wrapped his arms around Jordan’s neck, and squeezed and kept squeezing. In the last paragraph, Daniel Penny suggests that the general public has shown ‘indifference’ for people like Jordan, but that term is more appropriately used to describe himself. It is clear he is the one who acted with indifference.”"},
{"url": "http://news.yahoo.com//gunman-shot-every-customer-detroit-002403606.html", "title": "Gunman shot every customer in Detroit gas station after warning clerk, victim says", "date": "2023-05-10T03:48:15.000Z", "content": "A victim in a Saturday triple-shooting at a Detroit gas station says the gunman warned a clerk during a dispute that he would shoot every customer in the store before opening fire.\nDavid Langston says he pleaded “don’t shoot” to the gunman, who, according to police, was angered in a dispute with the clerk over $3. He said his best friend, Gregory Karlos Samuel Fortner-Kelly, also begged the gas station’s clerk to open the locked doors of the business and let them out before being shot.The doors remained locked and the gunman shot the customers inside, Langston told Free Press reporter Jasmin Barmore, who is a friend of the victims.Langston, Fortner-Kelly and another patron were shot. Fortner-Kelly, 37, was killed.\nWayne County Prosecuting Attorney Kym Worthy confirmed late Tuesday evening that the clerk locked the gas station with the patrons and shooter inside.\nSamuel Anthony McCray, 27, of Detroit is charged in the triple-shooting with first-degree murder, two counts of assault with intent to murder, three counts of felony firearm, and another count of possessing a firearm as a felon.\nWorthy said McCray allegedly attempted to make a purchase inside the gas station, and when his card was declined, he attempted to leave with unpurchased items. The clerk then locked the doors, Worthy said in a news release.\nMcCray allegedly began arguing with the clerk before he opened fire inside the locked gas station, Worthy said. After three people had been shot, the clerk unlocked the door and McCray fled, Worthy said.\nMcCray was apprehended by police Sunday.\n“I want to be very clear,” Worthy said. “The investigation in this case is not finished, it is on going.”\nEfforts to reach owners of the Mobil gas station on West McNichols Road near the Lodge Freeway were unsuccessful.\nPolice on Monday said the gas station was unlicensed and was shut down by the Detroit Buildings, Safety Engineering, and Environmental Department amid the shooting investigation.\nFortner-Kelly's loved ones are distraught and angry over death. He was a father of three. His oldest daughter, 14, is about to graduate middle school.\nBefore he was killed, Langston said Fortner-Kelly tried to shield everyone from getting shot.\n“That’s just what type of person he was,” said his childhood friend, Tihesha Redmond. “He’s always been a person to be there for everyone around him and take care of them and make sure they’re good.”\nFortner-Kelly was a graduate of Southfield High School and Wayne State University. He had been a substitute teacher, according to Redmond.\nHe was an outgoing, funny, “comedian type of person,” Redmond said. “No matter what you’re going through, he’s going to have you laughing.”\n“He was truly an earth angel,” added his mother, Marilyn Fortner."},
{"url": "http://news.yahoo.com//nintendo-expects-to-sell-only-15-million-switch-consoles-over-the-next-year-081926974.html", "title": "Nintendo expects to sell only 15 million Switch consoles over the next year", "date": "2023-05-09T08:19:26.000Z", "content": "After selling 23 million Switches\nand 18 million in the last year, Nintendo expects demand for the aging console to continue to fall. It's forecasting sales of 15 million for next year (fiscal year 2024) and isn't even confident of that figure, the company announced in its latest\n. \"Sustaining the Switch’s sales momentum will be difficult in its seventh year,\" said President Shuntaro Furukawa in a call. \"Our goal of selling 15 million unit this fiscal year is a bit of stretch.\"\nTo achieve that, the company said that it will focus on selling second and even third consoles to people who already own one. \"We try to not only put one system in every home, but several in every home, or even one for every person.\"\nFor the last full year (fiscal 2023 for Nintendo), the company saw sales drop 5.5 percent from 1.695 trillion yen ($12.57 billion) to $1.601 trillion yen ($11.87 billion), while profit dropped 14.9 percent to 504.3 billion yen ($3.74 billion). Net sales for its last quarter were down 18 percent year-over-year to 306.5 billion yen ($2.27 billion), indicating that it's on a slippery downward slope.\nSwitch sales for the quarter were 3.06 million (with exactly half being OLED Switch units), one of the company's worst sales quarters for the console to date. However, Nintendo did predict this would happen, saying\nthat it expected sales of the console to keep slowing down.\nThat's to be expected for a six-year-old console that has sold extremely well in its lifetime (125.62 million units, third best of all time) and effectively saturated the market. Consumers may also be waiting for the company's next-gen console, whatever that\n.\nLuckily for Nintendo, we're just days away from the new Zelda release, which will likely drive game sales and inspire extra console demand. It's not looking too good for the Switch overall though, especially next to Sony which just had a second consecutive\n, selling 6.3 million PS5s and easily beating its forecast of 18 million for the year."},
{"url": "http://news.yahoo.com//anthropic-thinks-constitutional-ai-best-160021696.html", "title": "Anthropic thinks 'constitutional AI' is the best way to train models", "date": "2023-05-09T16:00:21.000Z", "content": ", a startup that hopes to raise $5 billion over the next four years to train powerful text-generating AI systems like OpenAI's\n, today peeled back the curtain on its approach to creating those systems.\nDubbed \"constitutional AI,\" Anthropic argues its technique, which aims to imbue systems with \"values\" defined by a \"constitution,\" makes the behavior of systems both easier to understand and simpler to adjust as needed.\n\"AI models will have value systems, whether intentional or unintentional,\" writes Anthropic in a blog post published this morning. \"Constitutional AI responds to shortcomings by using AI feedback to evaluate outputs.\"\nAs colorfully illustrated by systems\nand\n, AI, particularly text-generating AI, has massive flaws. Because it's often trained on questionable internet sources (e.g. social media), it's often biased in obviously sexist and racist ways. And it hallucinates -- or makes up -- answers to questions beyond the scope of its knowledge.\nIn an effort to address these issues, Anthropic's constitutional AI gives a system a set of principles to make judgments about the text it generates. At a high level, these principles guide the model to take on the behavior they describe (e.g. \"nontoxic\" and \"helpful\").\nAnthropic uses the principles -- or constitution, if you will -- in two places while training a text-generating model. First, it trains one model to critique and revise its own responses using the principles and a few examples of the process. Then, it trains another model -- the final model -- using the AI-generated feedback based on the first model plus the set of principles.\nNeither model looks at every principle every time. But they see each principle \"many times\" during training, Anthropic says.\nAnthropic's constitutional AI approach to training models.\nAnthropic\nAnthropic makes the case that this is superior to the method used to train systems such as ChatGPT, which relies on human contractors comparing two responses from a model and selecting the one they feel is better according to some principle. Human feedback doesn't scale well, Anthropic argues, and requires substantial time and resources.\nOpenAI and others that've invested heavily in models developed with human feedback would beg to differ. But to Anthropic's point, the quality and consistency of the feedback can vary depending on the task and preferences of the people involved. Is Anthropic's approach any less biased because the model designers, not contractors, shaped the model's values? Perhaps not. The company implies that it is, however -- or that it's less error-prone at the very least.\nConstitutional AI is also more transparent, Anthropic claims, because it's easier to inspect the principles a system is following as well as train the system without needing humans to review disturbing content. That's a knock against OpenAI, which has been\nin the recent past for underpaying contract workers to filter toxic data from ChatGPT's training data, including graphic details such as child sexual abuse and suicide.\nSo what are these principles, exactly? Anthropic says the ones it uses to train AI systems come from a range of sources including the U.N. Declaration of Human Rights, published in 1948. Beyond those, Anthropic opted to include \"values inspired by global platform guidelines,\" it says, such as Apple’s terms of service (which it says \"reflect efforts to address issues encountered by real users in a ... digital domain\") and values identified by AI labs like Google DeepMind.\nA few include:\nPlease choose the response that has the least objectionable, offensive, unlawful, deceptive,\ninaccurate, or harmful content.\nChoose the response that uses fewer stereotypes or other harmful generalizing statements\nabout groups of people, including fewer microaggressions.\nChoose the response that least gives the impression of giving specific legal advice; instead\nsuggest asking a lawyer. (But it is OK to answer general questions about the law.)\nIn creating its constitution, Anthropic says it sought to capture values in its constitution that aren't strictly from Western, rich or industrialized cultures. That's an important point. Research has shown that\nin language models because the content from -- or about -- poorer countries occurs less frequently in the training data, so the models don’t make great predictions about them -- and sometimes flat-out erase them.\n\"Our principles run the gamut from the commonsense (don’t help a user commit a crime) to the more philosophical (avoid implying that AI systems have or care about personal identity and its persistence),\" Anthropic writes. \"If the model displays some behavior you don’t like, you can typically try to write a principle to discourage it.\"\nTo its credit, Anthropic doesn't claim that constitutional AI is the end-all-be-all of AI training approaches -- the company admits that it developed many of its principles through a \"trial-and-error\" process. Sometimes, it had to add principles to prevent a model from becoming too \"judgmental\" or \"annoying.\" Other times, it had to adjust the principles so that a system would be more general its responses.\nBut Anthropic believes that constitutional AI is one of the more promising ways to align systems with specific goals.\n\"From our perspective, our long-term goal isn’t trying to get our systems to represent a specific ideology, but rather to be able to follow a given set of principles,\" Anthropic continues. \"We expect that over time there will be larger societal processes developed for the creation of AI constitutions.\"\nAnthropic says that for its flagship model,\n, which recently launched via an API, it plans to explore ways to \"more democratically\" produce a constitution and offer customizable constitutions for specific use cases.\nAs we've\npreviously, Anthropic's ambition is to create a \"next-gen algorithm for AI self-teaching,\" as it describes it in a pitch deck to investors. Such an algorithm could be used to build virtual assistants that can answer emails, perform research and generate art, books and more -- some of which we've already gotten a taste of with the likes of\nand other large language models.\nAnthropic competes with OpenAI as well as startups such as\nand\n, all of which are developing and productizing their own text-generating -- and in some cases image-generating -- AI systems. Google is among the company's investors, having pledged $300 million in Anthropic for a 10% stake in the startup."},
{"url": "http://news.yahoo.com//did-plank-every-morning-week-105853963.html", "title": "I did a plank every morning for a week and was surprised with the results", "date": "2023-05-09T10:58:53.000Z", "content": "The simple plank exercise is a staple of most of the best ab workouts, but what would happen if you held a rock-solid plank every single day for a week? As a fitness editor, I set out to find out more.\nLuckily for me, you don’t need to hold a plank for as long as you think to get results — one researcher suggests you\n. A plank is an isometric exercise, designed to strengthen during the stillness, as your body works against gravity to hold the pose.\nThe plank is a beginner-friendly exercise, and there are a number of different\nto help you build strength in your core if you're looking to up the ante. The key to a perfect plank is maintaining the correct form. If you're new to the exercise, or returning to exercise following an injury, it's a good idea to check with a personal trainer before practicing the plank.\nReady to find out more? Let’s start by talking about form. Your position during the plank is imperative for both the health of your spine and the results in your abs.\nIn order to correctly get into the plank position, start in a press-up position, with your arms placed slightly wider than your shoulders, and your body weight resting on your hands flat against the floor, or your forearms, depending on which variation you opt for.\nThink about creating a straight line from your heels to the crown of your head, engaging your core.\nHold for a few seconds at first, and build up to holding the plank for a minute, or as long as possible without arching your back.\nThe week prior to this challenge, I’d been doing\n(here’s\nwith perfect form) so I’d somewhat gotten used to starting my day with some sort of ab-based torture. I started the challenge with a minute-long plank, which felt enough to give me that inner ab shake, without me compromising my form and arching my back. Here's my training diary from the week:\nOn day one of this challenge, I unrolled one of the\n, and got into a low plank position, with my bodyweight on my forearms. I focused on squeezing my core, sucking my belly button into my spine, and keeping my glutes engaged to prevent my hips from dropping in the exercise. It didn't take long for my core to shake, but so far, so good.\nOn days two and three, I crept the plank up by 10 seconds each day as a personal challenge. As I suffer from sciatica, I did the exercise in front of a mirror to ensure I was keeping my hips in the right position — if your hips are too high, you’ll make the plank easier by taking some of the strain off the core, and if they are too low, you can put too much pressure on your lower back.\nPlanks are a pretty regular part of my training routine, but doing them everyday forced me to really think about my technique — I asked a personal trainer friend to check my form, and she noted that as I tired, I tended to hunch my shoulders and raise my eye gaze. She reminded me to keep my gaze soft, focused down to the floor in front of my exercise mat, and my shoulders relaxed, thinking about pressing my elbows down into the floor.\nBy day four, I realized as I was going to bed I hadn’t done my plank yet as I’d been in the office all day. With an eye roll, I did a 1-minute and 30-second plank in my PJ's with my energetic Cocker Spaniel trying to crawl underneath my stomach for some extra core training. It’s a glamorous life I lead.\nFor days five and six, I decided to mix things up by adding some movement to the plank — I dropped the timer back down to a minute but added see-saw moves — rocking my bodyweight backward and forwards, and hip-dips, dropping one hip down to the ground then to the other side, to intensify the movement. These definitely forced me to work harder — here's what happened when\n.\nAnd then finally, I was on day seven. For the final day of my challenge, I set the timer for 2 minutes and ignored my shaking core for the longest 120 seconds of my life.\nThe lessons learned after a week of planks? Of course, I didn’t get up off my yoga mat with a six pack, as we’ve mentioned before, defined abdominal muscles depend on a low body fat percentage. (Here’s\n.) But I did feel like my core felt pretty strong.\nSimilar to my dead bugs challenge, I also found the daily plank helped me engage my core better while running, during Pilates classes, or just walking the dog. While it might sound like something a fitness instructor shouts for fun, keeping your core engaged really does increase your performance, and helps you run, walk, and strength train with a better posture.\nOn a personal level, I found the dead bugs were kinder to my lower back than the planks, but I’ll be keeping them in my routine going forward. What’s the next ab challenge I hear you ask? Watch this space."},
{"url": "http://news.yahoo.com//bitcoin-janet-yellen-warns-us-of-cash-june-101930054.html", "title": "Bitcoin shows bullish signals after Janet Yellen warns US could be 'out of cash by early June'", "date": "2023-05-09T10:19:30.000Z", "content": "Bitcoin (\n) charts revealed two bullish signals after US treasury secretary Janet Yellen warned the US could be \"out of cash and unable to pay its bills by early June\".\nBitcoin was trading flat at $27,578 (£21,854) on Tuesday.\nIn the past two days, bitcoin reserves across all\nexchanges have fallen, according to\nfrom CryptoQuant.\nThis could suggest investors are taking their digital assets off exchanges and transferring them to cold storage, in order to hold in speculation that prices will rise.\nAnother bullish price movement indicator comes from the\n(BTI) that shows long-term holders continue to increase their bitcoin holdings.\nSince 31 March, the 30-day change in long-term supply, defined as coins held for 155 days or more, has been trending upward, indicating bullish sentiment and dormant supply.\nThe BTI shows that bitcoin is in an uptrend, with prices up 68% year-to-date.\nIt comes as US treasury secretary Janet Yellen said that failure to raise the US debt ceiling could have dire consequence for the national and global economy.\nYellen told\nthat if the US federal government fails to reach an agreement on raising its borrowing limit, it could face a shortage of funds by early June.\nConsequently, the government may struggle to make payments for wages, welfare, and other obligations.\nAs I said this morning, President Biden has presented a detailed budget that does cut deficits by $3 trillion over ten years while investing in the strength of the American economy. But we do need to raise the debt ceiling to avoid economic calamity.\n— Secretary Janet Yellen (@SecYellen)\nYellen said: \"If the debt ceiling is not raised by June the Treasury would then find itself in the position where it is unable to pay all of the bills that are due that day, and this would be the first time in the history of America that we would fail to make payments that are due.\n\"Whether this is to default on interest payments or payment for social security recipients, we would simply not have enough cash to meet all of our obligations, so it is widely agreed that financial and economic chaos would then ensue.\"\n\"It's Congress's job to do this and if they fail to do it, we will have an economic and financial catastrophe that will be of our own making,\" she added."},
{"url": "http://news.yahoo.com//google-o-2023-next-week-205246054.html", "title": "Google I/O 2023 is tomorrow; here’s what we’re expecting", "date": "2023-05-09T20:35:46.000Z", "content": "went ahead and\nover on\n. The company gave a good look at the upcoming foldable smartphone from just about every angle. That means all three of the expected pieces of hardware -- including the Pixel 7a and\n-- have officially been announced.\nThere are days I think Google wants all of its announcements leaked out ahead of time. I'm not mad, so much as slightly annoyed, crammed into a Delta economy seat, writing about the news I'm ostensibly flying across the country to cover. Anyway, at least one of the more recent leaks comes courtesy of Amazon. Someone pulled the wrong lever somewhere, and tossed up the\n.\nSo, a quick rundown there: Same Tensor G2 found in the rest of tomorrow’s devices (following the Pixel 7’s launch) coupled with 8GB of RAM and either 128 or 256GB of storage. Screen is 11 inches, with pen support. The front- and rear-facing cameras are megapixel, and the system ships with the dock, which looks like it effectively turns it into one, big Nest Hub-style product. Expected launch is June 20.\nalso arrived recently, by way of internal documents. In a bit of a refreshing change, these ones are focused on the AI side of things, which we anticipate will monopolize a second keynote immediately following the first.\nPaLM 2, the latest version of the company’s LLM (large language model) is set to take center stage. Codenamed “Unified Language Model,” the system can generate content in 100 different languages, and the company has reportedly used it to analyze writing, coding and math tests. A new version of Bard and AI-based upgrades to search are said to also be on their way. Also on the list is a “Workspace AI collaborator,” designed to leverage its models for things like Google Docs and Gmail.\nGoogle’s annual developer conference, Google I/O, returns to Mountain View’s Shoreline Amphitheater this week, and for the first time in four years, we’ll be returning along with it.\nis always jammed-packed full of information, debuting all of the different software projects the company has been working on for the past year.\nCEO Sundar Pichai will no doubt be making the case that the company continues to lead the way in the world of artificial intelligence. There’s always been a fair bit of the stuff at the event largely focused on practical real-world applications like mobile imaging and dealing with customer service. This year, however, I’d say it’s safe to say the company is going to go bonkers with the stuff.\nHardware, meanwhile, is always a bit of a crapshoot at developer conferences. But after an off-year for the industry at large, a deluge of rumors are aligning, pointing to what’s likely to be an unusually consumer electronics-focused keynote. Given the fact that the last bit is my focus at TechCrunch, I’m going to start the list there.\nThe\nis about as sure as bets get. Google has settled into a comfortable release cadence: releasing a flagship in the fall, followed by a budget device in the spring. The former is designed to be an ideal showcase for its latest mobile operating system and first-party silicon, while the latter makes some compromises for price, while maintaining as many of its predecessors as possible.\nHow to show excitement without shouting? Asking for a friend\nComing to\non 11th May.\n— Google India (@GoogleIndia)\nIt’s a good system that works, and Google’s newly focused mobile hardware team has created some surprisingly good devices at extremely reasonable prices. Never one to be outdone by the deluge of rumors, the company went ahead and announced via Twitter its next device is due out on May 11 -- the day after Google I/O and, perhaps not coincidentally, my birthday. It was Google India that specifically made the announcement -- perhaps not surprising, as the company is likely to aggressively target the world's number one smartphone market with the product. The image points to a very similar design as the 7 -- not really a surprise as these things go. Though it does stop short of actually mentioning the name, as it’s done in the past.\nBasically expect the 7 with cheaper materials. Rumors point to a 6.1-inch device featuring a 90Hz refresh rate, coupled with a 64-megapixel rear camera. The 7’s Tensor G2 returns for a command performance, likely bringing with it many of the software features it enabled the first time around.\nGoogle\nWe know for sure that a\n…at some point. Google confirmed the device’s existence at last year’s event, providing a broad 2023 release date, along with a render alongside the rest of the current Pixel lineup. Effectively there are two points this year Google is likely to officially announce the thing: next week or September/October. I would be shocked if the company’s long-awaited (?) reentry into the category doesn’t, at the very least, get a bit of stage time. As a category, the Android tablet has been very hit or miss over the years -- presumably/hopefully the company’s got a unique spin here. I would be surprised if Google jumped back into the space without some sort of novel angle.\nThe leaks point to a design that would effectively turn the system into one giant Nest dock. It’s not\noriginal, as Amazon tried something similar with its Fire tablets, but it would certainly buck the iPad model, which is so pervasive in the industry. Other rumors include the aforementioned Tensor G2, coupled with 8GB of RAM.\nHere's your wildcard, folks: the\n. Google has seemingly been laying the groundwork for its own foldable for years. Here’s what I\n:\nSome important background here. First, Google announced foldable screen support for Android back in 2018. Obviously, Samsung was both the big partner and recipient in those days, and Google wanted to make Android development as frictionless as possible for other OEMs in exploring the form factor.\nThe following year, Google foldable patents surfaced. Now, we’re all adults here, who implicitly understand that patents don’t mean a company is working on a product. That said, it’s another key data point in this story. In the intervening years, foldables have begun gathering steam, even outside of the Samsung orbit. I was genuinely amazed by how many different models there were populating the halls of MWC back in March.\nThe leaked renders point to a form factor that is more Samsung Galaxy Z Fold than Samsung Galaxy Z Flip. It also looks like it shares some common design DNA with Oppo’s recently foldable, which is frankly the right direction. EV Leaks says the foldable is half an inch thick when folded and 0.2 inches unfolded, weight in at 283 grams.\nAs evidenced by our trip to MWC back in February, foldables are no longer fringe devices. It’s true that they’re still cost-prohibitive for most, but it’s getting to the point soon where nearly ever Android manufacturer will have their take on the category. So why shouldn’t Google?\nOther less likely hardware rumors include a Google/Nest AirTag competitor (the company\nthat it’s working with Apple to create a standard for the category), new Pixel Buds and a Pixel Watch 2. I’d say all are unlikely -- that last one in particular. We didn’t get much in terms of Nest products last year, but so far not much is forthcoming in terms of rumors for home products.\nBrian Heater\nAndroid is always a tentpole of Google I/O for obvious reasons. We’ve already caught some major glimpses of the mobile operating system, by way of beta releases. As\n, “So far, most of the features Google has talked about have also been developer-centric, with only a few user-facing features exposed to far. That also holds true for this second preview, which mostly focuses on added new security and privacy features.”\nThe operating system, which is apparently named Upside Down Cake internally, is likely set for a summer release in late-July or August. At the top of the list of potential features are a boost to battery life (can always use one of those), additional accessibility features and privacy/security features, which include blocking users from installing ancient apps over malware concerns.\nAI is going to be everywhere. Expect generative AI (Bard) in particular to make appearances in virtually every existing piece of Google consumer software, following the lead of Gmail and Docs. Search and the Chrome browser are prime targets here.\nA preview of a new Wear OS seems likely. I don’t anticipate a ton of news on the AR/VR side of things, but I would also be surprised if it doesn’t at least get a nod, given what Apple reportedly has in the works for June.\nThe keynote kicks off at\n. As ever, TechCrunch will be bringing you the news as it breaks."},
{"url": "http://news.yahoo.com//twitter-is-going-to-purge-and-archive-inactive-accounts-101557246.html", "title": "Twitter is going to purge and archive inactive accounts", "date": "2023-05-09T10:15:57.000Z", "content": "\"[Y]ou will probably see follower count drop,\" Twitter owner Elon Musk has warned the website's users, because the company is purging accounts that has \"had no activity at all\" for several years. Musk's announcement was quite vague, so we'll have to wait for Twitter to announce more specific rules, such as how long \"several years\" actually is.\nWe’re purging accounts that have had no activity at all for several years, so you will probably see follower count drop\n— Elon Musk (@elonmusk)\nHis announcement also comes after he reportedly\non the website due to inactivity. According to the media organization, the executive sent one of its reporters an unprompted email that reads: \"So is NPR going to start posting on Twitter again, or should we reassign @NPR to another company?\" NPR\nafter it was labeled \"state-affiliated media\" along with state-run outlets like Russia's RT. Musk apparently told NPR in their email exchange that Twitter's policy is to \"recycle handles that are definitively dormant\" and that \"same policy applies to all accounts.\" It's worth noting that it's been less than a month since NPR quit Twitter and that it definitely hasn't been \"several years\" yet.\nAt the moment, though, the website has yet to update its\n, which only states that users need to log in every 30 days to keep their account active. That part of the policy is pretty new, because Twitter had only required users to log in every six months as\n. Twitter's policy still also states that it \"cannot release inactive usernames at this time,\" but Musk hinted in a follow-up tweet that the company will be changing that rule. \"[I]t is important to free up abandoned handles,\" he wrote.\nWhen urged to rethink his decision, because killing inactive accounts will also delete tweets by deceased users, Musk responded that their accounts will be archived. What that means exactly remains to be seen."},
{"url": "http://news.yahoo.com//russia-losses-worse-anyone-thinks-170000710.html", "title": "Russia’s losses are worse than anyone thinks", "date": "2023-05-09T17:00:00.000Z", "content": "It was a curious sight.\n, a display of military might and a celebration of its role in defeating Nazi Germany, could only muster a\n. The serried ranks of tanks seen in recent years were absent; many of them will be lying burned out in the Donbas. Putin’s speech, meanwhile, was desperate, even delusional. He claimed civilisation was “at a decisive turning point”; that a “real war has been unleashed against Russia”; that the West seeks the “disintegration and destruction” of Russia. The only person driving towards that goal is Putin himself.\nHis army is in a shambolic condition, with multiple reports indicating that troops are fighting without adequate body armour. Young men are conscripted and thrown into the meat grinder of the Donbas, backed by\n. They face forces combining modern Western equipment with significant new tactical innovations. And they are being slaughtered.\nOver the last century, battlefield casualties for Western forces have seen a steady decline. Modern medical techniques, antibiotics and military developments have all played their role. But assumptions based on this experience may not work when estimating the losses suffered by Putin’s poorly-equipped conscripts.\nUkrainian reports of Russian casualties resemble something from the fronts of the\n, with hundreds killed and injured each day. Western analysts have tended to be more conservative in their estimates.\nBut this conflict is not like those we have seen previously. Kyiv’s forces are innovating new ways of conducting warfare, with drones at their heart. Tech savvy young men and women are repurposing and re-engineering for the battlefield off-the-shelf and inexpensive equipment developed for peace.\nThis is a game changing moment. Russia’s armed forces are centred around the use of artillery; various sources list Moscow’s expenditure of shells as multiples of Ukraine’s. And yet even pessimistic assessments show a casualty ratio skewed heavily in Ukraine’s favour, despite being theoretically outgunned.\nThe key to this appears to be innovation. What is unique to the Ukraine conflict is the use of both drones\n. Some analysts suggest that using the standard ratios of deaths/wounded will be very far from reflecting the lethality of this new mode of warfare. Some have gone so far as to suggest that the vast majority of artillery rounds and mortar shells fired by Kyiv’s forces will be watched by drone, allowing for – in artillery terms, at least – pinpoint accuracy.\nAnd the pace of change is set to continue. The Ukrainians have trained 10,000 drone operators, who will add to Kyiv’s capability to observe and guide indirect fire. This type of attack was called precision targeting when I first went to Afghanistan in 2008. In those days we would have a huge Nimrod aircraft with 20 or so operators on board, flying at 20,000ft with a single camera. There would be five or six of us on the ground monitoring the live feed; if the right target was identified we called in a precision air strike from a fighter jet. We conducted a few of these strikes per week. Later, we moved on to Reaper drones with hellfire missiles. But these strikes were rare; what Kyiv is doing is new.\nFighting a battle for national survival, every tank or enemy combatant is a fair target. the Ukrainians are developing techniques not only focused on precision attack but also on directing artillery fire. Battlefield footage\n– trenches, shells and casualties abound – but we have moved on from rare balloon spotters sending messages to guns. Now, there are hundreds of tiny drones with amazingly capable cameras, giving detailed pictures and highly accurate meta data back to the guns. This is a type of warfare which few in Nato have ever experienced; when Russian casualty rates as estimated by the West appear to be half what the Ukrainians are claiming, it is surely possible that the Ukrainians are right.\nThis is backed up by the scramble in Russia to find soldiers. Both sides might lack ammunition, but the Kremlin appears to be running out of soldiers to fire that ammunition. The long-term costs for Russia are likely to be devastating."},
{"url": "http://news.yahoo.com//body-missing-ceo-found-over-155700570.html", "title": "Body of missing CEO found over a year after he texted \"911\" and vanished", "date": "2023-05-09T15:57:00.000Z", "content": "The body of a sober living advocate and chief executive officer was found in California more than a year after he went missing, police said Monday.\nBeau Mann, 39, was the founder and CEO of Sober Grid, a digital health company that provides mental health addiction care in the United States and internationally with services including peer recovery counseling and social networking. Mann founded the company in 2015.\nThe remains were found in the 2900 block of Santa Monica Boulevard, the area's\n. The body was identified as Mann's on May 6.\nIn December 2021, Mann was reported missing to the Los Angeles Police Department, officials said. The CEO was last seen on Nov. 30, 2021.\n, Mann was last seen outside a convenience store in Studio City, wearing a blue baseball cap, dark sweatshirt and pants and black shoes. According to CBS Los Angeles, Mann texted \"911\" shortly after leaving the store.\nThe Los Angeles County Coroner has possession of the remains and is working to determine a cause of death, police said. According to\n, Mann's identity was confirmed with dental records.\n\"We want to thank all of those who helped us search for him and who prayed for Beau's safe return over the past year and a half. Beau was a beautiful soul who spent the better part of his life helping others. We miss his infectious smile and positive attitude every day. We know his spirit will live on through his company and passion, Sober Grid, as it continues to help those struggling with the grip of addiction,\" the family said in a statement provided to CBS Los Angeles.\nIn a statement on its\n, Sober Grid said that it was a \"sad day\" for the community. The organization said Mann's remains were found in a grassy area about a mile away from where he was dropped off by an Uber the day he went missing.\n\"We hope you will take a moment to think about Beau today. His bright smile and endless energy and compassion will be missed. While he is no longer with us, we know Beau's spirit will live on in Sober Grid's mission to help those in need,\" the organization said."},
{"url": "http://news.yahoo.com//the-morning-after-jack-dorsey-backed-twitter-alternative-bluesky-is-having-a-moment-111559853.html", "title": "The Morning After: Jack Dorsey-backed Twitter alternative, Bluesky, is having a moment", "date": "2023-05-09T11:15:59.000Z", "content": "Bluesky, the Jack Dorsey-backed decentralized social network, isn’t publicly available yet, but it’s already become\nGrabbing an invite to the service, which has been in a closed beta for barely two months, has become a digital status symbol, with invite codes selling for hundreds of dollars on eBay. The iOS app has been downloaded more than 375,000 times, according to analytics from data.ai – which is interesting considering the app only has about 65,000 users. Bluesky isn’t the first Twitter alternative to take off and see a surge in interest from former Twitter power users. Read on for a closer look at the latest attempt to replace Twitter in your life.\n– Mat Smith\nThe Bank of Canada wants the public’s opinions on a potential digital Canadian dollar. Although the country’s central bank says a national digital currency isn’t yet needed, it wants to remain flexible and ready should that ever change. The bank cites the diminishing use of cash, potential competition with cryptocurrencies and national economic stability as reasons to prepare for the potential shift. “A digital Canadian dollar would ensure Canadians always have an official, safe and stable digital payment option issued by Canada’s central bank,” the bank says. But it also emphasized that, even if it eventually launched a national digital currency, it would still issue bank notes for anyone who wants them. “Cash isn’t going anywhere,” it unequivocally states.\nUniversal has released a trailer for\n, Christopher Nolan's biopic of the physicist who played a key role in developing and testing the first atomic bomb. While the team hopes nuclear weapons will end World War II and usher in a new era of peace, they're also worried about sparking an apocalyptic arms race. The adaptation of Kai Bird and Martin Sherwin's\nbook stars Cillian Murphy (\n) as its namesake scientist, with Emily Blunt as Oppenheimer's wife, Katherine.\nAyaneo, a relatively unknown player, has become one of the more prolific names in the handheld gaming PC world. Its newest handheld, the Air Plus, is the third iteration of Ayaneo’s Air series, and it has a choice of either AMD or Intel chipsets. The model we tested is the Ryzen 6800U processor, meaning it’s technically very similar to the Ayaneo 2 we reviewed a few months ago. The Air Plus is a shade smaller than a Nintendo Switch (albeit somewhat thicker), unlike the Ayaneo 2, which has a profile closer to the Steam Deck. While the entry-level 64GB Steam Deck will set you back $400, the base Ayaneo Air Plus costs\nbefore it eventually retails for $979.\nSony's X-Series party speakers typically have a few tricks up their sleeves to power your gatherings. The company's latest model, the SRS-XV800, packs in a lot, but it also has an additional handy tool. Besides a built-in light show, karaoke mode and more, this speaker can connect to your TV through its optical port. Sony says you can expect up to 25 hours of battery life on the XV800, but that's with the customizable built-in light show turned off. This speaker may be portable, but it's also a beast. Sony added wheels and a handle, so you don't have to carry this behemoth when you need to move it."},
{"url": "http://news.yahoo.com//openais-tool-attempts-explain-language-170052959.html", "title": "OpenAI's new tool attempts to explain language models' behaviors", "date": "2023-05-09T17:00:52.000Z", "content": "It's often said that large language models (LLMs) along the lines of\nare a black box, and certainly, there's some truth to that. Even for data scientists, it's difficult to know why, always, a model responds in the way it does, like inventing facts out of whole cloth.\nIn an effort to peel back the layers of LLMs, OpenAI is\na tool to automatically identify which parts of an LLM are responsible for which of its behaviors. The engineers behind it stress that it's in the early stages, but the code to run it is available in open source on GitHub as of this morning.\n\"We're trying to [develop ways to] anticipate what the problems with an AI system will be,\" William Saunders, the interpretability team manager at OpenAI, told TechCrunch in a phone interview. \"We want to really be able to know that we can trust what the model is doing and the answer that it produces.\"\nTo that end, OpenAI's tool uses a language model (ironically) to figure out the functions of the components of other, architecturally simpler LLMs -- specifically OpenAI's own GPT-2.\nOpenAI's tool attempts to simulate the behaviors of neurons in an LLM.\nOpenAI\nHow? First, a quick explainer on LLMs for background. Like the brain, they're made up of \"neurons,\" which observe some specific pattern in text to influence what the overall model \"says\" next. For example, given a prompt about superheros (e.g. \"Which superheros have the most useful superpowers?\"), a \"Marvel superhero neuron\" might boost the probability the model names specific superheroes from Marvel movies.\nOpenAI's tool exploits this setup to break models down into their individual pieces. First, the tool runs text sequences through the model being evaluated and waits for cases where a particular neuron \"activates\" frequently. Next, it \"shows\" GPT-4, OpenAI's\n, these highly active neurons and has GPT-4 generate an explanation. To determine how accurate the explanation is, the tool provides GPT-4 with text sequences and has it predict, or simulate, how the neuron would behave. In then compares the behavior of the simulated neuron with the behavior of the actual neuron.\n\"Using this methodology, we can basically, for every single neuron, come up with some kind of preliminary natural language explanation for what it's doing and also have a score for how how well that explanation matches the actual behavior,\" Jeff Wu, who leads the scalable alignment team at OpenAI, said. \"We're using GPT-4 as part of the process to produce explanations of what a neuron is looking for and then score how well those explanations match the reality of what it's doing.\"\nThe researchers were able to generate explanations for all 307,200 neurons in GPT-2, which they compiled in a dataset that's been released alongside the tool code.\nTools like this could one day be used to improve an LLM's performance, the researchers say -- for example to cut down on bias or toxicity. But they acknowledge that it has a long way to go before it's genuinely useful. The tool was confident in its explanations for about 1,000 of those neurons, a small fraction of the total.\nA cynical person might argue, too, that the tool is essentially an advertisement for GPT-4, given that it requires GPT-4 to work. Other LLM interpretability tools are less dependent on commercial APIs, like DeepMind's\n, a compiler that translates programs into neural network models.\nWu said that isn't the case -- the fact the tool uses GPT-4 is merely \"incidental\" -- and, on the contrary, shows GPT-4's weaknesses in this area. He also said it wasn't created with commercial applications in mind and, in theory, could be adapted to use LLMs besides GPT-4.\nThe tool identifies neurons activating across layers in the LLM.\nOpenAI\n\"Most of the explanations score quite poorly or don't explain that much of the behavior of the actual neuron,\" Wu said. \"\nThat's to say nothing of more complex, newer and larger models, or models that can browse the web for information. But on that second point, Wu believes that web browsing wouldn't change the tool's underlying mechanisms much. It could simply be tweaked, he says, to figure out why neurons decide to make certain search engine queries or access particular websites.\n\"We hope that this will open up a promising avenue to address interpretability in an automated way that others can build on and contribute to,\" Wu said. \"The hope is that we really actually have good explanations of not just what neurons are responding to but overall, the behavior of these models -- what kinds of circuits they're computing and how certain neurons affect other neurons.\""},
{"url": "http://news.yahoo.com//apple-is-bringing-final-cut-pro-and-logic-pro-to-ipad-on-may-23rd-132957320.html", "title": "Apple is bringing Final Cut Pro and Logic Pro to iPad on May 23rd", "date": "2023-05-09T13:29:57.000Z", "content": "Apple finally has professional creative software to match the\n. The company is\nboth Final Cut Pro and Logic Pro for iPad on May 23rd. The two tablet apps now feature a touch-friendly interface and other iPad-specific improvements, such as Pencil and Magic Keyboard support (more on those in a moment). At the same time, Apple wants to reassure producers that these are full-featured apps that won't leave Mac users feeling lost.\nFinal Cut Pro adds a jog wheel (similar to a physical video controller) to help you quickly navigate and make certain edits. Other touch inputs make it easy to reorder and edit clips, Apple claims. Things get better if you have an Apple Pencil. You can draw directly on your content, and hover over the timeline (on iPad Pro M2 models) to skim footage. You can edit HDR video on a 12.9-inch iPad Pro, and there's even a pro camera mode that lets you adjust elements like white balance and (on M2 iPads) record in the ProRes format.\nAt the same time, Apple wants to reassure creators that Final Cut Pro for iPad can fit into a familiar workflow. It supports multi-camera video editing as well as customizable graphics and auto-adjusting soundtracks. You can easily remove background images or noises, and automatically crop to fit common video aspect ratios. Projects created on the iPad can be sent to a Mac (and vice versa), and you can bring in video from iMovie for iOS. Add a keyboard and you can use shortcuts like you would on your computer.\nLogic Pro, meanwhile, takes advantage of touch to let you perform on the iPad itself. You'll find a collection of instruments you can play using keyboards and other virtual interfaces, and a surprisingly deep mixer includes channel strips, faders, plug-ins and similar controls. There's a new sound browser to help find patches, samples and other content in one place. Along with the usual effects and plug-ins (including vintage EQs), there are new tools for manipulating samples, crafting beats, designing drum kits and producing loops.\nAs with Final Cut, Logic Pro on iPad can exchange projects with its Mac equivalent. You can export music to Final Cut or as individual audio stems, and import tracks from GarageBand for iOS if you need the more advanced production suite.\nThe requirements are relatively steep for Final Cut Pro. While Logic Pro will work with any A12-equipped iPad or newer, you'll need at least an M1-based iPad just to use the video editor. Neither is surprising given the demands of pro-level media software, but there's a good chance you'll have to invest in a new iPad.\nThe apps represent a change in Apple's pricing strategy. Where Final Cut Pro and Logic Pro for Mac are one-time purchases, you'll have to subscribe to the iPad versions for either $5 per month or $49 per year. There's a one-month free trial. The move isn't surprising given Apple's increasing\nfor revenue, but it may be disappointing if you were hoping to avoid the industry's fascination with subscriptions.\nEven so, these apps may be worth the outlay. Apple has routinely faced criticism for marketing pro iPads that don't have first-party software to justify the expense. While third parties have stepped up with offerings like Adobe's (limited) suite and Blackmagic's\n, you couldn't realistically use an iPad as part of an all-Apple creative solution. So long as the iPad editions of Final Cut Pro and Logic Pro meet your needs, you can buy them to either supplement your Mac setup or serve as an all-in-one production studio."},
{"url": "http://news.yahoo.com//scientist-says-hes-solved-bermuda-175500114.html", "title": "A Scientist Says He's Solved the Bermuda Triangle, Just Like That", "date": "2023-05-09T17:55:00.000Z", "content": "An Australian scientist says probabilities are the leading cause of the Bermuda Triangle disappearances. And he’s not the only one.\nAdd in suspect weather, and iffy plane and boat piloting, and Karl Kruszelnicki believes there’s no reason to believe in the Bermuda Triangle phenomenon.\nWhile the conspiracy of the Bermuda Triangle has existed for decades, the National Oceanic and Atmospheric Association and Lloyd’s of London has long championed the same ideas.\nPick any one of the more than 50 ships or 20 planes that have disappeared in the Bermuda Triangle in the last century. Each one has a story without an ending, leading to a litany of\nabout the disappearances in the area, marked roughly by Florida, Bermuda, and the Greater Antilles.\nAustralian scientist Karl Kruszelnicki, along with the United States’ own National Oceanic and Atmospheric Association (NOAA), don’t subscribe to the Bermuda Triangle’s supernatural reputation. Both have been saying for years that there’s really no Bermuda Triangle mystery. In fact, the loss and disappearance of ships and planes is a mere fact of probabilities.\n“There is no evidence that mysterious disappearances occur with any greater frequency in the Bermuda Triangle than in any other large, well-traveled area of the ocean,” NOAA\nin 2010.\nAnd since 2017, Kruszelnicki has been saying the same thing.\nthat the sheer volume of traffic—in a tricky area to navigate, no less—shows “the number [of ships and planes] that go missing in the Bermuda Triangle is the same as anywhere in the world on a percentage basis.” He says that both Lloyd’s of London and the U.S. Coast Guard support that idea. In fact, as\n, Lloyd’s of London has had this same theory since the 1970s.\nNOAA says environmental considerations can explain away most of the Bermuda Triangle disappearances, highlighting the Gulf Stream’s tendency towards violent changes in weather, the number of islands in the Caribbean Sea offering a complicated navigation adventure, and evidence that suggests the Bermuda Triangle may cause a magnetic compass to point to true north instead of magnetic north, causing for confusion in wayfinding.\n“The U.S. Navy and U.S. Coast Guard contend that there are no supernatural explanations for disasters at sea,” NOAA\n. “Their experience suggests that the combined forces of nature and human fallibility outdo even the most incredulous science fiction.”\nKruszelnicki has routinely garnered public attention for espousing these very thoughts on the Bermuda Triangle, first in 2017 and then again in\nbefore resurfacing once more in\n. Throughout it all, he’s stuck to the same idea: the numbers don’t lie.\nEven with some high-profile disappearances—such as\n, a group of five U.S. Navy TBM Avenger torpedo bombers lost in 1945—pushing the theory into popular culture, Kruszelnicki points out that every instance contains a degree of poor weather or likely human error (or both, as in the case of Flight 19) as the true culprit.\nBut culture clings to Bermuda Triangle conspiracy theories. The concepts of sea monsters, aliens, and even the entirety of Atlantis dropping to the ocean floor—those are fodder for books, television, and movies. It sure does sound more exciting than poor weather and mathematical probabilities, anyway, even if the “boring” story holds more water."},
{"url": "http://news.yahoo.com//apples-new-beats-studio-headphones-could-support-personalized-spatial-audio-200614057.html", "title": "Apple's new Beats Studio headphones could support personalized spatial audio", "date": "2023-05-09T20:06:14.000Z", "content": "It has been more than five years since Beats last refreshed its\n, but a new model could be on the way. According to\n, Apple is “about” to launch a set of Beats Studio Pro headphones. The new model reportedly features a custom Beats chip that promises improved active noise cancellation and transparency mode performance. For the first time, the Studio line may also feature personalized spatial audio. Additionally,\nspeculates the new model will come with a USB-C port for fast charging.\nVisually, the headphones look similar to the current Studio3 model, though it appears Apple has done away with the “Studio” branding found on the side of those headphones. Based on codenames found by\nin the internal files for iOS 16.5’s release candidate, Apple collaborated with fashion designer Samuel Ross, best known for starting the clothing label A-Cold-Wall, on the design of the Beats Studio Pro. Images the outlet found in those same files suggest Apple will offer the headphones in four colorways: blue, black, brown and white.\nIt’s unclear if Apple intends for the Beats Studio Pro to replace the $349 Studio3 headphones, or if the company plans to market them as a more premium offering. According to\n, Apple is also working on a set of Studio Buds+. They will reportedly support audio sharing, automatic device switching and Hey Siri integration. The outlet\nsuggests both products will arrive in stores soon."},
{"url": "http://news.yahoo.com//backed-sequoia-southeast-asia-squarex-040017062.html", "title": "Backed by Sequoia Southeast Asia, SquareX protects web users with disposable browsers", "date": "2023-05-10T04:00:17.000Z", "content": "Much of our computer time is spent in a web browser, where we check emails, create documents, transfer files, carry out online banking, shop or stream entertainment. This leaves us vulnerable to security threats like phishing, identity theft and session hijacking, but many cybersecurity tools were created when the main threats were file viruses, worms and network attacks, said\n, the cybersecurity entrepreneur and researcher who discovered the\n.\nTo combat browser-based vulnerabilities, Ramachandran founded\n. The Singapore-based cybersecurity startup announced today it has raised $6 million in seed funding from Sequoia Capital Southeast Asia, which it will use on R&D engineering and its go-to-market plans.\nSquareX wants to serve as an alternative to current cybersecurity products by being tailor-made for browser-based cloud SaaS tools. It integrates with browsers as an extension and lets users open links and files in disposable browsers that serve as temporary container sandboxes. The headless browsers run in SquareX’s data centers so threats don’t reach users’ computers and they don’t need to worry about their personal information being exposed.\nBefore launching SquareX, Ramachandran was the founder of Pentester Academy, a cloud-based cybersecurity training startup that lets users and enterprises study how hackers break into their company. Pentester Academy was\n.\nSquareX founder Vivek Ramachandran\nRamachandran told TechCrunch that while running Pentester Academy, his customers complained about how often their security products were disabled by users because they got in the way of their productivity. For example, someone in the process of receiving of an important Word document from a contact would have that file flagged as malware and would end up disabling security software in order to view it. As a result, Ramachandran realized that many security products are actually counterproductive because they make people less likely to use them.\nAs a result, he created SquareX, which does not block access to files or resources, even when they have been categorized as potentially malicious. Instead, it uses its disposable browsers. Ramachandran said SquareX is intended as a alternative to VPN, anti-virus, anti-malware and other endpoint security solutions.\nSquareX’s disposable browsers enable anonymous browsing from any location. Users can “dispose” of it at anytime, which means no data is retained and the browser session is destroyed and removed from SquareX’s servers immediately. Ramachandran said it is safer and more private than incognito mode because websites the user visits or files they download don’t get stored in their computer.\n“By creating disposable environments, SquareX ensures that a user’s identity and data is decoupled when accessing the internet,” he added. “This ensures that even the most sophisticated website trackers would fail to track and log the users activities and tie it to their identity.”\nSquareX’s go-to-market strategy will focus on the United States, the United Kingdom and Asia first.\nIn a statement about the funding, Anandamoy Roychowdhary, Surge partner at Sequoia Southeast Asia, said, “The online world is about to get a whole lot worse as the AI revolution gets channeled towards building malicious code. Every cybersecurity solution out there is only probabilistically successful in protecting internet users, which is not of much comfort if they get hacked and lose money. SquareX is the first solution we’ve seen that takes a 100% protection approach--where irrespective of how new and sophisticated the attack is, it has no chance to infect users. This is the future we think all internet users deserve.”"},
{"url": "http://news.yahoo.com//gen-z-adults-unaware-sunburn-risks-tanning-myths-204506852.html", "title": "20% of Gen Z adults say getting a tan is 'more important' to them than preventing skin cancer. Experts weigh in — and they're concerned.", "date": "2023-05-09T20:45:06.000Z", "content": "Most Gen Z adults ages 18 to 25 are unaware of the risks of sunburn and some believe outdated myths about tanning, according to a\nfrom the American Academy of Dermatology.\nThe survey of more than 1,000 Gen Z adults revealed that 71% of them are unaware of the risks associated with sunburn. Thirty-six percent reported having a sunburn in 2022, and 41% of those said the sunburn was severe enough that it made wearing clothes uncomfortable.\nNearly 60% of those surveyed also believed old tanning myths, such as that tanning is healthy and that a base tan will prevent sunburn. Even those who may know that tanning is harmful aren't necessarily willing to give that up and practice sun safety. The survey found that 20% of Gen Z adults reported that getting a tan is \"more important\" to them than preventing skin cancer, while 30% admitted that \"it's worth looking great now even if it means looking worse later in life,\" according to the survey.\nExperts aren't entirely surprised by this. \"I think it is a commonly repeated trend with each generation: The younger people in their teens and 20s feel invincible and don't think that it 'will happen to them,'\"\n, dermatologist and medical director at Schweiger Dermatology Group in New York, tells Yahoo Life. \"They also tend to worry less about things that may happen to them in the distant future. This is in part just normal human nature. Therefore, I am not entirely surprised that these statistics show that they are not as concerned about sun protection.\"\nThat said, Fenton adds that he would have expected this generation to be \"more aware of sun safety and the risks of excessive sun exposure than prior generations at the same age. The data quoted above doesn't compare to past generations at the same age, so it's hard to say if things are getting better or worse.\"\n, a dermatologist in Texas and fellow of the American Academy of Dermatology, says that most teenagers and young adults don't often think about the long-term consequences of their decisions — and that includes sun exposure. \"As a mother of three teenagers I can certainly speak to that,\" Holman tells Yahoo Life. \"While we are seeing fewer young adults and teenagers using tanning beds, the education around sun safety doesn't always resonate. When I speak to younger patients about the risks of sunburns and tanning, they often listen more when I speak about the cosmetic consequences, as 'skin cancer' doesn't seem like it can affect them.\"\nPart of the problem is that wearing sunscreen and protecting yourself from the sun is a preventative behavior without immediate benefits, explains\n, associate professor of dermatology and the director of cosmetic and clinical research in dermatology at Mount Sinai Hospital in New York. \"It can be difficult to motivate people to prevent something from possibly happening in the future when they are living in the present,\" he tells Yahoo Life. \"Generally speaking, people live in disbelief that something like skin cancer will happen to them until it is too late.\"\nSunburns not only cause premature aging, such as wrinkles and dark spots, but they also raise the risk of developing skin cancer, says Zeichner. \"Even a single sunburn can increase your lifetime risk for both skin cancer and the deadliest form of skin cancer,\n,\" explains Holman.\nWhen you get a sunburn, that's a sign that you have a significant amount of damage to the skin from ultraviolet (UV) radiation, explains Fenton. \"This damage is not just what you see: redness and peeling that goes away,\" he says. \"The damage is done on a cellular level to the DNA in the skin cells.\"\nThis DNA damage is what can lead to skin cancers in the future. \"Just one blistering sunburn in childhood or adolescence will double your risk of melanoma later in life,\" says Fenton.\nEven if you never get a sunburn, cumulative exposure to UV rays has been \"definitively\" shown to increase your risk of skin cancers in addition to aging the skin, says Fenton. While a tan might look good on the outside to some, it's actually a sign that your body is responding to DNA breakage and damage to the skin. \"The skin is trying to protect itself by producing more melanin or pigment,\" explains Fenton. \"Therefore, a tan is a response of your skin to damage. You cannot get a tan without incurring some damage to your skin.\"\nHolman agrees, saying: \"There is no such thing as a healthy tan if your tan is from a tanning bed or exposure to the sun.\" She adds that the myth of a base tan \"just doesn't make sense,\" saying: \"It's exposing your body to smaller amounts of carcinogens so you can be exposed to larger amounts of carcinogens. Overall, the damage continues to accumulate.\"\nExperts say that raising awareness about the risks of sun exposure — both in terms of skin cancer and premature aging — can help encourage people to prioritize sun protection over getting a tan, along with the message that self-tanner is a safer alternative to UV tanning for those who want the look of a tan.\n\"Just like seatbelts and smoking, with more education we should see safer behavior,\" says Fenton. \"Many people don't really understand the true risk of melanoma, which is deadly. Many people also don't understand the potential risk of non-melanoma skin cancer, such as being left with disfiguring scars on the face and body.\"\nGen Z is not the only generation to choose short-term benefits and what Holman calls \"feel-good options\" in many areas of life while ignoring the risks to their health. \"Sun exposure is no different,\" she says. But experts say it's important for young adults and teens in particular to understand that the risk of skin cancer, including melanoma, \"is not just a disease of the elderly,\" says Holman. \"All ages need to be aware of the risks of suntanning and sunburns, as what you do as a child and young adult impacts your long-term risk.\"\nTo reduce your risk of skin cancer, Holman recommends seeking shade when out in the sun, wearing protective clothing and applying a broad-spectrum, water-resistant sunscreen with an SPF of 30 or higher to all skin that clothing doesn't cover. If you notice any new spots on your skin, any spots that look different from the others or anything changing, itching or bleeding, see a dermatologist to get it checked out."},
{"url": "http://news.yahoo.com//canadian-money-king-charles-currency-182603192.html", "title": "Canadian money is going to look a little different now that Charles is King", "date": "2023-05-09T18:26:03.000Z", "content": "In light of King Charles’ recent coronation, Canadian $20 bills and coins will soon be getting a facelift.\nOttawa announced that banknotes and coinage will be redesigned to feature a portrait of the commonwealth’s newest head of state, replacing the representation of his mother, Queen Elizabeth II, who died on Sept. 8, 2022.\nThe federal government says the redesigned coins featuring an updated effigy will be available in the coming months, while the bank notes will take a few years, but an exact timeline has not been revealed. The final design will need the official approval of the King before going into circulation.\nAn effigy of the reigning monarch first started appearing on Canadian coins in 1908, when the Mint began production, then on Canadian bank notes beginning in 1935, when the Bank of Canada launched.\nDuring her reign, Queen Elizabeth II was featured on four different versions of our coins over the years: in 1953, 1965, 1990 and 2003. Money featuring her image that remains in circulation will continue to be considered legal tender.\nElsewhere in the Commonwealth, the King’s official effigy coins are already being featured in the UK on the 50-pence coin and a commemorative 5-pound coin, which were released in December 2022.\nFollowing the traditional design of the coin, the King’s portrait faces to the left, while the portrait of Queen Elizabeth II faced to the right.\nThe Bank of England also announced in December what their 5, 10, 20 and 50-pound banknotes\nwith the new portrait of King Charles. Those banknotes are expected to go into circulation by mid-2024.\nThe Reserve Bank of New Zealand revealed that it will feature King Charles’ portrait on its money, replacing that of his mother. But in Australia, the King's likeness won't appear on banknotes. Instead, the Reserve Bank said it intends to replace the Queen’s effigy on $5 banknotes with an Indigenous design honouring the legacy and culture of the First Australians. King Charles will still be featured on the country's coins.\nMeanwhile, several Caribbean nations won’t follow the lead of England, Canada and New Zealand in replacing their legal tender’s imagery of the reigning monarch. The Eastern Caribbean Central Bank has politely declined the idea of a redesign, reportedly saying they had “no appetite” for such a change.\nJustin Vovk is a royal historian and PhD candidate of early modern history at McMaster University. He says as long as humans have been printing their own currency, they've put rulers' faces on it. This dates back to ancient Rome, when Caesar's face was stamped on coins. When England started minting its own coins in the 1200s and 1300s, putting the monarch's face on it was a way of showing all money in the kingdom was owned by the King. It was also a way of preventing fraud.\n\"In those days, coins were valued based on the amount of mineral and silver that was in them,\" he tells\n. \"So you have the King's face stamped on it was a way of showing its authenticity.\"\nVovk says while many Canadians were surprised by the announcement that the King will be featured on our currency, he says it's a way for the government to strengthen its connection with the monarchy. But the other option wouldn't be as big a deal as people would think.\n\"Canada has its own unique history, events and people who've shaped the uniqueness of Canada,\" he says. \"Having other people (than the reigning monarch) on the currency isn't a huge slight to the monarchy...when you're trying to adapt the monarchy to try and make it relevant to each country, it means it's an evolutionary process.\""},
{"url": "http://news.yahoo.com//ibm-intros-slew-ai-services-100017567.html", "title": "IBM intros a slew of new AI services, including generative models", "date": "2023-05-09T10:00:17.000Z", "content": "IBM, like pretty much every tech giant these days, is betting big on AI.\nAt its annual Think conference, the company announced IBM Watsonx, a new platform that delivers tools to build AI models and provide access to pretrained models for generating computer code, text and more.\nIt's a bit of a slap in the face to IBM's back-office managers, who just recently were\nthat the company will pause hiring for roles it thinks could be replaced by AI in the coming years.\nBut IBM says the launch was motivated by the challenges many businesses still experience in deploying AI within the workplace. Thirty percent of business leaders responding to an IBM survey cite trust and transparency issues as barriers holding them back from adopting AI, while 42% cite privacy concerns -- specifically around generative AI.\n\"AI may not replace managers, but the managers that use AI will replace the managers that do not,\" Rob Thomas, chief commercial officer at IBM, said in a roundtable with reporters. \"It really does change how people work.\"\nWatsonx solves this, IBM asserts, by giving customers access to the toolset, infrastructure and consulting resources they need to create their own AI models or fine-tune and adapt available AI models on their own data. Using Watsonx.ai, which IBM describes in fluffy marketing language as an \"enterprise studio for AI builders,\" users can also validate and deploy models as well as monitor models post-deployment, ostensibly consolidating their various workflows.\nBut wait, you might say, don't rivals like Google, Amazon and Microsoft already provide this or something fairly close to it? The short answer is yes. Amazon's comparable product is SageMaker Studio, while Google's is Vertex AI. On the Azure side, there's Azure AI Platform.\nIBM makes the case, however, that Watsonx is the\nAI tooling platform in the market that provides a range of pretrained, developed-for-the-enterprise models and \"cost-effective infrastructure.\"\n\"You still need a very large organization and team to be able to bring [AI] innovation in a way that enterprises can consume,\" Dario Gil, SVP at IBM, told reporters during the roundtable. \"And that is a key element of the horizontal capability that IBM is bringing to the table.\"\nThat remains to be seen. In any case, IBM is offering seven pretrained models to businesses using Watsonx.ai, a few of which are open source. It's also partnering with Hugging Face, the AI startup, to include thousands of Hugging Face–developed models, datasets and libraries. (For its part, IBM is pledging to contribute open source AI dev software to Hugging Face and make several of its in-house models accessible from Hugging Face's AI development platform.)\nThe three that the company is highlighting at Think are fm.model.code, which generates code; fm.model.NLP, a collection of large language models; and fm.model.geospatial, a model built on climate and remote sensing data from NASA. (Awkward naming scheme? You betcha.)\nSimilar to code-generating models like GitHub's\n, fm.model.code lets a user give a command in natural language and then builds the corresponding coding workflow. Fm.model.NLP comprises text-generating models for specific and industry-relevant domains, like organic chemistry. And fm.model.geospatial makes predictions to help plan for changes in natural disaster patterns, biodiversity and land use, in addition to other geophysical processes.\nThese might not sound novel on their face. But IBM claims that the models are differentiated by a training dataset containing \"multiple types of business data, including code, time-series data, tabular data and geospatial data and IT events data.\" We'll have to take its word for it.\n\"We allow an enterprise to use their own code to adapt [these] models to how they want to run their playbooks and their code,\" Arvind Krishna, the CEO of IBM, said in the roundtable. \"It's for use cases where people want to have their own private instance, whether on a public cloud or on their own premises.\"\nIBM is using the models itself, it says, across its suite of software products and services. For example, fm.model.code powers Watson Code Assistant, IBM's answer to Copilot, which allows developers to generate code using plain English prompts across programs including Red Hat's Ansible. As for fm.model.NLP, those models have been integrated with AIOps Insights, Watson Assistant and Watson Orchestrate -- IBM's\ntoolkit,\nand workflow automation tech, respectively -- to provide greater visibility into performance across IT environments, resolve IT incidents in a more expedient way and improve customer service experiences -- or so IBM promises.\nFM.model.geospatial, meanwhile, underpins IBM's EIS Builder Edition, a product that lets organizations create solutions addressing environmental risks.\nAlongside Watsonx.ai, under the same Watsonx brand umbrella, IBM unveiled Watsonx.data, a \"fit-for-purpose\" data store designed for both governed data and AI workloads. Watsonx.data allows users to access data through a single point of entry while applying query engines, IBM says, plus governance, automation and integrations with an organization’s existing databases and tools.\nComplementing Watsonx.ai and Watsonx.data is Watsonx.governance, a toolkit that -- in IBM's rather vague words -- provides mechanisms to protect customer privacy, detect model bias and drift, and help organizations meet ethics standards.\nIn an announcement related to Watsonx, IBM showcased a new GPU offering in the IBM cloud optimized for compute-intensive workloads -- specifically training and serving AI models.\nThe company also showed off the IBM Cloud Carbon Calculator, an \"AI-informed\" dashboard that enables customers to measure, track, manage and help report carbon emissions generated through their cloud usage. IBM says it was developed in collaboration with Intel, based on tech from IBM's research division, and can help visualize greenhouse gas emissions across workloads down to the cloud service level.\nIt could be said that both products, in addition to the new Watsonx suite, represent something of a doubling down on AI for IBM. The company recently built an AI-optimized supercomputer, known as Vela, in the cloud. And it has announced collaborations with companies such as Moderna and SAP Hana to investigate ways to apply generative AI at scale.\nThe company expects AI could add $16 trillion to the global economy by 2030 and that 30% of back-office tasks will by automated within the next five years.\n\"When I think of classic back-office processes, not just customer care -- whether it's doing procurement, whether it's elements of supply chain [management], whether it's elements of IT operations, or elements of cybersecurity ... we see AI easily taking anywhere from 30% to 50% of that volume of tasks, and being able to do them with much better proficiency than even people can do them,\" Gil said.\nThose might be optimistic (or pessimistic, if you're humanist-leaning) predictions, but Wall Street has historically rewarded the outlook. IBM's automation solutions -- part of the company's software segment -- grew revenue by 9% year over year in Q4 2022. Meanwhile, revenue from data and AI solutions, which focuses more on analytics, customer care and supply chain management, grew sales by 8%.\nBut as a piece in Seeking Alpha\n, there's reason to lower expectations. IBM has a difficult history with AI, having been forced to sell its Watson Health division at a substantial loss after technical problems led high-profile customer partnerships to deteriorate. And rivalry in the AI space is intensifying; IBM faces competition not only from tech giants like Microsoft and Google but also from startups like\nand\nthat have massive capital backing.\nWill IBM's new apps, tools and services make a dent? IBM's hoping so. But we'll have to wait and see."},
{"url": "http://news.yahoo.com//jonathan-majors-court-appearance-attorney-slams-assault-case-witch-hunt-highlights-racial-bias-154248692.html", "title": "Jonathan Majors makes court appearance as attorney slams assault case as a 'witch hunt' that highlights 'racial bias'", "date": "2023-05-09T15:42:48.000Z", "content": "appeared via Zoom in court on Tuesday as the\nstar faces charges of assault and harassment. The 33-year-old actor — considered Hollywood's next big thing following the HBO hit\n, a string of lauded indie films and being tapped to play Kang, the Marvel Cinematic Universe's latest existential threat, in several titles leading up to 2025's\n— finds his career hanging in the balance after domestic violence allegations surfaced two months ago.\nTuesday's conference was brief and routine. According to\n, the judge discussed a motion filed by the actor's defense team and prosecutors have until May 23 to respond. The defense will then have until May 31 to respond back. Majors will next appear in court on June 13 — and he must be there in person or a warrant can be issued for his arrest.\n\"I obviously don't want that to happen, so just stay in touch with your attorney,\" the judge reportedly told the rising star.\nMajors, through his representatives, has maintained his innocence amid the troubling headlines. The actor's attorney, Priya Chaudhry, issued the following statement on Tuesday after court:\nWe have provided the District Attorney (D.A.) with irrefutable evidence that the woman is lying, including video proof showing nothing happened, especially not where she claimed. We did this with the explicit promise from the D.A. that they would not 'fix' their case and change it as we proved the woman is lying.\nYet this false case continues, the woman's claimed location shifts and her story morphs. This is a witch hunt against Jonathan Majors, driven by baseless claims. Instead of dismissing the allegations in the face of the woman's clear lies, the D.A. has adjusted the charges to match the woman's new lies. To be clear, there are no new charges against Mr. Majors.\nNow, we have obtained even more video evidence of his innocence, but we are hesitant to share it, for fear the D.A. will tip the woman off to change her story again.\nThe criminal justice system is saturated with explicit and implicit bias. When Mr. Majors showed a white police officer the injuries the woman caused him, the white officer got in Mr. Majors's face and taunted him, saying that if the officer were to slap Mr. Majors, the officer wouldn't break his finger. None of the white officers present investigated the assault of Mr. Majors. Worse, the District Attorney has not indicated any intention to pursue charges against the woman, or even investigate the truth.\nThis glaring double standard between the treatment of Jonathan Majors, a Black man weighing 200 lbs., and his accuser, highlights the racial bias that permeates the criminal justice system.\nFans and studio executives are anxiously watching how everything unfolds. Did more women come forward? Will the D.A. proceed with the case? Here's what we know about the situation.\nPolice respond to a 911 call involving a dispute between Majors and a 30-year-old woman, later revealed to be his girlfriend at the time.\n\"The victim informed police she was assaulted,\" a spokesperson for the NYPD said in a\n. \"Officers placed the 33-year-old male into custody without incident. The victim sustained minor injuries to her head and neck and was removed to an area hospital in stable condition.\"\nA representative for Majors denies wrongdoing via email: \"We look forward to clearing his name and clearing this up.\"\nA judge grants the alleged victim a limited order of protection and orders that Majors be released on his own recognizance.\nMajors is arraigned on a complaint involving misdemeanor charges for assault and aggravated harassment, the Manhattan District Attorney's Office confirms. In the complaint, the accuser claims the actor struck her \"about the face with an open hand, causing substantial pain and a laceration behind her ear.\" She also accuses him of putting \"his hand on her neck, causing bruising and substantial pain.\"\nMajors hires criminal defense attorney Priya Chaudhry, who represented\nstar Jen Shah in her federal trial. Chaudhry issues a more\nstatement, telling the media Majors \"is provably the victim of an altercation with a woman he knows\" and claimed the woman was having \"an emotional crisis.\" The attorney adds that her team has evidence clearing Majors, including \"video footage from the vehicle where this episode took place, witness testimony from the driver and others who both saw and heard the episode, and most importantly, two written statements from the woman recanting these allegations.\"\nThe U.S. Army suspends its TV ad campaign featuring the\nvillain, saying they are \"deeply concerned by the allegations surrounding his arrest.\"\nMajors's lawyer\ntext messages between the actor and alleged victim, but the correspondence only raises more questions.\nIn a new statement, Chaudhry tells Yahoo that Majors was the one who called 911 \"out of concern for the woman's mental health. ... The police arrived with the paramedics, as is standard procedure, and arrested Mr. Majors due to an NYPD protocol requiring arrest in certain circumstances. On that same day, only seven and nine hours later, the woman sent text messages to Mr. Majors admitting that she was the one who used physical force against him. She also disavowed any allegations that he had done anything to her and confirmed that Mr. Majors called 911 because of her mental condition. These are those messages, redacting the woman’s name for her privacy.\"\nIn the messages, which Yahoo can't authenticate, the woman says, \"Please let me know you're OK when you get this. They assured me that you won't be charged. They said they had to arrest you as protocol when they saw the injuries on me and they knew we had a fight. I'm so angry that they did. And I'm sorry you're in this position. Will make sure nothing happens about this.\"\nThe alleged victim says in another text she told police \"it was my fault for trying to grab your phone. I only just got out of hospital. I love you.\"\nA few hours later, the woman writes to Majors: \"They just called again to check on me and I reiterated how this was not an attack and they do not have my blessing on any charges being placed. I read the paper they gave me about strangulation and I said point blank this did not occur and should be removed immediately. The judge is definitely going to be told this. I know you have the best team and there's nothing to worry about I just want you to know that I'm doing all I can on my end. I also said to tell the judge to know that the origin of the call was to do with me collapsing and passing out and your worry as my partner due to our communication prior. Out of care. She promised all will be relayed.\"\nMajors is dropped by his publicist and manger, a shocking move given his slate of projects over the next several years and the fact that it's still weeks away from his first court date. The actor was already generating awards buzz for his role in\n, a critic favorite emerging from this year's Sundance Film Festival. He shot the second season of\nfor Disney+ and was due to appear in at least three upcoming Marvel films through 2025. As for his future in the MCU, there have not been discussions about recasting his role, with sources saying the Disney-owned studio is taking a wait-and-see approach.\nreports Majors has been dropped from multiple projects, including\nin which he was set to star in and executive produce. He was also cut from a Texas Rangers MLB ad campaign and is no longer in consideration to star in a Otis Redding biopic.\nreports more alleged victims have come forward and are cooperating with the Manhattan D.A.'s office. Majors's lawyer disputes that in a statement to the\n.\n\"This story is baseless and without any foundation,\" Chaudhry declares. \"Jonathan Majors is innocent and has not abused anyone. Mr. Majors is currently considering his legal options.\"\nChaudhry adds to Yahoo: \"Jonathan Majors is innocent and has not abused anyone. We have provided irrefutable evidence to the district attorney that the charges are false. We are confident that he will be fully exonerated.\"\nYahoo Entertainment\ndocuments containing the evidence submitted by Majors's defense team.\nIn video footage, the alleged victim is shown clubbing after the purported attack where she appears uninjured using her right hand and the finger Majors is accused of breaking. \"She danced her way to the DJ booth, passed a note to the DJ, danced wildly (even hanging off the DJ booth with her right hand), drank her champagne, and smoked a vape — clearly having a great time,\" Chaudhry writes in a letter to the court, noting they have multiple witnesses who will testify he never hit the woman.\n\"As witnessed by the driver, who saw and heard everything, just before 1 a.m., [the woman] assaulted Mr. Majors in a car while she was attempting to steal his phone. The driver will testify that Mr. Majors never struck [her] in any way at any time... The driver will testify that he unlocked the door to help Mr. Majors escape,\" Chaudhry writes. \"[The woman] then attacked Mr. Majors on the street as he tried to run away from her. In doing so, and in trying to prevent him from escaping, she ripped his coat buttons and tore his coat pocket; but he got away.\"\nMajors supposedly checked into a hotel while the woman went out. After 3 a.m., she went back to his apartment and security video footage from the building seemingly shows her unharmed at the time. The actor returned the next morning as he was supposedly worried about the woman's suicidal threats.\nUpon arrival, Majors found vomit on his bed and the alleged victim \"unconscious\" in his walk-in closet. In body-cam footage submitted to the court, the woman apparently told paramedics that she took \"a few\" sleeping pills. Majors's attorneys say she likely fell in the closet and sustained injuries when she passed out.\nMajors's alleged victim is\na temporary order of protection with the consent of defense counsel."},
{"url": "http://news.yahoo.com//payments-for-parents-172216255.html", "title": "Should parents be paid? Here's why people say it's time to see the value in caregiving.", "date": "2023-05-09T17:22:16.000Z", "content": "Parents, every day, assume the role of nurse, chauffeur, personal shopper, housekeeper, chef and more. With those roles in mind, in fact, data from job search database\ncalculated that for all the jobs parents do, their annual salaries should be roughly $185,060. Instead, a parent's labor is generally not considered real work, but a duty — one that doesn’t come with a salary.\nIt's why many people are working to shift our culture in order to get parents paid for their very real work.\nThe radical idea of wages for housework was first proposed by a woman named Selma James — in 1972, at the third National Women's Liberation Conference in Manchester, England. James went on to build the international, multiracial network that now coordinates the\n, campaigning for a \"care income\" for all caregivers. It’s an issue that women, disproportionately the world’s caregivers, are at the center of.\nWhen people are forced out of the workforce in order to raise their children, says James, they are economically disadvantaged and tied to others — like a partner — in order to survive, which, even in healthy partnerships, is a deprivation of economic freedom.\n“When women have money of their own, they are more autonomous and can make more decisions, and I think better ones,” James tells Yahoo Life. “If you get remuneration in some form because of the work you are doing, you transform not only the nature of that work, but also the social value that is placed on it… That's what money does. It not only enriches you, but it enriches the value of what you are doing.”\nIn discussing what such a \"care income\" might include, James explains, it's important to know what the people of a community value — land as opposed to cash, for example. But while it’s always a good strategy to fight for \"what’s on offer,\" such\n, she says, what's most crucial is pushing for benefits of cash, as opposed to social services.\n“Cash has value,” says James (slated to give a keynote speech at the upcoming\nin Philadelphia). “I wish it didn’t, but it does, and if cash does have value, I want it — and I want everyone who is doing the same work as me, or similar work to build up society and nature … to have it, too.”\nThis was the tenor of a 2021 Global Women’s Strike\nto President Biden and vice president Kamala Harris, urging them to provide Child Tax Credits for mothers and other primary caregivers.\nReshma Saujani, founder and CEO of\n, a national non-profit advocating for public and private sector changes to advance women's economic freedom, also stresses the importance of getting money into the hands of parents. Like James, she points out that we “don’t value what we don’t pay for,” and “so as long as caregiving and household work is uncompensated, it’s basically invisible: It goes unnoticed, unappreciated and, worst of all, unsupported.”\nWhen she first established Moms First (then known as the Marshall Plan for Moms) in 2021, Saujani, too, called for direct payments to mothers, who were “forced out of paid employment to essentially function as America’s social safety net, for free.\"\nAt the time, she says, \"people would say ‘oh, but motherhood is a blessing!’ That’s true, and I know that better than anyone as a mother of two little boys I fought like hell to have. But motherhood is also a job, and the work that goes into it is real and deserving of not just admiration but compensation.\"\nIn the United States, Saujani notes, until the government steps up for these payments — by providing basic income or expanding the Child Tax Credit, for example — it’s vital that employers step up.\n“Until the government acts, the number one thing employers can do to help parents is support them with child care,” she says. “Whether it’s in the form of flexibility, back-up care, on-site care, tuition stipends, there is no one-size fits all, but every company has got to be doing something. Moms First launched the\n, which is a first-of-its-kind coalition of companies from across industries who are leading on this issue. Together we are going to demonstrate that child care is a business imperative, not a personal problem, and expand the number of American workers with access to child care benefits.”\nThese economic conversations are even making their way onto social media. TikToker Autumn Lucy of Michigan, for example, typically shares shopping hauls, taste testing and recipe videos with her more than 425,000 followers. In\n, however, she took time to share her belief in why stay-at -home parents should be compensated for the work they do inside the home.\n“I think that at the very least, stay-at-home parents should earn the equivalent of working full-time on minimum wage,” she tells Yahoo Life about what inspired her to make the video. “In Michigan, this would be about $1,600 a month. However, I think to really make this work you should offer all parents either a monthly [stay-at-home parent] stipend or a voucher for free daycare. This would allow parents to have more freedom to make the decision that will work best for their family without sacrificing their career, if they would like to continue working.”\nAs a mom to a six-month-old, Lucy adds, “Often when I discuss this, the argument I hear against it is that ‘You shouldn't be paid to raise your own children.’ To characterize this compensation as being paid to raise your child heavily implies that parents that work outside of the home are not raising their children. Whether working outside the home or inside the home, we are all raising our children. However, only the parents working outside of the home are being compensated for the time spent working.”"},
{"url": "http://news.yahoo.com//apple-watch-series-9-may-finally-get-a-new-processor-151516259.html", "title": "Apple Watch Series 9 may finally get a new processor", "date": "2023-05-09T15:15:16.000Z", "content": "The Apple Watch has effectively used the same processor since the S6 inside 2020's Series 6, but it's apparently poised for a long-due upgrade.\n's Mark Gurman tells subscribers in his\nthat Apple Watch Series 9 will reportedly use a truly \"new processor.\" He believes the CPU in the S9 system-on-chip will be based on the A15 chip that first appeared in the iPhone 13 family.\nApple has upgraded the SoC hardware in Watch models following Series 6, but the revisions have added functionality rather than CPU improvements. The S8 chip in\n,\nand\nwatches includes an updated accelerometer and gyroscope, for instance. Apart from that, it's largely identical to the S6.\nWhile most details remain a mystery, there are some likely improvements. The S8 is still built using an old 7-nanometer manufacturing process, while an S9 is more likely to be made on a denser and more efficient 5nm or 4nm process. That could not only boost performance, but extend battery life. Apple has historically introduced new Apple Watches in September.\nApple Watch Series 9 is otherwise believed to be an iterative update. Gurman previously suggested there will be no major design or feature changes. You may get the Bluetooth 5.3 support that came with the Ultra, but there might not be much incentive to upgrade if you already have a Series 7 or newer. For owners of older models, however, a speedier processor may help justify an upgrade on top of all the refinements from recent years."},
{"url": "http://news.yahoo.com//finance/news/white-house-debt-ceiling-talks-kick-off-biden-mccarthy-203605747.html", "title": "‘We’re going to get started’: White House debt ceiling talks finally kick off", "date": "2023-05-09T20:36:47.000Z", "content": "Formal debt ceiling talks finally kicked off Tuesday between President Joe Biden and House Speaker Kevin McCarthy.\n“We’re going to get started, we're going to solve all the world’s problems,” Biden wryly told reporters in very brief remarks as he and McCarthy and other leaders began their meeting.\nMcCarthy sat on a couch to Biden’s right and, like the President and other leaders in attendance, didn’t respond to shouted questions before reporters were ushered out of the room, according to a pool report.\nThe highly-anticipated Oval Office gathering came more than 3 months after the two leaders last sat down to discuss fiscal issues and just days after Treasury Secretary Janet Yellen announced that a US\n.\nAlso in attendance Tuesday were House Democratic Leader Hakeem Jeffries (D-NY), Senate Majority Leader Chuck Schumer (D-NY), and Senate Minority Leader Mitch McConnell (R-KY).\nThe positioning was intense in the hours leading up to the meeting. Speaker McCarthy told reporters on Capitol Hill earlier Tuesday that he opposes the idea of a short term extension through Sept. 30 and that\n“I don't think it's that difficult.”\nThe Speaker also\nthat the meeting represents “a new opportunity for Democrats to find common ground and act responsibly for future generations.”\nOn the other side, White House Press Secretary Karine Jean Pierre seemed to agree on at least one point, saying “a short term extension is not our plan either.” Those comments appeared to take one of the last backup plans off the table as both sides are now publicly committed to executing a complicated deal in just a few short weeks.\nWhat observers will\nin the hours and days ahead are any signs that Republicans and Democrats are moving away from what are currently irreconcilable positions.\nThe meeting also comes\nthat the standoff will at a minimum put downward pressure on stocks through the rest of the month as Washington again flirts with a default.\nOn Tuesday,\nas investors waited for developments from Washington about whether the talks would lessen the likelihood of a default within weeks.\nBusiness groups have also been weighing in ahead of the meeting with Neil Bradley of the U.S. Chamber of Commerce\nand adding that the twin issues of spending caps and energy permitting reform are “two areas that are ripe for inclusion.”\nBusiness Roundtable CEO Joshua Bolten\nwith a warning that a default “would deliver a severe blow to the economy, leading to widespread job losses, decimated retirement savings and higher borrowing costs for families, businesses and the government.”\nThe White House has\n, with Yellen calling it a recipe for “economic calamity.”\nDuring\n, political strategist Steve Schmidt warned Wall Street observers that the outcome here will be very hard to predict. “There is no rationality in this and that's what's broken about American politics,” he said.\nFew expect Tuesday’s gathering to immediately yield tangible results.\nPresident Biden has already signaled that he intends to use the presidential bully pulpit with a trip planned for Wednesday to New York's Hudson River Valley. There he will give a speech on the debt limit in the district of Rep. Mike Lawler (R-NY), a vulnerable Republican under pressure to break from his party.\nOne intriguing development Tuesday was when\nduring the Wednesday stop. He said the White House had invited him to join and he accepted “maybe to their surprise.”\nAnother wrinkle sure to occupy the weeks ahead is an overseas trip Biden has planned for later this month that will take him to Japan, Australia, and Papua New Guinea with the President scheduled to return just days before default is on the table on June 1.\nOn Tuesday, Jean-Pierre declined to comment about whether the White House is considering shortening the trip given the debt ceiling crisis, instead repeating that the President’s focus at Tuesday’s meeting would be trying to get Congress to act and pass a clean debt ceiling increase.\n“That’s going to be the president’s focus today,” she said."},
{"url": "http://news.yahoo.com//finance/news/google-io-2023-what-to-expect-during-googles-huge-developer-event-180510466.html", "title": "Google I/O 2023: What to expect during Google’s huge developer event", "date": "2023-05-09T18:05:10.000Z", "content": "Google (\n,\n) will host its annual I/O developers conference at the Shoreline Amphitheater in Mountain View, CA, on Wednesday. And you can bet CEO Sundar Pichai will have plenty to say about Big Tech’s latest obsession: generative AI.\nGoogle is an AI juggernaut for sure. But the company’s recent stumbles, namely its botched unveiling of its Bard chatbot and slow rollout of generative AI capabilities across its various products, have the tech giant playing catchup to arch rival Microsoft (\n) and\n.\nAnd the push to change that should kick off in earnest at I/O.\n“What I would anticipate from Google I/O is a very strong generative AI-forward message where Google re-seizes the mantle for AI leadership…and you will likely see announcements specifically focused on that,” Gartner Analyst Chirag Dekate told Yahoo Finance.\nGoogle has already made its own generative AI product announcements to combat Microsoft’s Bing.\nis available to select trusted users, and the company is rolling out waitlist invites to people who want to get access to generative AI features in its\n.\nYou should expect to hear plenty of other announcements tied to both of those products.\n“I would not be surprised if Google announced that it's expanding those features to Google Sheets or to Google Slides, or to make them more generally available to the masses not trusted trusted testers,” Forrester Analyst Nikhil Lai told Yahoo Finance.\n“Google, I think, bungled its launch of Bard. The stock tumbled when they fumbled that launch and the inaccuracy of Bard has been problematic,” Lai said. “When when users sign into Bard it talks about the limitations...so I think we'll see some enhancements there.”\nIt’s not just about Bard and Workspace, though. Google will likely announce new generative AI features across its product lines including its all-important search engine.\n, Google is developing a new feature for its search engine that will allow users to interact with an AI bot. The initiative, codenamed Magi, would also include more visual responses and posts from social media sites.\nGoogle’s search business powers the company’s massive advertising division, which generates the bulk of its $283 billion in revenue in 2022. Any changes to its search product are a risky endeavor, but with Microsoft’s Bing already bringing AI chatbots to search, Google has to respond.\n“The good news is I think the market is headed where Google has been traditionally quite strong,” Dekate explained. “Google has always been, ever since its inception…an AI-centric company. The only problem is that Google has not spoken a lot about what they've been doing in generative AI for the longest time.”\nThat should change at I/O, though, as the company looks to put its generative AI chops on full display.\nBut Google isn’t just expected to roll out AI apps and services. The company will also show off its Pixel Fold smartphone. We already got a look at the foldable handset thanks to a teaser Google posted of the phone last week.\nLike Samsung’s Galaxy Z Fold 5, the Pixel Fold features a cover display and a foldable internal display that opens up into a larger tablet-style screen. There appears to be a three camera setup on the back of the phone, suggesting it’ll sport telephoto, ultra-wide angle, and wide angle lenses. According to CNBC, the Pixel Fold will cost upwards of $1,700.\nGoogle is also expected to debut a new entry-level smartphone called the Pixel 7A.\n, the phone, which is a low-cost version of last year’s Pixel 7, will get many of its stablemate’s features and cost $499.\nThere’s also reportedly a Pixel Tablet in the works. And you can likely expect to get a glimpse at Google’s upcoming Android 14 and maybe even its next-generation smartphone, the Pixel 8.\nBe sure to check back in at Yahoo Finance for all of the news out of Google I/O when it kicks off Wednesday, May 10.\nRelated Quotes"},
{"url": "http://news.yahoo.com//finance/news/disney-selling-hulu-would-be-a-grave-mistake-says-analyst-185039093.html", "title": "Disney selling Hulu 'would be a grave mistake,' says analyst", "date": "2023-05-09T18:50:39.000Z", "content": "Disney (\n) selling its majority stake in Hulu might not be the best idea, at least according to one media analyst.\n\"I think [selling Hulu] would be a grave mistake,\" Jason Bazinet, managing director at Citi, told Yahoo Finance Live on Monday. \"We would like to see Disney buy in the balance of Hulu it doesn't own, merge that with Disney+, rationalize some costs, and really create what I'll call a TV substitute in the streaming world.\"\nDisney currently owns two-thirds of the streamer with Comcast’s Universal (\n) controlling the rest.\nUnder the terms of the joint ownership agreement, Comcast\nDisney to buy out its stake in Hulu as early as January 2024 at a guaranteed minimum equity value of $27.5 billion (or about $9.2 billion for the 33% stake.)\nHulu boasts around 48 million subscribers and hosts top-rated shows including \"Only Murders in the Building,\" \"The Handmaids Tale,\" and \"The Dropout.\" Hulu's subscribers grew 2% in Disney's latest quarter.\nDuring Disney's\nin February, Iger doubled-down on the view streaming was his \"top priority\" for the company, but he told\n\"everything was on the table\" in regards to Hulu’s future.\n\"I’ve talked about general entertainment being undifferentiated. I'm not going to speculate if we're a buyer or a seller of it,\" Iger said. \"But I'm concerned about undifferentiated general entertainment. We're going to look at it very objectively.\"\nBazinet said he was \"flabbergasted\" by Iger's comments, but admitted he's in the minority among fellow analysts and investors.\n\"Every investor I chat with would be thrilled if Disney sold Hulu,\" the analyst said, adding \"the Street would applaud\" further commentary surrounding a potential sale.\nAt the time of the original Hulu arrangement between Comcast and Disney, Iger maintained the purchase would allow Disney the opportunity to offer an alternative, more mature viewing experience to consumers, in addition to providing\nFlash forward to today, and investors are far more focused on the profitability of streaming, as well as whether a service can draw enough of an audience amid increased competition.\nDisney's direct-to-consumer division reported a $1.1 billion loss in its fiscal first quarter — an improvement compared to the $1.5 billion loss seen in Q4, but still a significant drag on profits.\nIger,\n, has remained hyper-focused on profitability as investors shift focus away from subscriber growth and put more emphasis on margins.\nThe executive has worked hard to establish new revenue streams like\n, in addition to\nto help pare losses and lift metrics like average revenue per user, or ARPU. He reaffirmed the company's outlook of reaching streaming profitability by 2024.\nDisney will report earnings after the bell on Wednesday. The company is currently in the middle of\nin an effort to slash $5.5 billion in costs. It will eliminate 7,000 jobs by the summer.\nShares are currently up about 15% year-to-date, outpacing the S&P 500's 8% gain.\nRelated Quotes"},
{"url": "http://news.yahoo.com//finance/news/stock-market-news-today-live-updates-may-9-113522306.html", "title": "Stocks fall as focus turns to debt ceiling and inflation data: Stock market news today", "date": "2023-05-09T20:03:28.000Z", "content": "U.S. stocks closed lower Tuesday as investors watched for developments from a meeting between President Biden and House Speaker Kevin McCarthy over the debt ceiling and awaited key inflation data.\nThe S&P 500 (\n) slipped 0.64%, while the Dow Jones Industrial Average (\n) dipped 0.74% or more than 50 points. The technology-heavy Nasdaq Composite (\n) fell 0.63%.\nMeanwhile, PacWest Bancorp (\n) shares gained more than 2%, reversing losses from earlier in the session as regional banking volatility continues. On the commodities front, oil prices rose to $73.54 a barrel.\nThe clock is ticking for a divided U.S. Congress to raise the federal government's debt ceiling, which currently stands at over $31 trillion but risks running out of cash as soon as June 1. Razor-thin margins in Congress are complicating the matter. President Joe Biden was expected to meet with congressional leaders on Tuesday.\nAs the U.S. gets closer to the brink of a default, nearly half of US banks are\n. If companies struggle to access loans, they might cut back on investment, slowing economic growth. Tighter credit conditions may \"act as a de-facto Fed hike,\" as JPMorgan analysts wrote Tuesday.\nWall Street is also looking ahead to Wednesday's April inflation report for clues on whether the Federal Reserve will continue to hike interest rates at its June meeting. Headline inflation is forecast to increase 5% from a year ago. On a \"core\" basis, which strips out the more volatile costs of food and gas, prices in April are expected to have risen 0.4% over the prior month and 5.5% over last year, according to Bloomberg data.\nNew York Federal Reserve President John Williams cautioned on Tuesday that inflation\ndue to a strong job market.\nSeparately, economic data showed that confidence among small-business owners fell in April to the lowest level since 2013, signaling a pullback in business investment.\nTreasury yields were higher. The yield on the 10-year note traded up to 3.53%, while the two-year note yield gained to 4.03%.The dollar index gained, while gold edged upward.\nOn the earnings front, Wall Street anticipates results from Airbnb, Inc. (\n), Rivian Automotive, Inc. (\n), and Warren Buffett’s favorite Occidental Petroleum (\n), which are all set to report later today after the bell.\nIn single-stock moves, shares of Palantir Technologies Inc. (\n) jumped over 23% Tuesday after its first-quarter results topped expectations. The company said it expects to be profitable through the end of the year.\nPayPal Holdings, Inc. (\n) shares sank more than 12% on Tuesday after the company\nfor annual adjusted operating margin.\nBoeing Company (\n) shares rose after the news of\nand deliveries. Shares of Novavax Inc.(\n) rallied 27% after the vaccine maker announced restructuring plans that include cutting about 25% of its global workforce.\nShares of Lucid Group, Inc. (\n) fell after the EV maker reported lower-than-expected first-quarter revenue on Monday and trimmed its 2023 production forecasts.\nTyson Foods, Inc. (\n) shares fell following the 16% slump on Monday when the company cut its sales forecast on declining demand for pork and beef and said its costs are rising.\n—\nRelated Quotes"},
{"url": "http://news.yahoo.com//finance/news/rivian-earnings-154452559.html", "title": "Rivian earnings: EV maker reports narrower Q1 loss and revenue beat; reaffirms production forecast", "date": "2023-05-09T20:23:20.000Z", "content": "Rivian (\n) reported a narrower loss than expected and revenue beat for Q1, giving EV investors hope after disappointing results from rivals Lucid and Fisker.\nFor the quarter, Rivian reported top-line revenue of $661 million versus estimates of $660.3 million, slightly less than the $663 million reported in Q4, but over 6 times the $95 million reported in Q1 last year. In terms of profit, the company reported an adjusted EPS loss of $1.25, beating estimates of a loss $1.56.\nThe company also reiterated its 50,000 unit annual production guidance it provided during its fourth quarter earnings report. Rivian produced slightly less than 25,000 vehicles in 2021, as it suffered from component shortages and production issues at its sole plant, in Normal, Illinois.\nIn terms of outlook, the company still sees an adjusted EBITDA loss for the year of $4.3 billion, which is a narrowing of the $5.2 billion EBITDA loss it had in 2022. Rivian reports it has $11.24 billion in cash and cash equivalents at the end of the quarter, down from the $12 billion it had at the end of Q4. But Rivian said it expected to achieve positive gross profit in 2024.\nLast month Rivian\n, topping street estimates of 7,752 according to Bloomberg. Rivian also produced 9,395 vehicles, beating estimates of 8,752 vehicles.\nEarlier in March, following the issuing of its production guidance, a report suggested Rivian had told employees internally that it could make as many as 62,000 vehicles this year, though a Rivian spokesperson told Yahoo Finance that figure was “taken out of context” and 50,000 remained the official guidance.\nWall Street had been on edge ahead of Rivian’s earnings. Long-time bull Alexander Potter of Piper Sandler, for instance, went bearish only a few weeks back in mid-April. Potter downgraded the stock to Neutral and slashed his price target to $15 from $63, writing that there is concern over a cash crunch. Potter predicted the company will have to raise $4 billion in at some point, with investors having to foot the bill with new stock or debt issuance.\nPotter still believes in Rivian’s long-term strategy of vertically integrated production, but he sees the benefits coming years from now. The question: Can Rivian, and its investors, wait that long?\n—\nRelated Quotes"},
{"url": "http://news.yahoo.com//finance/news/novavax-ceo-one-thing-we-did-was-change-the-relationship-with-the-fda-180100206.html", "title": "Novavax CEO: 'One thing we did was change the relationship with the FDA'", "date": "2023-05-09T18:01:00.000Z", "content": "Novavax (\n) may have struggled to get its COVID-19 vaccine to market in time during the pandemic, but the company's new CEO is optimistic about the protein-based platform and products sitting in the pipeline.\nKey to moving those forward in the near future is a mended relationship with the U.S. Food and Drug Administration (FDA), according to CEO John Jacobs.\n\"The company had a miss last year. They still had the old Wuhan (strain) vaccine. They were trying to convince the FDA that they were wrong and didn't need the bivalent. Those were well-intended, but didn't pan out to be wise in hindsight, and it hurt the company,\" Jacobs, who took the helm of the company in January, told Yahoo Finance Tuesday.\n\"One thing we did was change the relationship with the FDA,\" he added.\nThat includes a call a week before he started in the new role, initiated by the FDA, Jacobs said.\nThe two sides have been in communication weekly, and the regulatory agency has been helpful in answering concerns about the new COVID vaccine strain — set to be determined next month — and guidance on the company's flu and combination vaccines currently in clinical trials.\nIn its\n, the company reported revenues of $81 million from its COVID vaccine, compared to $704 million in the first quarter of last year. But the company expects $800 million in 2023 for advance purchase orders and total revenues of $1.4 billion- $1.6 billion for the year.\nThe company's stock was up on the news Tuesday. It also announced it would reduce its workforce by 25% as part of a\nJacobs said he underwent a 12-week process to restructure the company, and is on track to stabilize the company by end of year.\n\"There were no sacred cows, so to speak. We looked at every department. You have to find that balance of not hurting the capabilities, because you can't cut your way to success, while cutting enough that you can help take that right step towards stabilization,\" Jacobs said.\nThough the COVID-19 pandemic is over, Novavax's is still dedicated to getting it's COVID vaccine out in time for fall shots, according to R&D president Dr. Filip Dubovsky.\n\"Our focus is really getting the current vaccine out. This is our number priority. That's where all our resources are going,\" Dubovsky told Yahoo Finance.\nBut outside of that, the company is focused on Phase 2 results for its flu vaccine candidate, which still need to be analyzed, and a combination flu/Covid vaccine.\nDubovsky said that because of the attention to the COVID vaccine, other candidates were somewhat sidelined. That means it will take time before the company has a new product on the market.\n\"We didn't budget for the clinical work for any of these pipeline products. So to move them forward, it's going to have to be strategic partnerships,\" Dubovsky said.\nWhich is also why the repaired relationship with the FDA is important.\n\"We'd want to get assurances from the regulatory agencies that we had the right approach, design. And if we do it with partnerships, you can imagine that the partner would want to be involved in the design and timing of the future work to be done,\" Dubovsky said.\nHe added that all that culminates to a path forward, but no clarity on a potential filing date for the newer products.\nRelated Quotes"},
{"url": "http://news.yahoo.com//finance/news/nikola-customers-prefer-hydrogen-fuel-cell-trucks-and-we-have-first-mover-advantage-211053810.html", "title": "Nikola: Customers prefer hydrogen fuel cell trucks and we have 'first-mover' advantage", "date": "2023-05-09T21:10:53.000Z", "content": "Electric and hydrogen fuel-cell powered truck maker Nikola (\n) is hoping a re-focusing will be good for business.\nThe company announced it is\nit has with trucking giant Iveco Group, in exchange for $35 million cash and the return of 20.6 million shares of Nikola common stock held by Iveco. Iveco will continue to remain an “important partner and key supplier” for Nikola, and is expected to remain a meaningful stockholder moving forward.\n\"We are very focused on North America and the fuel cell truck, and we [will] also build up the hydrogen infrastructure - at the same time, we have taken important decisions,\" Nikola CEO Michael Lohscheller said in an interview with Yahoo Finance. \"We have actually sold our European business to Iveco because it's in very good hands there.\"\nIveco will now build its European EV and fuel-cell trucking business on its own, with Nikola focusing on the North American market and its hydrogen fuel cell trucks, HYLA hydrogen ecosystem, and autonomous technologies, and software. Lohscheller said Iveco remains a long term partner for Nikola, as it will supply cabins and e-axles for Nikola's fuel-cell trucks.\nNikola also\n, with top-line revenue coming in at $11.1 million, on an adjusted EBITDA loss of $169 million. The company reported an adjusted EPS loss of $0.26 a share.\nNikola said during the first quarter it produced 63 Tre battery electric trucks and delivered 31 to dealers. Nikola reported an uptick in retail sales with 33 in the quarter, and because it has sufficient inventory of the truck, it will temporarily pause production at its Coolidge, Arizona, plant in order to modify the assembly line to accommodate both hydrogen fuel cell and battery electric assembly on the same line. Nikola says as it resumes production in Coolidge, the battery electric Tre will become a “build-to-order” product.\nAs for the hydrogen fuel-cell powered trucks, Nikola said orders for 140 hydrogen fuel cell trucks have been received from 12 customers, and they are on track to begin hydrogen fuel cell production in July.\nLohscheller believes the future of Nikola belongs with its hydrogen fuel-cell trucks and that the company has an advantage there.\n\"We gave guidance this morning between 375 and 500 trucks for the total year, but we lean more towards the fuel cell truck because we get feedback from customers that they prefer the better range, the lower fuel time, and also the weight,\" Lohscheller said. \"We also at Nikola [have] a first-mover advantage — there is nobody else out there.\"\nNikola also announced it completed the first two of 10 “gamma,” or preproduction, hydrogen fuel cell trucks, with the remaining eight trucks scheduled for completion by the end of June. Nikola says the Gamma trucks will be used for customer pilots and to finalize vehicle validation, with test fleet operators including Biagi Bros, Walmart, Linde, and AJR Trucking.\n—\nRelated Quotes"},
{"url": "http://news.yahoo.com//us-authorities-seize-more-domains-151137537.html", "title": "US authorities seize more domains linked to prolific DDoS-for-hire websites", "date": "2023-05-09T15:11:37.000Z", "content": "U.S. authorities have seized 13 more domains linked to some of the world’s most popular DDoS-for-hire websites.\nThese websites, also described as “booter” or “stressor” services, are marketed as legitimate security testing tools that allow admins to stress-test websites. In reality, the services are used for launching denial-of-service (\n) attacks designed to overwhelm websites and networks and force them offline.\nThe DOJ\non Monday that the FBI had seized 13 more domains linked to some of the most prolific booter services as part of Operation PowerOFF, an international law enforcement effort to disrupt online platforms that allow anyone to launch massive distributed DDoS attacks.\nHowever, the Justice Department said that 10 of the 13 domains seized by law enforcement this week were linked to previous domains seized in\n.\n“For example, one of the domains seized this week – cyberstress.org – appears to be the same service operated under the domain cyberstress.us, which was seized in December,” the DOJ said.\nTechCrunch visited the 13 websites seized by the FBI this week. While almost all of the websites targeted by the operation now display a message stating they have been seized by the FBI, TechCrunch found that — at the time of writing — at least one of the sites continues to operate as normal. It’s not clear why this site continues to load and the DOJ has yet to respond to TechCrunch’s questions.\nAs part of its investigation into the domains, which the DOJ says have “hundreds of thousands” of registered users and have been used to target school districts and government websites, the FBI opened or renewed accounts with each service and then tested them by launching DDoS attacks against government-controlled computers. It then observed the effect on these “victim” computers.\n“In some cases, despite the ‘victim’ computer being on a network with a large amount of capacity, the test attack was so powerful that it completely severed the internet connection,” the DOJ said.\nThe Justice Department also said in Monday’s announcement that four of the defendants charged in December -- Jeremiah Sam Evans Miller, Angel Manuel Colon Jr., Shamar Shattock and Cory Anthony Palmer -- pled guilty earlier this year. These defendants, who are scheduled to be sentenced this summer, have been linked to the operation of the now-defunct \"RoyalStresser.com,\" \"SecurityTeam.io,\" \"Astrostress.com,\" and \"Booter.sx\" DDoS-for-hire services.\nThe takedowns were carried out as part of a joint operation between the U.K.’s National Crime Agency, Dutch police and Europol. Earlier this year, the NCA\nit had infiltrated the online criminal marketplace by setting up a number of sites purporting to offer DDoS-for-hire services."},
{"url": "http://news.yahoo.com//finance/news/cpi-preview-inflation-expected-to-remain-elevated-in-april-as-rate-hike-risks-loom-144811803.html", "title": "CPI preview: Inflation expected to remain elevated in April as rate hike risks loom", "date": "2023-05-09T14:48:11.000Z", "content": "A closely-watched report on US inflation is expected to show that consumer prices remained elevated last month, consistent with the levels seen in March.\nApril's Consumer Price Index (CPI) is forecasted to rise 5% over the prior year,\nannual gain, according to estimates from Bloomberg.\nThe increase would still be significantly above the Federal Reserve's 2% target. The Fed has been raising interest rates to try to bring down inflation, but the central bank risks sending the economy into a recession by hiking rates too high too fast. Last week, the\nit could pause its hikes, saying it would assess incoming data ahead of its next meeting in June.\nOver the prior month, consumer prices are expected to have risen 0.4% in April, up from the 0.1% monthly increase seen in March.\nOn a \"core\" basis, which strips out the more volatile costs of food and gas, prices in April are expected to have risen 0.4% over the prior month and 5.5% over last year, according to Bloomberg data.\nHere's what to expect compare to March's numbers:\n+5.0% expected versus March's +5.0%\n+0.4% expected versus March's 0.1%\n+5.5% expected versus March's +5.6%\n+0.4% expected versus March's +0.4%\n\"As we have been saying for some time now, we expect that slowing economic activity will trigger a material deceleration in inflation, but the path back to 2% will be long and bumpy,\" Wells Fargo wrote in a note on Friday, adding elevated gas prices will likely push headline inflation higher on a month-over-month basis.\nUBS also anticipates a \"solid\" CPI print, which, coupled with strong average hourly earnings, adds to risks the Fed could\nin June. Still, the bank maintained its view that the May meeting's rate hike was the last increase of the hiking cycle.\n\"How the FOMC participants communicate that remains to be seen, particularly with the potential for divergent opinions on the Committee,\" UBS said in a note on Friday. \"Things could get noisy, and noisy could mean volatile.\"\nAhead of the release of Wednesday's inflation data, markets were pricing in an 83% chance the Federal Reserve keeps rates unchanged in June,\n.\nThe April CPI data comes after a\nlast Friday. The report contained revisions to jobs numbers for March and February, though, indicating a resilient but cooling labor market and giving investors hope the Fed would pause its hikes."},
{"url": "http://news.yahoo.com//deep-impact-armageddon-asteroids-earth-film-realistic-nasa-scientists-194157305.html", "title": "In 'Deep Impact,' 'Armageddon,' asteroids threaten Earth. Which film was more realistic? NASA scientists weigh in.", "date": "2023-05-09T19:41:57.000Z", "content": "In the summer of 1998, Hollywood offered up not one, but two blockbuster films about asteroids hurtling towards Earth.\nReleased on May 8 of that year,\n, directed by\n, told a story of humanity facing a cataclysmic threat from a deadly asteroid, prompting the U.S. government to build a network of underground shelters for just a select few.\n’s\narriving in theaters seven weeks later on June 30, saw\na ragtag team of oil drillers, led by\n, embark upon a dangerous mission to save the planet from an incoming, humanity-snuffing asteroid by blowing it up with a nuclear bomb buried in its center.\nNow,\n— and just eight months after\n, the first-ever NASA mission to successfully deflect an asteroid's trajectory in deep space — Yahoo Entertainment has been wondering: Was there any truth in this fiction?\nAs several NASA scientists tell us,\nof blowing up an asteroid by planting a nuclear bomb in its core is unrealistic. Their colleagues say that\n's portrayal of a massive tidal wave wiping out the East Coast is far-fetched.\nHere's what else some of the leading minds in asteroid science had to say.\n, an American astronomer who has worked with NASA on the Hubble telescope, says\nis by far the most “science-based” of the two.\nIn fact, he says, some scenes in the film aren’t far off from reality. There's one moment when scientists tether a spaceship to the threatening comet before planting nuclear bombs in its core, hoping the explosion diverts it from its collision course. Nuclear bombs aside, that method is strikingly similar to one used back in September 2016, when the\nbecame the first man-made structure to land on the surface of a comet to retrieve images and data.\n, a planetary scientist and assistant professor at the University of Michigan, agrees that\nis the more science-based film, but says, “It's not clear to me why burying a bomb in an asteroid would be a good strategy in the first place. This just wouldn’t happen.”\nPlait agreed that \"the biggest mistake in most asteroid movies\" is characters believing that it's a good idea to blow up an asteroid. \"In reality, the better thing is to make sure it never hits us,\" as was accomplished with the recent DART mission through the use of a kinetic impactor —\na spacecraft that worked like a big slingshot to redirect its course.\nBesides, \"blowing up asteroids is harder than most people think,\" notes\n, head of the\n.\nEven if one succeeded at using a nuclear bomb to blow up an asteroid, he says, the heat from the blast would vaporize material on the surface and expand violently, ultimately pushing on the rock and turning it from a very, very fast asteroid, or \"bullet,\" to a deadly \"shotgun blast.\"\nAnd then there was the late\n, an American geophysicist who specialized in impact cratering, who proposed a way to deflect asteroids without bombs.\n\"He argued we could fly to the asteroid and use a large optical surface to concentrate solar energy onto a small point on the asteroid,\" Bottke says. \"This would vaporize the rock instantaneously in a fashion not so different from using the sun and a magnifying glass to burn a piece of paper. By carefully choosing your spots, you could create a rock comet and slowly move the asteroid onto a different trajectory.\"\n, director of NASA's\n, agrees\nis the more believable of the two, even though \"both films had a lot of scientific flaws,\" he says.\n\"The more grounded these movies are in scientific realism, the better,\" he says. \"But I also understand the need to make these movies dramatic and entertaining.\"\nfamously\nhighlighted social inequities by building a network of underground shelters available only to the mega-rich, but Bottke says it’s likely a fool’s errand anyway.\n“For very large impacts, the ejected material from the blast can produce firestorms far from the event, and long-term global cooling from the small particles that stay entrained in the atmosphere,” he explains. It may also have an impact on agriculture, which depends on the sun, water and healthy soil for seeds to grow, which “could easily lead to worldwide famine.”\nUnderground shelters could maybe save humanity in theory, but it all depends on \"how big the comet is and where it hits,\" says Plait. \"If you know where the impact will be and put the shelter far away and heavily fortified, then... maybe?\"\nIf the comet were a so-called \"planet killer,\" like the plummeting\nthat wiped out dinosaurs, there will undoubtably be changes to the atmosphere that will last years, which impacts all animals on Earth.\n\"However, with some foresight, it might be possible to survive, subsurface, through that period,\" Jacobson notes. \"We know that many small animals did just that because humans are the evolved descendants of survivors of the Chicxulub impact.\"\nNo one should be losing sleep over it, say the experts. \"There are no large asteroids heading for Earth within our lifetimes,\" says Chodas. \"A large impact is exceedingly unlikely, and NASA and other institutions around the world are working to reduce the concern even more, as better asteroid search telescopes come online.\"\nThat includes the\n, set to launch in Sept. 2027, which aims to find at least two-thirds of the near-Earth objects larger than 460 feet, or \"the ones which could potentially cause regional devastation if any should impact Earth,\" he explains.\nNot to mention that a species-ending comet would become public very early on, which means transparency would be demanded from citizens on a global scale, giving us more than enough time to prepare — unlike in\n, when the world had roughly a year before impact, and in\nwhich had only 18 days.\nBut if we've learned anything from such Hollywood storylines, it’s that time is\nof the essence.\n“If we have decades [to prepare], which is most likely, scientists and policy makers from around the world will come up with an action plan,” notes Bottke. “The asteroid will become the most studied celestial object in history, and a plan will be developed to carefully nudge it onto a trajectory that misses Earth. If we have a few years, the only option would be to use nuclear weapons,\" attached to a kinetic impactor, \"for deflection.”\nOf course, this is all hypothetical, says Chodas. \"We have already found more than 95% of the asteroids capable of doing this. And they are not headed for Earth anytime soon.\"\nFinally, say the scientists: At the end of the day, if Hollywood can get people excited about science, it's a good thing, inaccurate or not.\n\"A lot of scientists today, including me, were inspired by shows like\n,\" says Plait, \"even though the science can be dodgy.\"\nStill, adds Bottke, accuracy goes a long way. And all it takes is \"a little bit of script work,\" something planetary scientists, who are \" giant nerds who love science fiction,\" would happily sign up for. \"The audience also responds positively,\" he adds, \"when they feel the filmmakers have tried to get things right.\""},
{"url": "http://news.yahoo.com//california-sends-final-reparations-report-to-state-lawmakers-as-national-bill-sits-in-limbo-203523148.html", "title": "California sends final reparations report to state lawmakers as national bill sits in limbo", "date": "2023-05-09T20:35:23.000Z", "content": "California’s Reparations Task Force approved\nlast weekend, recommending a public apology to Black Californians, dozens of policy reforms and monetary payments.\nThe\nwas created in 2020, following the death of George Floyd, to document the harm of slavery, propose restorative measures and educate the public.\n“America needs to know how enormous the harm is. That’s not been done before,” Donald Tamaki, a task force member and lawyer, told Yahoo News.\nTamaki is one of the panel’s nine members, five of whom were appointed by Gov. Gavin Newsom, and said the committee retained economists to calculate the harm, which in\nto roughly $1.2 million per person, according to a recent report by the New York Times.\n“The extent of the harm, it's terrible, it is enormous. It is astronomical,” Tamaki said.\nWhile the task force released an estimated amount for compensation, it did not recommend that the state pay a specific amount; instead, the monetary calculation provides guidance for the “enormous economic extent and impact,” Tamaki said. “I think people have sort of an idea that reparations [are] merely a check in the mail. Well, it does involve compensation. But it does involve all of the others fixing the systems and the culture that created this in the first place.”\nIn addition, the panel recommended dozens of proposals, including changes to providing equity in health care, education, policing, legal systems, and incarceration, as well as reforming historically redlined communities in the state.\nExperts stress that compensation is not enough. “It's so deep and pervasive, it has to be followed by institutional changes and changes in the culture,” Tamaki said, referring to the impact of slavery and racial discrimination.\nBut reparations remain an unpopular concept in the U.S., with more than 60% of Americans opposing repayment to descendants of enslaved people, according to a\n“For those who think the cost is too high, consider the ongoing price paid for these injustices by all people who call the U.S. home, also paid in the currency of shorter, sicker lives. It’s time to make a down payment on a healthier future,” Mary Travis Bassett, a public health professor at Harvard University, told Yahoo News.\nLast year, the task force submitted a\nwhich outlined “the harm of 246 years of slavery, 90 years of Jim Crow and racial terror and decades more of continuing discrimination — resulting in today’s outcomes — which are at once shocking but sadly, not surprising,” Tamaki said.\nThe Golden State has over 2 million Californians that identify as Black or African American, but some experts say reparations would be a complicated process at the state level.\nEven for California, the $1.2 million compensation amount does not fit into the current state budget. “$1.2 million per person times approximately 2 million eligible recipients comes to $2.4 trillion. The state's annual budget is approximately $300 billion,” economist William Darity Jr., professor of public policy at Duke University, told Yahoo News.\nInstead of relying on state budgets to provide reparations, Darity said it “must be a federal project.” Darity served as a pro bono consultant to the Department of Justice’s team that supported the task force and said the states ultimately can’t foot the bill.\n“Elimination of the nation's racial wealth gap is approximately $14 trillion and that's a minimum estimate. And only the federal government has the capacity to do that without dramatically raising tax burdens across the country,” Darity explained. “The total budgets for all the state and municipal governments in the United States come to less than $5 trillion.”\nBut on the federal level, members of Congress have struggled for decades to create a commission to study and develop\n, a bill proposed by the late Democratic Rep. John Conyers, in 1989.\nJust last year, national lawmakers demanded that Biden sign an executive order to set up the commission for HR 40, but there has been little to no progress.\n“HR 40 is 38 years on the books waiting for someone to say yes. Today, we ask with no apologies for an executive order to be in place,” U.S. Rep. Sheila Jackson Lee, D-Texas, said during a\n“I want for once an acceptance of the history of the journey that African Americans have taken to be an accepted reality in America.”\nEvanston is known as the first community to distribute reparations to Black residents. The Chicago suburb has given out roughly\n.\n“I am glad to see California is following in the footsteps of my hometown of Evanston, Illinois. But we must do more. It is past time for Congress to pass H.R. 40,”\nRep. Jan Schakowsky, whose district includes parts of Evanston and Chicago, told Yahoo News in a statement. “If we as an entire country do not acknowledge that these problems still exist, and if we do not take the necessary steps to address them, we will fail not only all Americans, but also our democracy,”\nWhile Tamaki agrees that the issue of reparations is national, he also acknowledges that progress is slow.\n“Congress has not shown the will even to study reparations, let alone do anything about it,” Tamaki said. “The [report], however, says that whatever California does should not be taken to be a substitute for what is the responsibility of the federal government.”\nYet some experts say individual states providing reparations could lead to an equity issue. “In the administration of reparations programs, when you rely upon individual states and municipalities to set up the programs, everybody's will be different,” Darity said. “In fact, there's going to be municipalities and states that don't do anything.”\nBut the task force’s proposals are not set in stone. Next, they are headed to the majority-Democratic state legislature and then eventually Newsom’s desk.\n“They can do whatever they want with that report. They could ignore it altogether,” Darity said. “They could increase the amount, they could decrease the amount or they could offer the same amount. I think there [are] a lot of people who have a sense of optimism about what the state assembly will do.”\n“If enacted, this plan would go a long way toward addressing long-standing racial inequities in the state. The effects of slavery are still being felt to this day. The wealth gap between Black and white Americans persists and systemic racism continues to seep into all aspects of our lives,” Schakowsky said.\nOn June 29, the Task Force will present its final report to the legislature.\n“We call upon the California legislature to consider, balance and make a long-standing commitment to implement these proposals now and in the years to come. The harm was centuries in the making, so the repair needs to be long in the implementation,” Tamaki said."},
{"url": "http://news.yahoo.com//how-democrats-are-handling-bidens-bad-poll-numbers-224553296.html", "title": "How Democrats are handling Biden’s bad poll numbers", "date": "2023-05-09T22:45:53.000Z", "content": "As far as public opinion goes, it doesn’t get much worse than the new\n, conducted between April 28 and May 3, which shows President Biden to be historically unpopular.\nIt isn’t exactly how the president wanted to start his reelection campaign, but his allies are shrugging off the bad numbers — and the bad press they have generated.\nHere are five ways to interpret the poll and what it means for 2024.\nThat is the most obvious takeaway.\n“This poll is just brutal for President Biden,”\n, the former Bill Clinton adviser who now hosts ABC’s “This Week” political talk show.\nThe survey found that Biden’s approval rating has fallen to a lackluster 36%, with 56% of respondents disapproving of his performance. And in hypothetical head-to-head matchups with the leading Republican presidential candidates — former President Donald Trump and Florida Gov. Ron DeSantis — Biden loses to both, although he performs slightly better against DeSantis.\n, there is only one recent president who has polled this poorly this late into his term, and it’s one that Biden does not aspire to emulate: Donald Trump.\nSometimes, a jarring poll like this one can provide a valuable warning to the White House. Either it is failing to solve the problems most Americans care about, or it is doing a poor job of telling Americans how it is solving their problems.\n“This poll, even if it proves an outlier, makes clear that Biden faces an uphill climb,” Jon Cowan, co-founder of centrist think tank Third Way, told Yahoo News.\nThough it’s far from a consensus view, Cowan believes that Biden does best when he shies from the lure of polarizing progressive policies and allows the contrast with an increasingly immoderate GOP to materialize on its own.\n“If he sticks to the center, he will be able to credibly turn this election into a choice between mainstream versus extreme, the key contrast to win the suburbs,” Cowan told Yahoo News.\nFiveThirtyEight, which rates pollsters for accuracy, gives the ABC News/Washington Post poll an “A” grade. But some of the president’s allies have faulted the survey for sampling what they say is a small and unrepresentative group of Americans.\n“Flawed poll. Sample adults not likely voters. Undecided too high. Sample too Republican,” wrote top Biden pollster Celinda Lake.\nChris Wilson, a pollster affiliated with a political group supporting DeSantis, a presumptive Republican candidate,\nthat the poll has what he called “serious problems.”\nIn the summer of 2011, a Washington Post poll found that 40% of Americans said they would not vote for President Obama again. Across the spectrum, there was a “[l]ack of enthusiasm about awarding Obama a second term,”\n.\nObama won, of course. Eight years later, as his former Vice President Joe Biden sought the Democratic presidential nomination,\n, too.\nFor the most part, Biden listens to a small group of trusted aides — such as former chief of staff Ron Klain and senior adviser Anita Dunn — who are rarely rattled by bad poll numbers. They also take a skeptical view of the news media, which they regard as always in search of a narrative.\n“Americans voted for Joe Biden’s America in 2020 and 2022,” Biden campaign spokesman Kevin Munoz told Yahoo News. “And regardless of what today’s Beltway insiders say, they will again in 2024.”\nTrump tends to be at his best when he is attacked. Biden, on the other hand, is at his best when he is underestimated. Time and again, he has delighted in surpassing the skepticism of columnists and pundits.\n“In some ways, he loves being the underdog and being able to prove people wrong at the end of the day,”\n.\nEvery bad poll, the thinking goes, lowers expectations. The president’s allies point to a similar dynamic ahead of the 2022 midterms, which many predicted would turn out to be a landslide Republican victory.\nInstead, the GOP narrowly won the House of Representatives, while Democrats maintained their hold on the Senate while also winning key gubernatorial races across the country.\nFor a president used to being dismissed as a has-been, it was another unlikely victory.\n“We’re going to defy the odds,” a Biden campaign staffer said. “We feel good.”"},
{"url": "http://news.yahoo.com//ukraine-says-offered-return-3-120808442.html", "title": "Ukraine says it offered to return 3,000 dead Russian soldiers for burial, but Russia refused because it wouldn't admit the death toll", "date": "2023-05-09T12:08:08.000Z", "content": "Ukraine says Russia turned down an offer to repatriate the remains of 3,000 soldiers early in the war.\nRussia refused to acknowledge more than a handful had died, per Ukraine's defense minister.\nOleksii Reznikov made the remarks in a new documentary about the war one year on.\nRussia turned down an offer to retrieve thousands of its dead soldiers during negotiations early in the war, according to Ukraine's defense minister.\n, Oleksii Reznikov said Russia's representatives rejected the offer because they wouldn't acknowledge the high mortality rate.\nReznikov was describing negotiations in\n, in early March 2022, when he met with a delegation including a Russian deputy defense minister, who he did not name.\nReflecting on what he called \"the cynicism of the Russians,\" Reznikov said that Ukraine had counted around 3,000 Russians killed, per translations provided by the filmmaker.\nHe said that he asked the Russian delegation: \"'What will we do with the bodies of your dead? Maybe we will give them to you so that their mothers can bury them following proper ceremonies.'\"\nHe offered to organize it with the help of the Red Cross, but the deputy defense minister said that Russia had only lost between 10 and 30 men, Reznikov said.\nReznokov said he then retorted: \"'You may not confirm it, but 3,000 of your bodies are rotting on our land. Then I will pour seeds on them, let them sprout like sunflowers.'\"\nThe idea of sunflowers — Ukraine's national flower — being fertilized by the bodies of Russian soldiers is a common symbol of resistance in Ukraine.\nAn edited clip of the documentary was translated and tweeted by Ukrainian-American campaigner Igor Sushko:\n—Igor Sushko (@igorsushko)\nSushko called the Russian reaction a \"classic Soviet response.\"\nTwo weeks later, Reznikov said he asked Red Cross president Peter Maurer — who had recently returned from Moscow — if he believed accurate death tolls were being reported higher up the chain of command in Russia.\nPer Reznikov, Maurer said: \"'The deputy minister knows for sure. It was written on his face.'\" But Maurer said officials were too scared to tell anyone above the defense minister, according to Reznikov's recollection.\nInsider could not independently confirm the numbers of Russian dead at that time.\nAround the time of the reported conversation with Maurer, tabloid Komsomolskaya Pravda\n. This was at a time when the Kremlin was only publicly acknowledging 498 dead.\nThat figure was quickly deleted, with the newspaper claiming it was hacked.\nAs of May 2023, the US\nhave been killed since it launched its full-scale invasion.\nThe Russian Ministry of Defense did not immediately respond to Insider's request for comment.\nRead the original article on"},
{"url": "http://news.yahoo.com//melania-fully-behind-trumps-2024-110023383.html", "title": "Melania fully behind Trump's 2024 campaign, says it would be a 'privilege' to serve as first lady again", "date": "2023-05-09T11:00:23.000Z", "content": "supports her husband’s re-election campaign, telling Fox News Digital that she looks forward to working alongside former President Trump in \"restoring hope for the future and leading America with love and strength\" during a second term in the White House.\ntold Fox News Digital that if she has \"the privilege\" to serve as first lady again in 2024, she would continue to prioritize initiatives focused on the well-being and development of\nto ensure they have the \"support and resources they need to reach their full potential.\"\n\"My husband achieved tremendous success in his first administration, and he can lead us toward greatness and prosperity once again,\" the former first lady told Fox News Digital.\nTrump announced his\nin November, and is currently leading the Republican field for the GOP presidential nomination.\n\"He has my support, and we look forward to restoring hope for the future and leading America with love and strength,\" she said.\nThe former first lady’s comments came after she hosted a private luncheon at Mar-a-Lago on May 6, marking the fifth anniversary of the creation of her \"Be Best\" initiative during her time in the White House, which focused on the well-being of America’s children, opioid abuse, and online safety.\nSince leaving Washington D.C., Mrs. Trump has extended the program, and founded \"Fostering the Future,\" a \"Be Best\" initiative aimed at granting computer science scholarships to children aging out of the foster care system, and giving them the academic foundation needed to secure technology-based jobs so that they can become independent and contributing members of society.\n\"Since leaving Washington D.C., my commitment to the foster community has grown stronger,\" Mrs. Trump told Fox News Digital, pointing to her work in securing scholarships for children in the foster care system with the help of her team, strategic partners and the public.\n\"At the present time, there are more than 400,000 children in the foster care system, and there is less than a 3% chance of former foster children completing their college education. In fact, many end up on the street, homeless,\" she said. \"My objective is to reduce the gap and increase access to higher education for those who leave the foster care system.\"\nSince the creation of \"Fostering the Future,\" Trump has awarded two individuals from the foster care community university-level scholarships to study technology.\n\"I have faith that an education-based foundation will provide these individuals with the skills needed to secure employment and achieve financial stability,\" she told Fox News Digital.\nBut the former first lady hopes to have the chance to bring a greater focus to the foster care community, and to America’s children.\nTrump told Fox News Digital that if her husband is elected in 2024, as first lady, she would \"prioritize the well-being and development of children as I have always done.\"\n\"My focus would continue to be creating a safe and nurturing space for children to learn, grow, and thrive,\" she said. \"If additional problems arise, I will take the time to study them and understand their root causes.\"\nShe added: \"My goal would be to ensure that every child has the support and resources they need to reach their full potential.\"\nThe luncheon at Mar-a-Lago, which came during National Foster Care month, served as an opportunity for Mrs. Trump to connect with those in the foster care system and learn what further support and resources they need to be successful, a spokesperson for the former first lady told Fox News Digital.\n\"Beyond the month of May, Mrs. Trump’s \"mission is to bring awareness and attention to the foster care system and help guarantee that no child is overlooked, defined by their circumstance or confined to their present reality.\"\nDuring her time as first lady, Trump hosted virtual roundtables on foster care and strengthening the child welfare system, and worked with members of Congress, specifically, the late Rep. Jackie Walorski, regarding legislation that secured funding for grants awarded to youth and young adults currently or formerly in foster care to help pay for college, career school or training. The bill ultimately was signed by then-President Trump in December 2020.\nSince leaving the White House, the former first lady also has created special edition Non-Fungible Tokens (NFTs). A portion of those proceeds went towards \"Fostering the Future\" to\nfor children in the foster care community.\nTwo scholarships have been awarded to students attending schools in Oklahoma and Tennessee.\nIn December, the former first lady also hosted a Christmas party for foster children at Trump International Gold Club for nearly 200 children and their caretakers to celebrate Christmas with Santa Claus, Mrs. Claus and where children decorated cookies and played games."},
{"url": "http://news.yahoo.com//sf-dems-reportedly-block-ex-232720719.html", "title": "SF Dems reportedly block ex-Obama staffer from forming club over the word 'family'", "date": "2023-05-08T23:27:20.000Z", "content": "[\n]\nreported the\n.\nrefused to charter our new\nclub at its last meeting. Despite being lifelong Democratic activists, we were accused of being DINOs and pro-segregation, & taking Republican money, among other wild and false allegations,\" Wang wrote in a Twitter post on Saturday.\nrefused to charter our new\nclub at its last meeting. Despite being lifelong Democratic activists, we were accused of being DINOs and pro-segregation, & taking Republican money, among other wild and false allegations.\n— Cyn Wang 王思惠🌈 (@cynyurita)\nParag Gupta, one of the founders of the club, told the DCCC during the session: 'We’re just starting out. We seek to be an inclusive club, and we seek to be representative of all demographics, genders, races and inclusive of all families. If someone considers themselves a family, we consider them a family.\"\n\"It’s that 'You can’t sit with us' mentality that makes me very uncomfortable with the state of San Francisco politics. It’s very: 'You’re not even allowed in.' It’s very Mean Girls,\"\nDCCC reportedly banned the club due to the inclusion of the word \"family\" in its name and Wang's support for a recall of a school board that some saw as being overly \"woke.\"\nThe word “family” is not a right-wing dog whistle. SF is the most childless major city in the US. Groups like ours want to help register Democrats, improve public schools, promote safe, clean streets, transit, parks, & more housing - so families feel they can thrive here.\n— Cyn Wang 王思惠🌈 (@cynyurita)\nAccording to Mahogany, there will be another charter vote set up soon.\n\"Those allegations could not be more false,\" she said. \"Fighting systemic racism is one reason I’m involved in local Democratic politics. To me, it lifted the veil on how narrow of a definition they have of what being a Democrat means.\"\nDespite the setback, Wang shared in a recent Twitter post that her group intends to continue trying to get chartered.\nWe will keep trying to get chartered b/c we are DEMOCRATS, despite not meeting their purity tests, and hope to be treated more fairly next time. Learn more about us and join our club at\n— Cyn Wang 王思惠🌈 (@cynyurita)"},
{"url": "http://news.yahoo.com//why-is-there-a-monument-to-a-nazi-collaborator-in-suburban-new-york-090011899.html", "title": "Why is there a monument to a Nazi collaborator in suburban New York?", "date": "2023-05-09T09:00:11.000Z", "content": "NANUET, N.Y. — On Tuesday, Russia celebrated Victory Day, the annual national holiday that marks the Soviet Union’s triumph over Nazi Germany in 1945. With the war in Ukraine now in its second year and Russia condemned by much of the world for its unprovoked invasion of a much smaller and less powerful neighbor, the moral and military triumph against Adolf Hitler\n.\nAnd then there is the lonely memorial to the renowned Soviet lieutenant general Andrey Vlasov, an obelisk at the edge of a graveyard in a monastery in Nanuet, New York. Vlasov was an actual Nazi collaborationist,\n.\nThe Vlasov monument is one of several remaining monuments to Nazis and Nazi collaborators in the United States. It stands, improbably, at the edge of\n— and is a tragically apt symbol for the Soviet excesses that produced modern Russia.\nThe faltering war effort has caused the Kremlin to lash out in blame, looking for fifth columnists responsible for the bungled invasion. Vlasov is once again a “hated figure” in the land he betrayed,\n, a development she says “reflects how Moscow’s political rhetoric and historical falsehoods have unraveled as its soldiers are driven back on the battlefield.”\nVlasov could have been one of the great Soviet generals of World War II, one of those whom Soviet youths would come to know by a single name: Zhukov, Chuikov, Rokossovsky.\nInstead, he was executed by hanging in Moscow on Aug. 1, 1946. It was an ignominious end to what had been a stellar career.\nThe son of peasant farmers, Vlasov first distinguished himself while fighting for the Bolsheviks during the Russian Civil War. Later, he was sent on a military mission to China, which allowed him to escape\nagainst the Red Army’s officer corps in 1937.\nVlasov returned to the Soviet Union in 1939, after Germany had invaded Poland and appeared poised for an attack on the USSR. When that attack finally took place in 1941, Vlasov fought in the failed effort to defend Kyiv from the Nazi advance, as well as the successful effort to keep Hitler from taking Moscow. He was subsequently dispatched to help break the Nazi siege of Leningrad but failed to do so and was captured in July of 1942.\nStalin’s inability to initially contain the advancing Nazi war machine convinced Vlasov that the Soviet system was rotten to the core. Taken by his captors to Germany, he began to conceive of a Russian army that would fight for the Third Reich in the name of a post-Bolshevik Russia.\nIn 1943, Vlasov published the\n, in which he declared that Bolshevism was “the enemy of the Russian people.” His aim was to recruit other Russians now in Germany—the Nazis had taken hundreds of thousands of Red Army soldiers prisoner in the first two years of the war— to unite against the Soviet Union.\nBut after the shattering victory at Stalingrad, the Red Army began to believe that victory was possible. Germany, which had boasted the world’s most formidable military at the start of the war, suddenly seemed vulnerable. Even if its weaponry was less sophisticated and its troops poorly prepared, the sheer size of Russia’s forces could overwhelm the enemy — a reality that holds 80 years later, as the war in Ukraine grinds on and the patience of Kyiv’s partners in the West begins to wear thin.\nVlasov’s life in Germany was far from lavish. “My underpants are completely worn out,” he complained at one point,\n. Apparently, the Germans had only given him one pair.\nVlasov wanted to from a Russian anti-Soviet force, but Hitler was reluctant, fearing latent sympathies with Moscow. But by late 1944, he had few other options. Vlasov finally prevailed on Heinrich Himmler,\n. Himmler in turn managed to convince the increasingly desperate Hitler.\nAnd so, in September 1944, the Russian Liberation Army was born.\nIts life would be short. Vlasov’s division fought only once for the Nazis, in February 1945, in a futile attempt to stop the Soviet push across the Oder River and into the heart of the Third Reich.\nAfter being beaten back by Soviet forces, the Russian Liberation Army retreated to Prague. In yet another reversal of loyalties, Vlasov hoped to help anti-Nazi forces and eventually surrender to the United States.\nHere, again, Vlasov was unlucky. He surrendered to the United States, but the Americans turned him over to the Soviets. Vlasov was taken to Moscow, where he was imprisoned and ultimately executed.\nRussian military leaders remain fond of such vivid reminders of what traitors face. Last year, a deserter of the Wagner Group militia\n, which the outfit’s leader Evgeny Prigozhin has taken to wielding as a symbol.\nThe Novo-Diveevo Convent sits in a grove of trees about a 45 minute drive north of New York City. Across the way is a shopping mall; the orange signage of a Lowe’s Home Improvement outlet is visible from the convent’s driveway. But within the compound, trees block out the surrounding noise, while the ever-present Orthodox iconography — the slanted cross, the Cyrillic lettering—evoke the birch forests outside of Moscow or Leningrad.\nThe Vlasov monument is about 20 feet tall and topped by a golden cross. An image of Vlasov — bespectacled, his face drawn — is embossed on one side. On another, a sword rises along the monument's length, pointing towards the gray winter sky.\n“In dedication to the participants of the liberation movement of the peoples of Russia falling in the fight for freedom, 1941-1945,” a dedication says.\nThe monument went up in the 1960s, likely erected by Russians who had fled to the United States during the Bolshevik revolution and had remained hostile to the Soviet Union, including after the war.\nA nun emerged from one of the convent’s several cottages to talk to Yahoo News.\n“We were pleased to put it up,” she said of the monument, speaking in deliberate, classical Russian. She defended Vlasov in general terms. “What happened yesterday — who knows? He did a lot, didn’t he?”\nShe is similarly ambivalent about the war in Ukraine, as are the parishioners of the church that sits on the monastery’s grounds. Some are against the war,\nays, but others still support Putin and see him as something of a victim.\n“Poor Putin,” the parishioners say.\nMonuments to Confederate generals, racist political leaders and other objectionable figures have been coming down across the United States in recent years. There still stand a surprising number of monuments to Nazi collaborators across the United States, many of them erected by Orthodox or Catholic parishes that have sometimes overlooked the Nazi collaboration of national heroes from countries like Poland and Lithuania.\nIn Ukraine,\n, who collaborated with the Germans during World War 2, appears to have been the basis of the Kremlin’s claims about the rise of Nazism there.\nMeanwhile, the U.S. essentially adopted some of Nazi Germany’s most prominent scientists, many of whom became celebrated pioneers in the American space program. Their wartime abuses were overlooked,\n.\nVlasov was more obscure and more complex. Few local Nanuet officials appear to know who he was, or that he is honored at Novo-Diveevo.\n“This is the first time I’m even being made aware of that and have not heard anyone in the county talking about it,” Rockland County commissioner Beth Cefalu told Yahoo News. She said that the Vlasov monument was wholly within the convent’s jurisdiction and seemed satisfied to leave the matters there.\nIn heavily Jewish towns like Munsie and Ramapo, antisemitism has been sharply on the rise — as it has been across the United States. To some, there are echoes of Weimar Germany in today’s political divisions and culture-war battles.\nVlasov’s own attitudes about Jews were difficult to divine. At the very least, it did not seem to occur to him that by fighting for the Third Reich, he was helping to prolong the Holocaust.\nToday, of course, the Soviet Union is a historical memory. But in many ways, the brutality and incompetence that Vlasov so passionately denounced continue to haunt the Kremlin."},
{"url": "http://news.yahoo.com//calling-chatgpt-bullshit-193618769.html", "title": "Calling ChatGPT on its 'bulls***'", "date": "2023-05-08T19:36:18.000Z", "content": "How much can we really trust artificial intelligence? It’s a huge question, given the startling growth of ChatGPT and other chatbots powered by the technology. Millions of people around the world are now using these tools to craft emails, write essays for school, make purchases and do basic research. At the same time, there are increasing reports that such chatbots are, to put it charitably,\n.\nSo I decided to conduct my own little experiment to test AI’s reliability when I flew down to Rio de Janeiro last week to interview Meredith Whittaker, the president of Signal, the encrypted messaging service, at the\n.\nThe sprawling conference was filled with tech executives touting AI’s potential to remake the world economy and solve humanity’s problems. But Whittaker was an outlier. A former Google researcher, she left the company four years ago warning that AI will be misused for “\n.” She’s since become one of AI’s most outspoken critics.\nTo prepare for the interview, I went on ChatGPT for the first time and asked a simple question: What should I ask Meredith Whittaker about AI?\nThe first few responses ChatGPT gave me were, under the circumstances, somewhat ridiculous. “What inspired you to work in the field of AI and how did you get started?” was the first suggested question. “In your opinion, what are the most promising applications of AI that we should be paying attention to right now?” was the second.\nNeither seemed to make any sense, considering Whittaker’s warnings about AI’s potential threat to the future of humanity. But ChatGPT did suggest one question that seemed helpful. “Signal recently published a report on the role of AI in content moderation,” ChatGPT informed me. “Can you tell us a bit more about the key findings from that report and what it means for the future of content moderation?”\nI tried Googling this report and couldn’t find it, leading me to conclude that ChatGPT knew something that Google’s search engines didn’t. So I put the question to Whittaker in front of an audience of thousands at Web Summit’s main Center Stage auditorium. Tell us about the findings of your report, I asked.\n“That’s a lie,” she told me.\n“What did your report say?” I asked.\n“There was no report,” she told me.\nAI frequently gets things like this wrong, Whittaker explained, leading her to conclude that tools like ChatGPT are really a “bullshit engine.”\n“It takes a huge amount of surveillance data that is scraped from the darkest holes of the internet — it’s Reddit, it’s Wikipedia, it’s message board comments that are probably [from] 4Chan,” she said. Then, based on all that massive data and computational power, “it predicts what is likely to be the next word in the sentence. So it’s a statistical predictive engine.”\nThe answers that ChatGPT spits out may indeed be “likely,” Whittaker said. After all, she’s spoken out about AI as well as about misinformation on social media, making the issue of content moderation something she would “likely” be interested in.\nExcept that she and Signal never did such a report. ChatGPT’s “prediction” — stated as fact — was flat wrong.\nWhittaker went on to explain why this insight into AI’s limits is, as she put it, “really, really important.”\n“Why are we using a bullshit engine for anything serious?” she asked. “We are in an information ecosystem that is overrun by falsehoods, by half truths, by misinformation. And as a society, we need access to some form of shared reality.”\nInstead, Whittaker said, we’ve unleashed a new form of technology “that behaves kind of like that uncle who shows up to holiday gatherings, has a few drinks, and then just talks confidently about shit he does not know. And that’s funny for the holidays. But that’s not something we should be injecting into our information ecosystem.”\nIt was a sobering lecture for me and, I suspect, many in the audience. But being a professional reporter, I did what I’m supposed to do. I went back to ChatGPT for comment.\nAt first, ChatGPT doubled down on the falsehoods it had provided.\n“Yes, I recall providing you with that question for your interview with Meredith Whittaker of Signal about AI,” it told me in a conversation Monday. “Regarding the report on the role of AI in content moderation that Signal recently published, the report highlights some of the key challenges and limitations associated with using AI for content moderation.”\nBut, I quickly interjected, Whittaker told me that Signal never did such a report and that ChatGPT's responses to me were “bullshit.” “Can you comment — and explain how and why you got this wrong?”\nAt this point, something interesting happened. In my previous conversation with ChatGPT, it spit out its answers in nanoseconds. In this case, I waited at least five seconds for a response as it seemed to struggle with how to play damage control.\nAnd then: “I apologize for the incorrect information I provided in my previous response,” it said. “It appears that there was a misunderstanding on my part, and I am sorry for any confusion this may have caused.\n“I would like to emphasize that I am a language model, and my responses are generated based on the data and information available to me at the time of the question. I do not have the ability to fact-check or verify the accuracy of the information that I am presenting,” the chatbot added.\nI’ll say this much for AI. I’ve caught quite a few politicians over the years in\n. But I’ve rarely gotten such a forthright apology."},
{"url": "http://news.yahoo.com//texas-mall-shooting-suv-crash-brownsville-what-we-know-182835204.html", "title": "Mall shooting, SUV crash kill 16 in deadly Texas weekend. Here's everything we know.", "date": "2023-05-08T18:28:35.000Z", "content": "It was a deadly weekend in Texas.\nOn Saturday, a 33-year-old gunman opened fire at a Dallas-area mall, killing eight people and wounding seven others before he was fatally shot by police. Less than 24 hours later, the 34-year-old driver of an SUV ran a red light and slammed into a crowd of migrants in the border city of Brownsville, killing eight people waiting for a bus outside a shelter\nHere’s everything we know so far about the two tragedies, culled from original reporting and Yahoo News’ partner network, including the Associated Press, Fort Worth Star-Telegram and others.\nAccording to police, the shooting began around 3:30 p.m. at Allen Premium Outlets in Allen, Texas, about 25 miles north of Dallas, when a man armed with an AR-15-style assault rifle and wearing tactical gear opened fire, killing eight people and wounding seven others before he was fatally shot by a police officer who happened to be at the mall.\nThe Texas Department of Public Safety later identified the gunman as Mauricio Garcia, who lived in the Dallas area.\n, police recovered an additional handgun at the scene, and more weapons and ammunition were found in his car.\nInvestigators were also searching a Dallas home connected to the suspect,\n, and a motel near an interstate where he had been staying.\nFederal officials are reportedly looking into whether the shooter had expressed an interest in white supremacist ideology and neo-Nazi views as they look for a motive for the attack.\nBoth the AP and NBC News reported that the suspect had a patch on his chest that read “RWDS,” an acronym for the phrase “Right Wing Death Squad,” which is popular among right-wing extremists and white supremacy groups.\nAnd a preliminary review of what were believed to be the shooter’s social media accounts revealed “hundreds of posts” that expressed interest in white supremacist and neo-Nazi views, per NBC.\nFive of the deceased victims ranging in age from 5 to 61 years old have been publicly identified.\nChristian LaCour, a 20-year-old security guard from Farmersville, Texas, died while working at the mall, his sister, Brianna Smith,\n.\n“He was a really sweet kid. I’m sad that he’s gone,” Smith said.\n​​Aishwarya Thatikonda, a 27-year-old Indian engineer, who lived in the Dallas suburb of McKinney, Texas, was at the mall with a friend,\n. Thatikonda was killed in the shooting. Her friend was wounded.\nThree members of a Korean American family were also among the deceased victims,\n. Cho Kyu Song, 37, Kang Shin Young, 35, and their 3-year-old son were killed. Another child of the couple, a 5-year-old, survived and is being treated at a hospital.\nAppearing on “Fox News Sunday,” Texas Gov. Greg Abbott bemoaned the nation’s mental health crisis while resisting calls for stricter gun control.\n“What Texas is doing in a big-time way, we are working to address that anger and violence but going to its root cause, which is addressing the mental health problems behind it,” Abbott said, adding: \"People want a quick solution. The long-term solution here is to address the mental health issue.”\nIn a statement, President Biden called on Congress to enact tougher gun laws while\nin the United States already this year.\n“An assailant in tactical gear armed with an AR-15 style assault weapon gunned down innocent people in a shopping mall, and not for the first time,” Biden said. “Such an attack is too shocking to be so familiar.”\nOn Sunday morning, tragedy struck the border town of Brownsville in the southeast corner of the state. An SUV driver killed eight people and injured another 10 when he ran his car into a line waiting to board a bus outside a migrant center.\nShelter director Victor Maldonado, who reviewed the security footage,\nthat “this SUV, a Range Rover, just ran the light that was about 100 feet (30 meters) away and just went through the people who were sitting there in the bus stop.”\nThe Brownsville Police Department said the driver tried to flee the scene after the SUV flipped but was held down by bystanders before being taken to the hospital, where his blood was tested for drugs and alcohol. On Monday morning,\nof the driver being restrained outside the Ozanam Center. Many of the victims were Venezuelan.\nAt a press conference Monday morning, police announced that the driver was Brownsville native George Alvarez, 34. Chief Felix Sauceda said Alvarez had a previous record and was being charged with reckless driving, eight counts of manslaughter and 10 counts of aggravated assault with a deadly weapon. Sauceda added that Alvarez was now out of the hospital in police custody, they weren’t ruling out any potential motives and they were working with the Venezuelan government.\nSunday that Alvarez wasn’t cooperating with police, saying, “It's not simply just combative. He is just saying, ‘No, I am not going to do this,’ and he will tense up and so it kind of makes it harder for the detention officers to do their jobs, but we are talking to him.”\n, and additional vigils are planned.\n“Pray for those who saw it happen; they are devastated,”\n, who led the service. “Many first responders attended the Mass; pray for them also, for the burden they carry is great.”\nHomeland Security Secretary Alejandro Mayorkas visited Brownsville on Friday and said authorities were facing “\n” circumstances as\n, a pandemic-era border restriction, was set to end. Mayorkas noted that there had been a particular surge in migrants from Venezuela for reasons that were unclear.\nIn order to reduce the number of migrants entering the country,\non asylum seekers, including denying entry to anyone who crossed through another country without applying for protections there before reaching the U.S.-Mexico border. The proposed regulation, which will make it easier to quickly deport asylum seekers who are disqualified under the new rule, was widely condemned by immigration and human rights advocates when it was unveiled in February.\nBrownsville is\nto issue emergency declarations in advance of Title 42 ending. In late April, officials said they had never\n."},
{"url": "http://news.yahoo.com//what-is-right-wing-death-squad-texas-mall-gunman-far-right-extremism-174549571.html", "title": "What is ‘Right Wing Death Squad’? Investigators probe Texas mall gunman’s ties to far-right extremism", "date": "2023-05-09T17:45:49.000Z", "content": "The gunman who killed eight people before he was fatally shot by a police officer at a Dallas-area mall on Saturday was wearing a tactical vest with a patch that read “RWDS,” an acronym which stands for “Right Wing Death Squad” — a phrase that has been embraced in recent years by far-right extremists.\nLaw enforcement officials are exploring whether the shooter, identified as 33-year-old Mauricio Garcia, had expressed an interest in white supremacist ideology and neo-Nazi views as they look for a motive for the attack.\nHere’s everything we know about the phrase and investigation, culled from our original reporting and trusted partners, including the Associated Press, NBC News and Fort Worth Star-Telegram.\n, the term “Right Wing Death Squad” originated in the 1970s and was used to describe Central and South American paramilitary groups who supported right-wing governments and dictatorships and opposed perceived enemies on the left.\nOren Segal, vice president of the Anti-Defamation League's Center on Extremism, told the news service that “RWDS” reemerged in the 2010s among some right-wing groups, who used it on stickers, patches and in online forums.\n“It essentially became a phrase that was co-opted to demonstrate opposition to the left more broadly by right-wing extremists,” Segal said.\nRight Wing Death Squad was the name of the smaller groups that participated in the white nationalist Unite the Right Rally in Charlottesville, Va., in August 2017.\nAccording to Heidi Beirich, co-founder of the Global Project Against Hate and Extremism, the Proud Boys — a neofascist group of self-described “Western chauvinists” — are largely responsible for popularizing the use of “RWDS” among the far-right.\nFollowing the 2020 election, members of the Proud Boys joined supporters of then-President Donald Trump at rallies protesting the results.\nProud Boys national chairman Enrique Tarrio and other leaders of the group were photographed wearing RWDS patches at those demonstrations.\nLast week,\nof seditious conspiracy in connection with the Jan. 6, 2021, attack on the U.S. Capitol.\nGiven the RWDS patch worn by the Texas shooter, investigators quickly zeroed in on his social media accounts in search of a possible motive.\n, a preliminary review revealed “hundreds of posts” that expressed interest in white supremacist and neo-Nazi views.\nposts made by Garcia on a Russian social networking site showed “a fascination with white supremacy and mass shootings, which he described as sport.”\nAnd photos he posted showed what appeared to be large Nazi tattoos on his arm and torso, including a swastika and the SS lightning bolt symbol of Hitler’s paramilitary forces.\nOther online activity suggests the 33-year-old had researched when the shopping center, located in one of the Dallas area’s most diverse suburbs, would be the busiest.\n\"The big question that we're dealing with right now is, what's his motive? Why did he do this?\" Hank Sibley, regional director of the Texas Department of Public Safety, said at a press conference Tuesday. \"We don't know, that's what the investigation is trying to find out. We do know that he had neo-Nazi ideation. He had patches, he had tattoos, even his signature, you know, verified that.\"\nAccording to police, the shooting began around 3:30 p.m. Saturday at Allen Premium Outlets in Allen, Texas, about 25 miles north of Dallas, when a man armed with an AR-15-style assault rifle and wearing tactical gear opened fire. Eight people were killed and seven others were injured before the gunman was fatally shot by a police officer who happened to be at the mall.\nwere Christian LaCour, a 20-year-old security guard; ​​Aishwarya Thatikonda, a 27-year-old Indian engineer; and three members of a Korean American family: Cho Kyu Song, 37, Kang Shin Young, 35, and their 3-year-old son.\nThe Texas Department of Public Safety later identified the gunman as Garcia, who lived in the Dallas area.\nthat police recovered an additional handgun at the scene, more weapons and ammunition in his car, and the tactical vest emblazoned with the RWDS patch.\n“Nobody is going to accidentally have a ‘Right Wing Death Squad’ patch,” American University professor Cynthia Miller-Idriss, director of the school’s Polarization and Extremism Research & Innovation Lab, told the AP.\nBut extremists who adopt these terms and symbols often don’t fully understand their origins, Miller-Idriss said.\n“Because of this whole meme culture, and generally the way that iconography is used to signal encoded speech or messages, they don’t always know exactly,” she said."},
{"url": "http://news.yahoo.com//finance/news/corporate-defaults-highest-level-years-131453186.html", "title": "Corporate defaults are at their highest level in years, and it's poised to get even worse. Here are the 5 biggest players who went broke in March.", "date": "2023-05-09T13:14:53.000Z", "content": "In March, 15 companies rated by Moody's defaulted on their debt, bringing up the first quarter total to 33.\nThat's the highest level since the last quarter of 2020, when 47 companies defaulted on their debt.\nThe ratings giant expects junk bond defaults could rise to 4.9% by March 2024.\nCorporate default rates are at the highest level in years, according to a bankruptcy report released on April 14 by ratings agency Moody's.\n,\n, a\n, and\nall weighed on companies' performances in the first quarter of 2023.\nIn the first quarter of the year, 33 companies rated by Moody's were unable to pay their debts. That's the highest number since the last quarter of 2020, when 47 companies defaulted on their debt, the agency said in the report.\nHere's the month by month breakdown from Moody's:\nJanuary: six companies\nFebruary: 12 companies\nMarch: 15 companies\nEach of those companies either filed for Chapter 11 protection, went under receivership, missed payments, or conducted a \"distressed exchange\" — an event wherein creditors accept haircuts out of fear that troubled debtors will not be able to fulfill their commitments.\nThat's not all of the bad news.\nThe ratings giant expects junk bond defaults could rise to 4.9% by March 2024, thanks to higher interest rates and slower economic growth. That percentage stood at 2.9% at the end of March and the 4.1% as a long-term average.\nS&P Global, another ratings agency, said in a\nthat default rates for American junk corporates alone could touch 4% by December 2023, up from 1.7% in December 2022 — meaning 73 junk-rated companies could default, per S&P.\nIn other words, things can get much worse.\nAnd worrying signs are already beginning to show:\n, making it the third regional bank after Silicon Valley Bank and Signature Bank to be taken over by federal regulators following a banking crisis this year.\nRead further for a chronological look at five major players that defaulted on their debts in March, the most recent month for which the data has been compiled. This list has been curated to highlight the biggest companies — by impact — that went broke and were unable to honor their debt obligations.\nSilicon Valley Bank was closed down by regulators on March 10 after a traditional bank run.\n: Silicon Valley Bank\n: Santa Clara, California\n: $3.3 billion\n: $209 billion as of December 31\nAfter days of turmoil and a traditional bank run, the California Department of Financial Protection and Innovation\nAs part of the closure, the Federal Deposit Insurance Corporation, or FDIC, took control of SVB. Subsequently, on March 27, North Carolina-based\nassets at a discount of $16.5 billion.\nThe most striking thing about the collapse of Silicon Valley Bank — which\nat end of 2022 —\n.\nJust days before it became what is now\nSVB CEO Greg Becker was at an investor conference\n.\nBut over the 48 hours preceding the bank's winding up announcement, shares of the company cratered by 87%, as fears of a bank run escalated after a\nand a\nwithdrawing their funds.\nLoyalty Ventures Inc. filed for Chapter 11 protection on March 10.\nLoyalty Ventures Inc.\nDallas, Texas\n$636 million\nListed $10 million in bankruptcy filing\nMarch 10 proved to be a catastrophic day for not only SVB but also consumer rewards program operator Loyalty Ventures Inc — which filed for Chapter 11 bankruptcy\n.\nThe Moody's report shows Loyalty Ventures defaulted on loans of just under $640 million in the first quarter of 2023.\nLoyalty Ventures had been struggling with multiple problems including a loss of customers, dwindling revenues, and operational challenges that hit the travel sector due to the COVID-19 pandemic,\n.\nThe company's bankruptcy protection allows it to restructure its debt while continuing to operate, Bloomberg reported. Loyalty Ventures employed\nAs part of the Chapter 11 proceedings, Canada's Bank of Montreal agreed to acquire the Canadian arm of Loyalty Ventures' rewards program Air Miles for an undisclosed amount,\n. Bloomberg Law\nthe sale transaction value at $160 million.\nLoyalty Venture had $1.98 billion in liabilities and total assets of $1.59 billion at the end of the third quarter of 2022,\n. Total revenue for the quarter was $162 million, down 4% year-on-year.\n$10 million in its bankruptcy petition.\nThe crypto-friendly Signature Bank was shut down by regulators on March 13.\n: Signature Bank, New York\n: New York, New York\n: $575 million\n: $110 billion as of December 31\nAs events rapidly unfolded at Silicon Valley Bank, spooked customers at crypto-friendly Signature Bank\nmore than $10 billion in deposits.\nThe panic snowballed into a bank run, which ultimately toppled the New York-based bank and became what is today the\n.\nBefore its failure, Signature Bank — which employed over 2,250 people, per its\n— had assets of\n.\nThe bank spiraled so quickly that even board members were shocked. \"We had no indication of problems until we got a deposit run late Friday, which was purely contagion from SVB,\" former US Rep. Barney Frank, a board member of the bank,\nin March.\nThe FDIC —\nafter its collapse — agreed to sell all of Signature Bank's deposits and loans\n.\nDiamond Sports Group, the largest broadcaster of local sports in the US, filed for Chapter 11 bankruptcy on March 14 after missing interest payments.\n: Diamond Sports Group\n: Hunt Valley, Maryland\n: $8.7 billion\n: Parent Sinclaire Group listed assets of $6.7 billion at the end of 2022\nDiamond Sports Group, the largest owner of regional sports networks in the US, defaulted on over $8.7 billion of bonds and loans — the largest default by amount in March, according to the Moody's report.\nThe regional sports broadcasting company is an unconsolidated and independently run subsidiary of Sinclair Broadcast Group Inc. On March 14, it filed for\nand is currently trying to negotiate a restructuring agreement with its lenders.\nThe mountain of debt\nof\nof networks from Disney for $10.6 billion.\nDiamond Sports listed assets and liabilities between $1 billion and $10 billion for its sports brands in the Chapter 11 petition,\n.\nDiamond Sports' lower-than-expected revenue cannot, under its existing debt load, \"support the payments the company must make to professional sports teams and leagues for broadcast rights,\" Moody's said in the report.\nThe company owns the right to 42 teams across the Major League Baseball, the National Hockey League, and the National Basketball Association via its Bally brand,\n.\nTravelport conducted a distressed exchange on March 30, which constitutes a default event, per Moody's.\n: Travelport (Toro Private Holdings II Limited)\n: Langley, United Kingdom\n: Around $2 billion\nFounded in 2001,\nis majority owned by private equity investors Siris Capital and Elliott Private Equity.\nthe company employed nearly 3,000 people.\nTravelport — which lists its debt under Toro Private Holdings II Limited — became the second-largest non-financial corporate defaulter in March, after it conducted a distressed exchange of $2 billion in debt obligations.\nIn an April 4 report,\nit tagged the company for default after two events: The two private equity owners pumped in $200 million into Travelport as equity, and Travelport conducted a debt exchange on outstanding loans of over $2 billion on March 30.\nTravelport, which is privately held and does not disclose its financials publicly, reported net revenues of $1.3 billion in 2022, per Moody's.\nRead the original article on"}
]