[
{"url": "http://news.yahoo.com//least-2-dead-crash-involving-101857980.html", "title": "Police identify victims of ‘catastrophic’ crash on I-75 as 21-year-old woman, 59-year-old man", "date": "2023-04-18T14:55:47.000Z", "content": "Marietta police confirmed two people died after a “catastrophic series” of crashes on Interstate 75 northbound Tuesday morning.\nsays a chain-reaction crash involving five vehicles happened near South Marietta Parkway just before 5:30 a.m. All northbound lanes were shut down for over four hours as police investigated.\nspoke to investigators at the crash scene. They believe the crashes happened after a young woman pulled over to the far left lane to check on a flat tire.\nAs the driver was checking on it, police said she was rear-ended by a driver and run over. That driver was “ripped” from their car in the impact and was run over by another car. Both drivers died on the scene.\nPolice have identified the driver who got a flat tire as Eduarda Cristina Romano DaSilva, 21, of Marietta. Marietta Police said 59-year-old Victor Parra, of Jonesboro, hit Romano’s car after she stopped in the far-left lane. Parra’s Toyota spun out of control and ended up facing the other direction.\nWhen Parra and Romana DaSilva got out of the cars, they were both hit by a Chevrolet Silverado driven by 72-year-old David West, who is from Wolcottville, Indiana.\nBoth Romano DaSilva and Parra were pronounced dead at the scene. West and his passenger, 74-year-old Cynthia West, sustained minor injuries and were taken to the hospital."},
{"url": "http://news.yahoo.com//pastry-artwork-pits-bakery-against-052309718.html", "title": "Donut painting sparks free speech debate for bakery, town", "date": "2023-04-18T05:23:09.000Z", "content": "CONWAY, N.H. (AP) — Bakery owner Sean Young was thrilled when high school art students covered the big blank wall over his doorway last spring with a painting of the sun shining over a mountain range made of sprinkle-covered chocolate and strawberry donuts, a blueberry muffin, a cinnamon roll and other pastries.\nThe display got rave reviews, and Young looked forward to collaborating with the school on more mural projects at his roadside bakery in Conway, New Hampshire.\nThen the town zoning board got involved, deciding that the pastry painting was not so much art as advertising, and so could not remain as is because of its size. Faced with modifying or removing the mural, or possibly dealing with fines and criminal charges, Young sued, saying the town is violating his freedom of speech rights.\nThe painting could stay right where it is if it showed actual mountains, instead of pastries suggesting mountains, or if the building wasn’t a bakery.\n“They said it would be art elsewhere,” Young told The Associated Press in an interview. “It’s just not art here.”\n“The town should not have the right to police art,” he said.\nThe controversy has residents of this town of 10,000 grappling with big questions about creativity and liberty as it tries to preserve its rural character. Like other White Mountain communities that draw skiers, nature lovers and shoppers, Conway is under development pressure, making the sign dispute fraught with worries that any concession to commerce could change what they hold dear.\nMany — including the zoning board members — applauded the students' colorful work, but said rules must be followed, even if they're old and outdated. At about 90 square feet (8.6 square meters), the mural is four times bigger than the sign code allows.\nFollowing a longstanding democratic tradition of New England town meetings, residents deliberated how to define a sign before ultimately voting down changes last week. The local newspaper said the proposed wording wasn't clear. Ultimately, a judge may have to resolve what remains an open debate in town.\n“Those kids put their heart in it,” retiree Steve Downing said. He thinks the painting should stay.\n“Everyone has to comply with the ordinance,\" said Charlie Birch, a former U.S. Forest Service worker. \"And even though it was done by the students, which was well done, and I give them a lot of credit for it ... if you have the ordinance, ‘One for all,’ that’s where we are. You can’t really make any exceptions, otherwise everybody else will want the exception.”\nArt teacher Olivia Benish, who worked with three students on the project, apologized to the board in September for not doing “due diligence” to make sure the mural would comply. She didn't respond to requests for an interview. But she told the board members that there has to be a way to give students the opportunity to create positive public works of art \"without upsetting the law and the powers that be,”\n.\nargues that the town is unconstitutionally discriminating against him. He asked a judge to prevent the town from enforcing its sign code.\nAnd now other businesses have been drawn into the controversy.\nLong before the pastry painting was installed, the town had allowed other murals at a local shopping center, but in December the town found that three of those artworks are, indeed, signs that violate size limits. They go before the zoning board on Wednesday.\nYoung, who is being represented by the Virginia-based Institute for Justice, asked for $1 in damages. Meanwhile, he’s selling T-shirts as a high school art department fundraiser, saying “This is Art” with the artwork on the front, and “This is a Sign” of a roadside “Leavitt’s Country Bakery” sign on the back.\n“As Conway officials have confirmed, the town does not consider a painting to be a “sign” if it does not convey what town officials perceive to be a commercial message,” the lawsuit says. “But the town’s perception is that any mural depicting anything related to a business is a ‘sign.’ This is governmental discrimination based on the content of the speech\" and the speaker's identity, it said.\nThe lawsuit says the town’s sign definition is “incredibly broad,” with no mention of murals in the code:\nis “any device, fixture, placard, structure or attachment thereto that uses color, form, graphic, illumination, symbol, or writing to advertise, announce the purpose of, or identify the purpose of any person or entity, or to communicate information of any kind to the public, whether commercial or noncommercial.”\nBoard member Luigi Bartolomeo said he thinks the pastry painting is art, not advertising. He read the definition out loud\n, and said he agrees with a local attorney who called it “unconstitutionally vague.”\n“I think it’s a very badly written piece of code here,” said Bartolomeo, who recently retired. But Board Chairperson John Colbath said the board has to work with the ordinance, which was approved by voters, and that there is a process to change that.\n“If they had done a seasonal mural on the wall — covered bridges and sunflowers and what have you — and it did not represent what your business is in, then it would be more likely to be a well-respected piece of art and not construed as a sign,” Colbath said at the August meeting.\nHe said to Young, “I understand the art thing — and you look and you see a mountain — but the general public sees donuts on the front of the bakery.”\n“I think most of the people said it’s art,” Young responded.\nIn its denial of Young's appeals, the board concluded that the bakery won't be negatively affected without the display.\n“This supposed distinction between murals and signs shouldn’t matter,” attorney Betsy Sanz of the Institute said in a news release. “After all, nothing in the First Amendment distinguishes between art and commercial signs — or commercial speech of any kind.”\nThe town and Young agreed in February to pause court proceedings — and any potential fines or charges — pending a vote on a revised definition that would allow the painting to stay. But it failed in last week's elections, with 805 to 750 voting against it,\n. The judge now wants to hear from both sides by May 10.\n“We’re ready to keep going,” Young said.\nTown Manager John Eastman declined an interview, referring questions to town lawyer Jason Dennis, who said he would soon meet with town officials to discuss next steps.\nThe Conway Daily Sun offered its analysis in\n“Voters smartly concluded that the proposed new definition of signs would only further complicate enforcement. That said, it is not a stretch to conjecture that most voters are fine with the murals at Leavitt’s Country Bakery and Settlers Green. We suggest the town figure out a way to back off enforcement until a clearer definition can be written, one that accommodates ‘art.'\"\n___\nMcCormack reported from Concord, New Hampshire."},
{"url": "http://news.yahoo.com//2-cheerleaders-shot-one-accidentally-040849861.html", "title": "2 Cheerleaders Shot After One Accidentally Steps Into Wrong Car: Report", "date": "2023-04-19T04:08:49.000Z", "content": "A 25-year-old man is in custody after police said he shot two high school cheerleaders, including one described as a cheer world “icon,” on Monday in Texas.\nFour cheerleaders involved with the competitive program Woodlands Elite Cheer were in a parking lot after practice when one of them accidentally tried to get into the wrong vehicle, Bastrop County sources close to the investigation told\n.\nAccording to cheerleader Heather Roth, she had just jumped out of her friend's car when she opened the door to what she thought was her vehicle. When she saw a man on the passenger side seat, she thought a stranger had entered her car, so she got out and jumped back into the friend’s car.\nPedro Tello Rodriguez Jr.\nThe man in the vehicle then got out, approached the friend’s car, and as Roth wound down the window and began to apologize, the man “threw up his hands, pulled out a gun, and started shooting—he fired multiple shots at the group,” she said.\nA witness at the scene—the manager of the parking lot—has also reportedly verified the shooting.\nRoth was grazed by a bullet and treated at the scene, while another one of the girls—identified as Payton Washington—was transported to a hospital by helicopter.\n“Payton opens the door, and she starts throwing up blood,” Roth told ABC13.\nWashington is in stable condition, according to a\nset up to cover her medical expenses, but remains in an intensive care unit.\nWoodlands Elite Cheer owner Lynne Shearer told\n—who also verified the events of the shooting with an unnamed source—that Washington is “literally an icon” in the industry and that she was supposed to compete in a world championship this weekend. She was also born with just one lung.\n“It was a harrowing night for all four of those girls,” Shearer said.\n“She’s won every title there is to win in All-Star cheerleader except for a world title, so that makes this super heartbreaking for her.”\nElgin police arrested the alleged gunman, 25-year-old Pedro Tello Rodriguez Jr., Tuesday, citing an “altercation” in the parking lot in a\n.\nHe has been taking into custody and charged with deadly conduct."},
{"url": "http://news.yahoo.com//u-charges-two-yorkers-conspiring-163819560.html", "title": "US arrests two for setting up Chinese 'secret police station' in New York", "date": "2023-04-17T16:38:20.000Z", "content": "By Luc Cohen\nNEW YORK (Reuters) -U.S. federal agents arrested two New York residents for allegedly operating a Chinese \"secret police station\" in the Chinatown district of Manhattan on Monday in what prosecutors said was part of a crackdown on Beijing's alleged targeting of dissidents.\nLu Jianwang, 61, and Chen Jinping, 59, face charges of conspiring to act as agents of China's government without informing U.S. authorities and obstruction of justice. They were released on bond following an initial appearance in Brooklyn federal court.\nA 2022 investigation published by Spain-based advocacy group Safeguard Defenders reported that China had set up overseas \"service stations,\" including in New York, that illegally worked with Chinese police to pressure fugitives to return to China.\nThe Chinese government has said there are centers outside China run by local volunteers, not Chinese police officers, that aim to help Chinese citizens renew documents and offer other services.\nThe Department of Justice has been ramping up probes into what it calls \"transnational repression\" by U.S. adversaries such as China and Iran to intimidate political opponents living in the United States.\n\"We cannot and will not tolerate the Chinese government's persecution of pro-democracy activists who have sought refuge in this country,\" Breon Peace, the top federal prosecutor in Brooklyn, told reporters.\nProsecutors on Monday unveiled charges against 34 Chinese officials for allegedly operating a \"troll farm\" and harassing dissidents online, including by disrupting their meetings on U.S. technology platforms.\nThey also added eight Chinese government officials as defendants in a case announced in 2020 charging a former China-based executive of Zoom Video Communications Inc with disrupting video meetings commemorating the 1989 Tiananmen Square protests.\nThe officials charged are all at large.\n\"By initiating prosecution against Chinese citizens under the pretext of 'transnational repression', the U.S. side is exercising long-arm jurisdiction based on fabricated charges. This is sheer political manipulation, and the purpose is to smear China’s image,\" said Liu Pengyu, a spokesperson for the Chinese embassy in the U.S.\nHELPING LOCATE 'FUGITIVES'\nLu and Chen are both U.S. citizens who lead a nonprofit organization that lists its mission as providing a social gathering place for people from China's Fujian province, prosecutors said.\nBefore it closed in the fall of 2022, the men's New York operation occupied a full floor in a nondescript building in Chinatown near the Manhattan Bridge.\nPeace said the site was being used \"at the very least\" for government services like helping some Chinese citizens renew their drivers licenses' - activity that should have been disclosed to U.S. authorities. But he said it was also used for more \"sinister\" activities.\nIn 2022, Lu helped open the so-called police station and was asked by China's government to locate an individual living in California who was considered a pro-democracy activist, they added. In 2018, Lu had sought to persuade an individual considered a fugitive by China to return home, prosecutors said.\nProsecutors said Lu and Chen admitted to the FBI that they deleted their communications with a Chinese government official.\nFBI Director Christopher Wray told a U.S. Senate committee in November that he was \"very concerned\" about the presence of such stations in U.S. cities.\nProsecutors previously charged more than a dozen Chinese nationals and others with waging surveillance and harassment campaigns against dissidents living in the United States, including by trying to forcibly repatriate people whom China considered fugitives.\n(Reporting by Luc Cohen in New York and Susan Heavey in Washington; Additional reporting by Michael Martina in Washington and Dan Whitcomb in Los Angeles; Editing by Bill Berkrot, Rosalba O'Brien, Don Durfee and Lincoln Feast.)"},
{"url": "http://news.yahoo.com//us-brings-charges-over-secret-172459993.html", "title": "Secret Chinese police station in New York leads to arrests", "date": "2023-04-17T17:24:59.000Z", "content": "NEW YORK (AP) — Two men were arrested Monday on charges that they helped establish a secret police station in New York City on behalf of the Chinese government, and about three dozen officers with China's national police force were charged with using social media to harass dissidents inside the United States, authorities said Monday.\nThe cases are part of\nin recent years aimed at disrupting Chinese government efforts to locate in America pro-democracy activists and others who are openly critical of Beijing's policies and to suppress their speech.\nOne of three cases announced Monday concerns a local branch of the Chinese Ministry of Public Security that had operated inside an office building in Manhattan's Chinatown neighborhood before closing last fall amid an FBI investigation. The two men who were arrested were acting under the direction and control of a Chinese government official and deleted communication with that official from their phones after learning of the FBI's probe in an apparent effort to obstruct the inquiry, according to the Justice Department.\nThough China is believed to be operating secretive police outposts in countries around the globe, Justice Department officials said these arrests were the first of their kind anywhere in the world.\n“This is a blatant violation of our national sovereignty,” Michael Driscoll, the head of New York's FBI field office, said at a news conference announcing the cases.\nThe men, identified as “Harry” Lu Jianwang, 61, of the Bronx, and Chen Jinping, 59, of Manhattan, both U.S. citizens, were arrested at their homes on Monday morning. A lawyer for Lu declined to comment. An email message seeking comment was left with a lawyer for Chen.\nAt no point did the men register with the Justice Department as agents of a foreign government, U.S. law enforcement officials said. And though the secret police station did perform some basic services, such as helping Chinese citizens renew their Chinese driver's licenses, it also served a more “sinister” function, including helping the Chinese government locate a pro-democracy activist of Chinese descent living in California, officials said.\n“New York City is home to New York’s finest: the NYPD,\" said U.S. Attorney Breon Peace, the top federal prosecutor in Brooklyn, whose office brought the cases. \"We don’t need or want a secret police station in our great city.”\nJustice Department officials in recent years have prioritized prosecutions of what’s known as “transnational repression,” in which foreign governments work to identify, intimidate and silence dissidents in the U.S.\nA signature case concerning China was announced in 2020, when the Justice Department charged more than a half-dozen people with working on behalf of the Chinese government in a pressure campaign aimed at coercing a New Jersey man wanted by Beijing into returning to China to face charges. In January, the Justice Department charged three men in an alleged plot that originated in Iran to kill an I\nwho has spoken out against human rights abuses there.\n“In America, the law protects all of us equally from persecution, violence and threats of violence,\" said David Newman, a top official in the Justice Department’s national security division.\n“As authoritarian governments — whether the PRC, Russia, Iran, or others — become more brazen in their efforts to trample the rights and liberties that are the bedrock of our democracy, the Department of Justice will redouble its efforts to defend our democracy, our democratic institutions, and our sovereignty,” Newman said, using an acronym for the People's Republic of China.\nIn a separate scheme announced Monday, the Justice Department charged 34 officers in the Ministry of Public Security with creating and using thousands of fake social media accounts on Twitter and other platforms to harass dissidents abroad.\nProsecutors say the defendants, all part of a specialized task force that worked out of a police facility in Beijing, also used social media to spread Chinese government propaganda on subjects including racial justice protests in the U.S., Russia's war against Ukraine and human rights issues in Hong Kong. All of the defendants remain at large and are believed to be living in China.\nIn addition, prosecutors on Monday announced that eight Chinese government officials who are believed to be currently living in China were charged with directing an employee of a U.S. telecommunications company to remove Chinese dissidents from the company’s platform.\nJin Xinjiang, also known as Julien Jin, a former China-based Zoom executive, was among 10 people charged in an amended complaint. He was initially charged in December 2020, when authorities alleged that he tried to disrupt a series of Zoom meetings in May and June of that year that were meant to commemorate the 1989 Tiananmen Square Massacre.\nAt the time, Jin served as Zoom’s primary liaison with Chinese government law enforcement and intelligence services, regularly responding to requests by the Chinese government to terminate meetings and block users on Zoom’s video communications platform, authorities said.\n____\nTucker reported from Washington. Associated Press writer Bobby Caina Calvan in New York contributed to this report."},
{"url": "http://news.yahoo.com//ceo-took-home-nearly-5m-191000871.html", "title": "CEO Who Took Home Nearly $5M Last Year Tells Employees Hoping for a Bonus: 'Leave Pity City'", "date": "2023-04-17T19:10:00.000Z", "content": "In this edition of Eat the Rich Weekly, the President and CEO of MillerKnoll, a company hawking the uninspired and overpriced furniture that likely litters your own place of employment, told staffers inquiring about a bonus via Zoom to “leave pity city.”\nAndi Owen, the woman at the helm of MillerKnoll who took home\n(including a $1.2 million bonus) in 2022,\nlast week to inform employees that from where she’s sitting in Very Bad Person Valley, they have\ngall for asking for an acknowledgement of their labor.\nRead more\n“Questions came through about, ‘How can we stay motivated if we’re not going to get a bonus...What can we do? What can we do?’” Owen began in the viral clip of what appears to be an internal meeting. “Some of them were nice, and some of them were not so nice.” Gee, lady who looks like she took a little too much inspiration from the litany of Gwyneth Paltrow litigation chic think-pieces, I wonder why some questions would be unkind...\nzoom call from a ceo who cancelled all employee bonuses but took a $6.4 million bonus herself\n— Warren Commission Test Skull (@conzmoleman)\n“I’m going to address this head on,” she continued. “The most important thing we can do right now is focus on the things that we can control. None of us could’ve predicted covid, none of us could’ve predicted supply chain, none of us could’ve predicted bank failures. But what we can do, is stay in front of our customers, provide the best customer service we can, get our orders out our door, treat each other well, be kind, be respectful, focus on the future, because it will be bright.”\nIf you’re thinking that this simply sounds like some garden variety white woman toxic positivity, you’re right! But as it often does, the veil soon slipped.\n“Don’t ask about, ‘What are we going to do if we don’t get a bonus?’ Get the damn $26 million dollars,” Owen demanded, her voice hitting the same octave my mother’s did when I told her forgot to file my taxes until last week. “Spend your time and your effort thinking about the $26 million dollars we need and not thinking about what you’re going to do if you don’t get a bonus. Alright? Can I get some commitment for that?”\nOf course, Owen did not receive an audible reply from her underlings, but I have to assume one slip of the mute button would’ve revealed some expletives. I have no trouble imagining the employee group text was pretty lit, too.\n“I had an old boss who said, ‘You can visit pity city, but you can’t live there,’” Owen concluded. “So, people, leave pity city! Let’s get it done.” Spoken like a true pink power suit capitalist SheEO—namely one that bought up\nin her own company’s stock and\nthe\nshe often longs for the good old days when she lived in Berkeley where she could “walk down the street and everyone thought the same way.”\nIf anyone from MillerKnoll is reading this: Buy property in Pity City. I can assure you, you can afford it.\nMore from Jezebel\nSign up for\nFor the latest news,\n,\nand\n."},
{"url": "http://news.yahoo.com//republican-congressman-urges-judge-let-140557971.html", "title": "Republican US congressman asks judge to let probe into Trump case proceed", "date": "2023-04-17T14:05:57.000Z", "content": "By Luc Cohen\nNEW YORK (Reuters) -Republican U.S. congressman Jim Jordan on Monday asked a judge to let a House of Representatives panel's investigation into the criminal prosecution of former President Donald Trump proceed, saying a subpoena of a former Manhattan prosecutor was needed by lawmakers as they consider possible legislation.\nJordan, chairman of the House Judiciary Committee and an ally of fellow Republican Trump, made the request to U.S. District Judge Mary Kay Vyskocil two days before she is due to hold a hearing in the case in federal court in Manhattan.\nManhattan District Attorney Alvin Bragg, who brought 34 felony counts of falsifying business records against Trump, last week sued Jordan to stop what Bragg called a \"campaign of intimidation\" against the prosecution of the former president. The suit sought to block the committee's subpoena seeking testimony from Mark Pomerantz, who once led the Manhattan district attorney's office Trump investigation but resigned in early 2022.\nIn a separate filing, Pomerantz urged Vyskocil to block the subpoena and said he played no role in Bragg's decision to charge Trump.\nTrump, the first former U.S. president charged with a crime, pleaded not guilty on April 4 after being indicted in connection to a hush money payment made before the 2016 U.S. presidential election to porn star Stormy Daniels to prevent her from discussing a sexual encounter she has said she had with him.\nTrump, who is seeking the Republican nomination for the presidency in 2024, has denied the liaison took place.\nBragg has accused Jordan of impeding New York's \"sovereign authority\" and interfering in an ongoing criminal case.\nIn his response to Bragg's lawsuit on Monday, Jordan said his subpoena of Pomerantz was covered by protection under the U.S. Constitution for \"speech or debate\" in Congress. Jordan said his committee was considering legislation to allow presidents to move state criminal actions against them to federal court.\n\"Such legislation could help protect current and former presidents from potentially politically motivated prosecutions,\" Jordan's lawyers wrote in court papers.\n(Reporting by Luc Cohen in New York; Editing by Will Dunham and John Stonestreet)"},
{"url": "http://news.yahoo.com//watch-spacex-starship-evolve-explode-150046942.html", "title": "Watch SpaceX Starship evolve and explode on the way to its 1st space launch (video)", "date": "2023-04-17T15:00:46.000Z", "content": "On Monday evening (April 17),\nit is now targeting Thursday (April 20) for the next Starship space launch attempt. The launch window opens at 9:28 a.m. EDT (1328 GMT) and closes at 10:30 a.m. EDT (1430 GMT).\nAll eyes are on SpaceX and its Starbase facility in Texas this week as the company prepares to launch its giant Starship rocket for its first flight into space.\nSpaceX attempted to launch\natop its Super Heavy booster (a stack also referred to simply as Starship) on its first orbital test mission on Monday (April 17), but the flight was ultimately\n. Prior to the scrub announcement while SpaceX was fueling the rocket, the company\nthat contains a montage of previous Starship tests that led up to Monday's scrubbed flight attempt.\nIn the video, the sun rises on SpaceX's Boca Chica, Texas facility. The camera pans over several test spacecraft standing on display at the Starbase facility before cutting to engine ignition shots and previous\nthat emphasize the sheer power of the vehicle's thrust. The massive rocket is poised to overtake NASA's\n, which took the title of world's most powerful rocket after the successful\nlast November. When Starship does eventually take off, that title will then pass to Starship.\nThe video shows clips from Starship's high-altitude test flights, the first of which\n. The spacecraft flew nearly 8 miles high (12.8 kilometers) during the test, but was unable to successfully land and exploded into a massive fireball 6 minutes and 42 seconds after liftoff.\nThe next prototype flew a similar test mission\n, but an engine ignition failure during its descent caused that vehicle to also crash in a fiery blaze at SpaceX's Texas facility.\nThe third attempt, roughly a month later, saw a little more success in landing, but came in hard enough to crush the vehicle's landing legs — and it\n.\nFinally, during its fourth and most recent hop test, which flew March 30, 2021, Starship\n.\nThanks to the 33 Raptor engines powering\n, the rocket is capable of lifting over 100 tons (90 metric tonnes) to orbit, and is being promoted by company CEO Elon Musk as humanity's\n. Indeed, if the spacecraft is able to deliver on those visions, it will change human spaceflight as we know it.\nIn anticipation of Starship's development and success, NASA\nSpaceX the Artemis program's first Human Landing Services (HLS) contract, which will land astronauts on\nas a part of\n. Provided the Starship is operational in time — and NASA is banking on that being the case — Artemis 3 astronauts will be landing on the lunar surface aboard a SpaceX Starship by the end of 2025.\nRELATED STORIES:\n—\n—\n—\nSpaceX also plans to utilize Starship to launch larger, upgraded versions of the company's\n, the predecessors of which have dominated SpaceX's launch manifest the past few years as they are launched a few dozen at a time aboard\n. With Starship's planned increased capacity, that number will become exponentially larger as the company aims to\nStarlink satellites in orbit. SpaceX has also\nwith a number of private companies and individuals for future Starship flights as well.\nMonday's initial launch attempt for Starship and Super Heavy, the first for the stacked vehicle, was scrubbed due to a pressure anomaly in the rocket's first stage. SpaceX announcers on the company's broadcast of the launch indicated the day's attempt would be viewed as a wet dress rehearsal, and that they would wait no less than 48 hours for the next launch attempt."},
{"url": "http://news.yahoo.com//couple-reportedly-beheaded-themselves-sacrifice-172252326.html", "title": "Couple reportedly beheaded themselves in sacrifice with homemade guillotine", "date": "2023-04-17T17:22:52.000Z", "content": "— An Indian couple has allegedly died by suicide by using a guillotine-like mechanism to decapitate themselves in a sacrificial ritual, police said Sunday.\nHemubhai Makwana, 38, and his wife Hansaben, 35, both died by decapitation after using a homemade bladed mechanism in a hut on their farm in the western state of Gujarat, police said.\n\"The couple first prepared a fire altar before putting their heads under a guillotine-like mechanism held by a rope,\" Indrajeetsinh Jadeja, a police sub-inspector, was\nas saying by Indian news outlets. \"As soon as they released the rope, an iron blade fell on them, severing their heads, which rolled into the fire.\"\nFire is considered sacred in Hinduism and it plays a significant role in several worship rituals. The couple apparently designed the device used in their beheading in such a way that their heads would roll into the fire altar, completing their sacrificial ritual.\nPolice, who said they had found a suicide note addressed to family members, have launched an investigation. The couple is survived by two children and their parents.\nThe incident took place sometime between Saturday night and Sunday afternoon, when police were alerted.\nFamily members reportedly told police that the pair had offered prayers in the hut every day for the last year.\nRitual human sacrifices are not unknown in India, where official data show there were more than 100 reported cases between 2014 and 2021. But almost all known cases of human sacrifice involve people killing others to please gods, rather than themselves.\nEarlier this month, Indian\nfor murdering a woman in 2019 inside a Hindu temple in Guwahati, in what they said was a case of ritual human sacrifice."},
{"url": "http://news.yahoo.com//cube-shaped-creature-24-eyes-200534529.html", "title": "Cube-shaped creature with 24 eyes discovered hiding in pond in Hong Kong, study says", "date": "2023-04-18T20:05:34.000Z", "content": "Scientists let down a net and scooped up water from a brownish-green pond in Hong Kong. As they looked closer at their catch, they found a cube-shaped 24-eyed creature looking back — and discovered a new species.\nThe researchers found the creature hiding in the “brackish water” of shrimp ponds at\n, according to a study published March 20 in the journal Zoological Studies. They returned three summers in a row and kept finding more of these creatures.\nThe scientists analyzed the animals and discovered a new species of box jellyfish, the study said.\nBox jellyfish are named for their “cube-shaped” bodies, researchers said. This group of jellyfish contains “some of the most venomous marine animals in the world.”\nThe new species, Tripedalia maipoensis, has a see-through body with a slight whitish tinge, photos show. The jellyfish, measuring less than an inch long, has three tentacles extending from each corner of its body, the study said.\nThe jellyfish has 24 eyes arranged in sets of six, researchers said. On each side, the creature has two larger eyes — the upper and lower lens eyes — surrounded by four smaller eyes known as the pit and slit eyes.\nTwo of these eyes are used for seeing images while the other four are used to detect light, according to an April 18 news release from\n.\nThe Tripedalia maipoensis jellyfish has “pedal-shaped structures” at the base of its tentacles that act like “boat paddles,” the release said. These “paddles” allow box jellyfish to swim faster than other types of jellyfish.\nWhen swimming,\nlooks as if it’s pulsating as it thrusts its body forward, video from Hong Kong Baptist University shows.\nResearchers identified the Tripedalia maipoensis jellyfish as a new species because it was genetically and physically distinct from other box jellyfish. They named the animal after the Mai Po area where it was discovered.\nQiu Jianwen, the research team leader, described the Mai Po area as “relatively well-studied” and noted this discovery “highlights the rich diversity of marine life in Hong Kong and even the whole of China,” according to the release.\nTripedalia maipoensis is the first box jellyfish species to be discovered in Chinese waters, the release said.\nThe Mai Po Nature Reserve is in northern Hong Kong. Hong Kong is a special administrative region of China and located on the southern edge of the country."},
{"url": "http://news.yahoo.com//monster-fish-reeled-angler-may-212229420.html", "title": "Monster fish reeled in by angler may be biggest ever caught in Tennessee. Take a look", "date": "2023-04-18T21:22:29.000Z", "content": "When Henry Dyer started reeling in his line, he couldn’t have known that his catch would make history.\nOut fishing with a friend on Cherokee Lake in eastern Tennessee on April 13, Dyer reeled in a paddlefish, and it was a monster WTVC reported.\n“When I snagged that thing, I thought I’d hung on a stump and then all of a sudden\n,” Dyer told WTVC. “The fish made five long runs. It took about 35 minutes for me to get it to the boat.”\nThe fish was\nwhere they thought it may be a new state record, according to a Facebook post from the Hawkins Farmers Co-op.\nThey were right.\nThe Tennessee Wildlife Resources Agency announced the\nin an April 18 Facebook post.\nWeighing in at 149 pounds, the 6.5-foot beast is officially the largest paddlefish ever caught in the state of Tennessee.\nAmerican paddlefish can grow to lengths of 7.2 feet and\nand are found in the Mississippi River Basin, Lake Huron and parts of southern Canada, according to the Encyclopedia Britannica.\n“It’s a big deal, at least in my mind it is,” Jason Henegar, assistant chief of fisheries for the Tennessee Wildlife Resources Agency, told ABC News Channel 9.\nThe previous record for paddlefish in Tennessee was held by Chad Collins, who caught a\nin the Cherokee Reservoir in April of last year, according to state records.\nNot only did Dyer’s fish break the record for paddlefish, it may be the largest fish ever caught and recorded in the state.\nSince records have been kept, the\nwas a 130-pound blue catfish. The fish was caught in 1976, state records show.\nThat makes Dyer’s fish even more impressive.\nDyer gave the fish to the Tennessee Wildlife Resources Agency to aid in their research, ABC News Channel 9 reported.\n“Congratulations. Fish of a lifetime,” one person commented on the Tennessee Wildlife Resources Agency post.\n“You truly can tell a huge fish story!” another said.\nIn the days since Dyer caught the fish, “you can’t wipe the smile off my face,” he told ABC News Channel 9."},
{"url": "http://news.yahoo.com//daily-show-guest-host-jordan-040117134.html", "title": "‘Daily Show’ Guest Host Jordan Klepper Gives Jim Jordan Brutal Reminder Of His Past", "date": "2023-04-19T04:01:17.000Z", "content": "“\n” guest host\nmocked Rep.\n(R-Ohio) for a much-derided House Judiciary Committee hearing in New York City that critics dismissed as little more than a\n.\nThe off-site congressional hearing to discuss crime in New York City came after a grand jury in Manhattan indicted\nbased on a criminal investigation led by District Attorney\n. Jordan, a close ally of the former president, was likely hoping for a little payback for his pal.\nJordan said Bragg’s policies “are going to ruin this great city,” a comment that surprised Klepper for two reasons.\n“One, that he admits New York is a great city. Never thought I’d hear that,” Klepper said. “And two, that he actually held a hearing on crime. I was pretty sure ignoring crime was Jim Jordan’s whole thing.”\nJordan, who was an assistant wrestling coach at Ohio State University, has been accused\nof\nagainst the team’s doctor during his time there.\nJordan has denied the athletes’ accusations.\nKlepper also pointed out another inconvenient fact for the lawmaker.\n“Considering the murder rate is much higher in Columbus, Ohio ― which is in Jim Jordan’s neck of the woods ― maybe he should’ve been holding crime hearings there,” Klepper said.\nLater in the segment, “Daily Show” correspondent Desi Lydic took a shot of her own at Jordan.\n“Jim Jordan flew all the way to New York just to talk about how scared he is of New York,” she said. “Relax, Jim. Go see that Michael Jackson Broadway show. It also ignores abuse accusations. You’d love it!”\nSee more in the Tuesday night monologue:"},
{"url": "http://news.yahoo.com//supposed-mother-auschwitz-survived-132354142.html", "title": "I Was Supposed to Follow My Mother to Auschwitz. This Is How I Survived.", "date": "2023-04-18T13:23:54.000Z", "content": "Ginger Lane was at home with her mother in their Berlin apartment in the spring of 1943 when the Gestapo arrived. She doesn’t remember now, 80 years on, why exactly she hid behind a door as the two men led her mother—a Jewish woman born in Hungary—out of their home. But she does remember climbing onto a windowsill and looking down at the street below as the men put her mother, Lina Weber, into a black car, and drove away. It was the very last time Ginger saw her alive. She was 3 years old.\nIt wasn’t until early the following year that Ginger’s family were told, in a letter from the police, that Lina was dead. “They told us, of course, that it was influenza or something like that,” Ginger tells the Daily Beast. “But the family knew that she had been murdered.” Lina was killed in\n—the extermination camp built in Nazi-occupied Poland where around 1 million Jews were murdered by the Third Reich during the\n.\nGinger, along with her six older siblings— Alfons, Senta, Ruth, Gertrude, Renee, and Judith—were also listed on a manifest to be deported to Auschwitz. “I don’t know where the document came from or how we learned, or how my father [Alexander Weber] learned that we were supposed to be on the next transport,” Ginger says. “All I do know is that Arthur Schmidt, I believe, told my father that we were scheduled to follow the next week. So he absolutely had to get us out of there.”\nArthur and his wife Paula Schmidt were Christian neighbors of Ginger’s family. “They weren’t complete strangers, but they weren’t close intimate friends,” Ginger says. Nevertheless, the couple offered to allow the seven children to hide at a fruit orchard the Schmidts owned around 40 miles away from Berlin. This act of monumental kindness and courage, which allowed the children to avoid capture until the end of the Second World War, is something which Ginger has never forgotten. “I’m constantly thinking about and reminded of the goodness of people who were all putting themselves at risk to try to help others during a very difficult time,” she says.\nNow 83, Ginger is taking part in a campaign to preserve the stories of the Holocaust this Holocaust Remembrance Day (April 18). The Conference on Jewish Material Claims Against Germany’s campaign,\n, records the experiences of people like Ginger in the hope that future generations might learn from the atrocities of the past.\nIt is only through her neighbors’ incalculable generosity that Ginger is still alive to tell her story. Looking back now, she can still recall the difficult days on the orchard in the quiet village of Worin which saved her life. “I have memories of being out on the farm being very lonely and digging in the field for potatoes and whatever fruit was available,” she says. “Always being hungry, and always being very much alone. I didn’t have anybody to play with. We had lived in a laundry shed that was on the property and were left pretty much to our own devices.”\nEven then, they were in danger. “They were hidden in plain sight,” Ginger’s daughter, Beth, tells The Daily Beast. “But there were times when the Gestapo would come to the farm and do a search. They’d have to be hidden.” The family would later learn that the village’s mayor—himself a member of the Nazi Party—and other residents knew the children’s true identity, but never turned them in.\nThe Weber children in Bremerhaven, Germany. Ginger stands on the right end of the line.\nAs the children hid, their father, Alexander, remained in Berlin. He had been raised Catholic but converted to Judaism to marry the children’s mother. But he too knew first hand the horrors of Nazi concentration camps, having spent time imprisoned in Oranienburg in Prussia as a political dissident in 1933. “He was there for 10 months before he was released,” Ginger says, “And according to my brother Alfons, he was pretty much a broken man after that time.” As the children hid, Alexander arranged for them to be baptized in the hope it would make them safer. Beth believes part of the reason the children may have survived as long as they did is because the Nazis classed them as\n—or “mixed blood”—on account of their dual parentage.\nAfter almost two years hiding in Worin, the children returned to Berlin in the back of Schmidt’s truck just two weeks before the end of the war as Soviet forces advanced on the German capital. There, Ginger witnessed the brutal street-by-street fighting that eventually led to Hitler’s downfall—and was once again saved by her neighbor, Arthur Schmidt.\n“There was an air raid and our building was bombed and we wound up… We’d hidden in the shelter in our basement,” Ginger says. “With all the rubble, we couldn’t get out. And he actually dug us out. So he saved us again. He was just this very kind man.”\nWhen the bombing stopped and Nazi Germany surrendered, the family faced an uncertain future. They moved from one displaced persons camp to the next until they were finally able to secure passage to America. But there was a catch—although their father was still alive, the kids would have to declare themselves orphans in order to be given refuge in the U.S. Ginger says she wasn’t concerned at the time about the prospect of leaving Germany without her father. “Don’t worry,” Ginger says he told her, “I’m coming in two weeks.” The children arrived in New York aboard the SS Marine Flasher in May, 1946. Alexander would not reach America for another ten years.\nAs the only known example of seven Jewish siblings to have survived the holocaust and emigrated to America together, the Weber children were the subject of immediate attention from the press upon their arrival. But the remarkable size of their family posed a problem: they would have to split up. “Because what foster parents were going to be able to take in seven children?” Ginger says.\nGinger (front right) with her siblings after their arrival in New York Harbor on May 21, 1946. This image is displayed in the United States Holocaust Memorial Museum.\nEach of the siblings were sent to different Jewish foster families in Chicago, where Ginger still lives today. It was then that Ginger, who was born Bela Weber, took her new name. She was ultimately adopted by a neurosurgeon and his wife, who had been a singer. As well as being with a new family, Ginger also lost contact with her biological siblings. “It doesn’t happen today,” Ginger says, “But at that time the thinking was that this would be best for all the children—to separate them to move forward with their lives.”\nAs the years passed, Ginger only had fleeting contact with her members of her birth family. Once, while out to dinner with her adoptive family in Chicago, she walked by another family on the sidewalk. “As we passed each other on the street, I turned back to look at the man at the same time that he turned back to look at me,” Ginger says. “There was some sort of instant recognition, although we did not speak. It was my father and his new family.” She never reconnected with her biological father.\nAfter suffering a spinal cord injury while skiing in the 1980s, Ginger was spurred to get in touch with her siblings. Forty years after arriving together in New York, the Weber children were together again in 1986. “One by one, I reconnected with everybody, and then we had a big family reunion,” Ginger said. “And all of my children and my husband of course were involved. And so it’s moved forward since then. We’ve always had contact since then.” One of her sisters told Ginger: “You’ve come out of the wilderness, just like Moses.”\nAnother milestone came in 2017 when Ginger and her family traveled to Germany. It was the first time Ginger revisited the orchard. Mere weeks after arriving back in the U.S., she was horrified to watch on TV as white supremacists marched through Charlottesville carrying torches, chanting “Jews will not replace us.” The experience of revisiting the place where she hid during the Holocaust coupled with open antisemitism in the country she calls home motivated her to start sharing her story. “I felt a deep connection for having to speak out, and to acknowledge that this happened to me, not just to Jews out there,” Ginger says. “That I was part of that generation.”\nThe experience also left a lasting impression on Ginger’s daughter Beth, an actress, who vowed during the trip to Germany that she would record her ancestors’ story. She’s made her directorial debut with a film,\n, which chronicles her family’s tale of survival. The movie, which is yet to be released, will be the first project of a new non-profit, The Weber Family Arts Foundation, which will “promote stories of hope in service of combating antisemitism, bigotry and hate.” “I think that what we have to do is be upstanders and not bystanders,” Beth, now based in California, says. “And not just regarding Judaism, but anybody who is being persecuted. Any kind of genocide.” She adds: “I just don’t understand how Ukraine can be happening today.”\nIt will not be long before the Holocaust passes from living memory. “If we don’t tell these stories, we’re dying,” Ginger says. “Our generation is dying. And if not now, when?”"},
{"url": "http://news.yahoo.com//georgia-teen-not-tortured-during-001812056.html", "title": "Georgia teen 'was not tortured' during the house party that left him on a ventilator, DA says, adding that the teen 'voluntarily' drank until he blacked out", "date": "2023-04-18T00:18:12.000Z", "content": "On March 21, 19-year-old Trent Lehrkamp was left unresponsive at a hospital after a party.\nInitial reports said the teen was tortured, but a police investigation found that's not the case.\nFive people were charged on Monday with misdemeanors related to the night of the incident.\nFive people were arrested Monday in connection to a drunken party that left a Georgia teenager on a ventilator and suffering from \"trauma, PTSD, and grief\" — but the district attorney who charged the group stressed that\nwere not accurate.\nFollowing a drunken party on the night of March 21, an unresponsive Trent Lehrkamp was dumped at a hospital with a blood-alcohol content of .46, covered in spray paint, and smelling of urine,\n. He spent several weeks on a ventilator and the FBI joined local law enforcement in investigating the incident,\nBut \"he was not tortured,\" The Post reported Glynn County, Georgia, District Attorney Keith Higgins told reporters on Monday announcing charges against two adults and three teenagers related to the party. \"On March 21…Trent voluntarily drank alcohol until he blacked out. No one poured alcohol down his throat or forced him to drink. No one pushed a funnel down his throat.\"\n, and local news outlet\nreported photos and video taken during the party, and a previous party several days prior — including video of him being sprayed with a hose while sitting in a white lawn chair — indicated a pattern of abusive behavior.\nA\nset up by Erika Keller, a friend of Lehrkamp's, alleged in the initial fundraising request that the perpetrators of Lehrkamp's assault \"were not friends, but vile and abusive perpetrators who would go on to torture, humiliate, and assault him in inhumane, terrifying ways for hours.\"\nBut, when announcing the misdemeanor charges related to the incident, Higgins said Lehrkamp \"consented to being washed off with a hose\" and was likely saved by the actions taken by the teens present that night, The Post reported.\nHiggins added that misinformation about the incident, circulated through social media, contributed to the delay in pressing any charges related to that night,\nreported.\nIn a statement emailed to Insider, Glynn County Police Department officials indicated the investigation will remain ongoing \"until all leads have been exhausted.\"\nRepresentatives for Higgins did not immediately respond to Insider's requests for comment.\nRooker Hobby and two unnamed juveniles face charges related to that night, though not for their actions toward Lehrkamp. Hobby, a 17-year-old, was charged with battery for actions unrelated to Lehrkamp against a different victim, The Post reported.\nOne of the younger teens was charged with simple battery and trespassing, while the other faces charges of possession and use of drug-related objects,\nreported. Carlton and Lauren Strother were charged with maintaining a disorderly house and contributing to the delinquency of a minor, according to the outlet.\n\"Rooker Hobby and the juveniles that accompanied him just didn't drop him off at the outside,\" Higgins said, per The Post. \"They went inside, got medical personnel to come outside and take him in so that he could get the medical care that he needed. They then left their correct names and telephone numbers before leaving.\"\nIn a statement posted to the\npage on Sunday, prior to the charges being announced, Lehrkamp — who\nis receiving out-of-state mental and physical health care — said, \"I know that I'm not a cat with nine lives. I look at it like baseball, three strikes and you're out. I want to be alive. I want to be with my family,\" adding that he's \"on a track that deals with trauma, PTSD, and grief.\"\n\"I want to get well,\" Lehrkamp wrote. \"I want y'all to be proud of me.\"\nSince the fundraiser was posted, Keller has raised $133,000 with Lehrkamp listed as a beneficiary. Keller and Lehrkamp did not immediately respond to Insider's request for comment.\nRead the original article on"},
{"url": "http://news.yahoo.com//top-us-senate-republican-backs-193244567.html", "title": "Top US Senate Republican backs U.S. Supreme Court chief amid calls for Thomas probe", "date": "2023-04-18T19:32:44.000Z", "content": "By Katharine Jackson\nWASHINGTON (Reuters) - U.S. Senate Republican Leader Mitch McConnell on Tuesday expressed support for the Supreme Court's chief justice as Democrats urge him to investigate luxury trips taken by Justice Clarence Thomas that were paid for by a Republican donor.\n“I have total confidence in the Chief Justice of the United States to deal with these court internal issues,” McConnell told reporters.\nSenate Judiciary Committee Democrats, in a letter sent to Chief Justice John Roberts on April 10, said Thomas' conduct violated ethical standards.\nThe committee plans to hold a hearing on the matter but a date has not yet been announced.\nProPublica reported on April 6 that Thomas accepted expensive trips from Republican donor and real estate magnate Harlan Crow over decades without disclosing them.\nThomas defended the trips, saying he had been advised he was not required to report that type of \"personal hospitality.\" But the conservative justice said he would abide by new, tighter rules that recently took effect.\n(Reporting by Katharine Jackson and Moira Warburton in Washington; Editing by Chizu Nomiyama and Cynthia Osterman)"},
{"url": "http://news.yahoo.com//mexico-nabs-swiftly-deports-ms-215513802.html", "title": "Mexico nabs, swiftly deports MS-13 gang leader to El Salvador", "date": "2023-04-18T21:55:13.000Z", "content": "SAN SALVADOR (Reuters) - Police in Mexico City arrested one of the most wanted leaders of the notorious Mara Salvatrucha gang accused of multiple crimes in the United States, officials said on Tuesday, in a fresh blow to one of Central America's most violent criminal groups.\nJose Wilfredo Ayala, 55, was arrested after a tip from a neighbor, according to the Mexican capital's security ministry. The ministry said it had discovered Ayala - believed to be second-in-command of the gang commonly known as MS-13 - was using a false identity and hiding in Mexico City and in two areas a short drive north in Hidalgo state.\nAn official with Mexico's national immigration institute INM told Reuters later on Tuesday that Ayala had already been deported to his native El Salvador, but did not provide further detail.\nSurveillance video showed Ayala, also known by his alias \"Indio\" or \"El Indio de Hollywood,\" was likely sheltering in a building in the Mexican capital's Buenavista neighborhood.\nAyala is \"under investigation for homicide charges and is tied to other crimes like aggravated robbery, using false documents, possessing weapons of war, public disorder, and others committed in the United States,\" the ministry said in a statement.\nA warrant for Ayala's arrest in the U.S. state of Texas citing federal charges is outstanding, officials added.\nIn an indictment against more than a dozen of MS-13's \"highest-ranking\" leaders, made public on Feb. 23 by federal prosecutors in New York, Ayala was listed as one of four fugitive leaders. Six others are believed to be in custody of Salvadoran authorities.\nEl Salvador's justice and security ministry did not immediately respond to a request for comment on Ayala's capture.\n(Reporting by Nelson Renteria in San Salvador; Additional reporting by Lizbeth Diaz in Mexico City; Writing by Brendan O'Boyle; Editing by David Alire Garcia and Lincoln Feast)"},
{"url": "http://news.yahoo.com//donald-trump-throws-hissy-fit-082813034.html", "title": "Donald Trump Throws Hissy Fit Over Elon Musk Revelation", "date": "2023-04-19T08:28:13.000Z", "content": "Donald Trump raged after Elon Musk revealed he voted for President Joe Biden in the 2020 election.\nThe former president claimed Twitter’s billionaire owner told him he’d voted for him, then petulantly said he actually “didn’t care” either way.\n“I didn’t vote for Donald Trump,” Musk told Fox News personality Tucker Carlson in an interview that aired Monday. “I actually voted for Biden. I’m not saying I’m a huge fan of Biden, since that would probably be inaccurate. But, you know, we have difficult choices to make in these presidential elections.”\nMusk said he’d prefer “just a normal person as president, a normal person with common sense and whose values are smack in the middle of the country.”\nElon Musk tells Tucker about Trump being allowed on Twitter.\nElon also says who he voted for in 2020.\n— Red Voice Media (@redvoicenews)\nTrump appeared displeased.\n“I don’t believe Elon Musk voted for Biden, not for a minute!” he wrote on his Truth Social platform. “He told me that he voted for me, but who knows about that, and who cares?”\n“Elon is just trying to make friends with the absolutely horrible Biden Administration because of all the government subsidies he gets, and all the permits he needs,” Trump raged."},
{"url": "http://news.yahoo.com//mother-nyc-murder-victim-shouts-170125632.html", "title": "Mother of NYC murder victim shouts down Democrat lawmaker: 'Don't insult my intelligence'", "date": "2023-04-17T17:01:25.000Z", "content": "The mother of a New York City murder victim shouted down Democratic congressman and former Trump impeachment counsel Rep. Dan Goldman during a House Judiciary Committee field hearing on violent crime in Manhattan."},
{"url": "http://news.yahoo.com//verbal-slip-russias-vladimir-putin-161420674.html", "title": "A verbal slip by Russia's Vladimir Putin on a rare visit to occupied Ukraine suggested the trip happened days earlier and was kept secret", "date": "2023-04-18T16:14:20.000Z", "content": "Russian President Vladimir Putin made a rare visit to occupied Ukraine.\nThe Kremlin said Putin visited on April 17, but video footage seemed to refute that.\nPutin is seen saying Orthodox Easter, held on April 16, was \"coming up,\" suggesting the visit was earlier.\nVladimir Putin made a rare visit to occupied Ukraine, but a verbal slip by the Russian president casts doubt on when the trip actually took place.\non Tuesday that Putin visited a military headquarters in Russian-occupied Ukraine, amid Russia's ongoing invasion of the country.\nKremlin spokesman Dmitry Peskov told reporters that the visit took place on Monday, April 17,\n.\nBut a comment made by Putin in footage released by the Kremlin hinted that it was likely filmed days earlier.\nthat the Kremlin initially released footage in which Putin says that Easter is \"coming up,\" but then edited the video to remove Putin saying those words.\nRussian Orthodox Easter was on April 16.\nThe trip was Putin's second recorded visit to Ukraine since Russia invaded the country in February 2022. He previously\nthe Russian-occupied city of Mariupol and Crimea region in March.\nPutin's more secretive movements contrast with those of Ukrainian President Volodymyr Zelenskyy, who has made multiple trips to the front line since the invasions started.\nThe Kremlin said Putin visited a military headquarters in the Kherson region and a national guard headquarters in the Luhansk region. Both regions are partially occupied by Russia.\nIt also said that Putin attended a military command meeting and heard reports about what was happening in the Kherson and Zaporizhzhia regions, which Russia has annexed.\nThe Kremlin pushed back on suggestions the footage had been taken earlier, with Peskov saying on Tuesday that Putin's mention of Easter had been misinterpreted.\n\"The fact is that our Easter lasts 40 days, we continue celebrating it, now we have Easter week,\" he said, according to TASS. \"That's why it is erroneous to pay attention to that phrase and make hypotheses about something that was never real. The trip took place yesterday.\"\nRead the original article on"},
{"url": "http://news.yahoo.com//neighbor-man-wrong-turn-shooting-223614521.html", "title": "Neighbor: Man in wrong-turn shooting disliked trespassers", "date": "2023-04-18T22:36:14.000Z", "content": "When Kaylin Gillis and her friends took a wrong turn into an upstate New York driveway last weekend, they couldn't have known the property was owned by a man who, according to a neighbor, had grown increasingly bitter over the years at people driving onto his land by mistake.\nThis time, the error proved fatal. The Hebron landowner, Kevin Monahan,\n, killing 20-year-old Gillis as she and her friends drove away after turning around in the long dirt driveway, Washington County Sheriff Jeffrey Murphy said.\nMonahan, 65, was arrested on a second-degree murder charge and remains detained pending a bond hearing.\nOne of his neighbors, Adam Matthews, who runs an auto repair shop in nearby Salem, said Monahan had become more and more upset in recent years at people making wrong turns into his driveway.\n“I'm just a bit overwhelmed,” Matthews said in a phone interview with The Associated Press on Tuesday after speaking to other news outlets. \"It is a tragic event.”\nMurphy said Gillis and her friends got lost while going to another friend's nearby house. They were driving two cars and a motorcycle when they turned into Monahan's driveway. As they realized the mistake and turned around, Monahan fired two gunshots at them as they drove away, Murphy said.\nOne of the bullets struck the rear of the car Gillis was in and hit her, causing a fatal injury, Murphy said.\nGillis' father, Andrew Gillis, said in a Facebook post Tuesday that his family is devastated.\n“Kaylin was a kind, beautiful soul and a ray of light to anyone who was lucky enough to know her,” the post said. \"She was just beginning to find her way in the world with kindness, humor, and love. ... She was taken from us far too soon.\"\nAndrew Gillis wrote that his daughter was an honors student and talented artist who was looking forward to attending college in Florida with dreams of becoming a marine biologist.\n“Our family will never be the same but we will be guided by Kaylin’s positivity, optimism, and joy as we learn to live with her loss,” he wrote.\nMonahan's lawyer, meanwhile, spoke publicly for the first time Tuesday, calling the sheriff's version of the events a “superficial, simplistic” account of what actually happened.\nThe attorney, Kurt Mausert, declined to discuss details of the shooting, citing the pending criminal case.\n“I believe we have series of mistakes that led to a tragedy,\" he said in a phone interview. \"But I don’t believe my client is a villain. But not every case with a tragedy has a villain, and I think this is one of them.”\nThe sheriff described Monahan as uncooperative, saying he initially refused to come out of the house before peacefully surrendering after about an hour.\nMausert disputed there was any standoff, saying he was on the phone with his client as law enforcement officers were at Monahan's door. He said Monahan was talking to police outside his door and officials would not say why they were there and did not have an arrest warrant. The lawyer said Monahan was exercising his right to remain silent when he declined to talk to police about what happened.\nWhen police officials told the lawyer over the phone that someone had died, Mausert said he helped arrange the peaceful surrender.\n“They told me there was a fatality, then it started to make sense to me,” he said. “At that point, it’s dangerous for everybody. My goal at that point was to facilitate my client turning himself in to the police safely.”\nAs Gillis' family mourned Tuesday, officials at the school system she attended held a news conference to express their sadness about her death. Gillis graduated in 2021 from Schuylerville High School, about 20 miles (32 kilometers) from Monahan's home in Hebron. Her two younger sisters are in grades seven and nine in Schuylerville.\n“We have very very close-knit community,” said Katie Elsworth, the middle school principal. “And we say to them upon graduation that we will always be your school family. We will always be here to support you and take care of you and love you. And when something happens to one of students who graduated, it hurts our hearts just as much as when they’re here.”\nSchuylerville High School Principal James Ducharme said Gillis had an infectious smile.\n“Her smile would light up a room,” he said. “Her personality would light up any classroom that she walked into or any club activity that she participated in.”\nSchool officials said Gillis was on the competition cheerleading team in high school for two seasons, took part in Future Farmers of America programs and was an avid artist.\nA celebration of Gillis' life was scheduled for Friday in Schuylerville."},
{"url": "http://news.yahoo.com//student-2-published-books-4-182005756.html", "title": "Student with 2 published books, 4.2 GPA and 1560 SAT score rejected by Harvard, MIT, Yale and Princeton", "date": "2023-04-17T18:20:05.000Z", "content": "[\n]\nbestselling author of two math books that sold 10,000 copies and generated $300,000 in revenue. It is important to note that Limmy mistakenly identifies the student as a New York Times bestselling author themselves, when in fact the email specifies that his books were endorsed by two New York Times bestselling authors.\nAccording to his website, Alsamraee is currently a student at Stanford University. He was featured on the Arab America Foundation's 20 under 20 in 2020 and is the author of the Amazon bestseller \"Advanced Calculus Explored: With Applications in Physics, Chemistry, and Beyond.\"\nA 2019 study published in the National Bureau of Economic Research found that\nadmitted to Harvard University were recruited athletes, legacy students, children of faculty and staff or on the dean’s interest list. The list was revealed to be composed of applicants “whose parents or relatives have donated to Harvard.”"},
{"url": "http://news.yahoo.com//employees-blindsided-fast-food-chain-175000731.html", "title": "Employees blindsided as fast-food chain suddenly closes all its Wichita-area restaurants", "date": "2023-04-18T17:50:00.000Z", "content": "A manager at the\nat 2101 N. Rock Road in Derby said that employees were blindsided when the restaurant suddenly closed on Monday.\nSamantha Blair, a shift manager who has worked at the restaurant since October, said she got a call before her shift on Monday informing her she didn’t need to come in. She went in at 9 a.m. today and was told that the store was closed permanently along with all the restaurants in Wichita.\nShe’s still not sure why.\n“They didn’t tell us much,” she said, adding that her store had 27 employees.\nThe\nplus three in Wichita — at 1320 N. Tyler Road, 2053 N. Amidon and 3216 E. Harry — are all owned by\n, a Denver-based company that has 270 franchised restaurants in 16 states. Besides Carl’s Jr and Hardee’s, it also owns Taco Bell, Dunkin’ and Pizza Hut Express franchises.\nNo one from Capstone Restaurant Group immediately returned calls or emails on Tuesday morning.\nWichita had been a Hardee’s-free zone for 20 years when, in January 2016, the\n, starting with the restaurant at 21st and Amidon. That restaurant was followed by the Hardee’s at Harry and Hillside, which opened in February 2017, and the one at 13th and Tyler, which opened in August 2018.\nThe group owns a Topeka Hardee’s at 2300 N. Topeka Blvd. that also abruptly closed on Monday, Topeka media reported, although the city’s two other Hardee’s are still operating.\nCapstone also appears to have operated the Hardee’s and Dunkin’ restaurants at three of Kansas Turnpike service stations — Topeka, Matfield Green and Towanda. All Hardee’s and Dunkin’ restaurants at those stations are closing and being replaced with other fast-food options,\n.\nSomeone identifying himself as a local Hardee’s manager\non Monday that he got a call from his general manager saying all stores were closing immediately and that all employees were out of jobs.\n“Nobody was given a reason why,” the poster wrote. “...We were open all this morning and closed around 2 p.m. today to never open again. There was no warning or notice to anyone at all. 100+ people are out of jobs.”\nBlair said she was preparing to move away from Wichita in a couple of months anyway, but now she has to look for a job to tide her over until she goes.\n“I have a toddler I need to support,” she said."},
{"url": "http://news.yahoo.com//ukrainian-drone-commander-said-russian-084843014.html", "title": "A Ukrainian drone commander said Russian troops would sit around and get shot at the start of the war, but have learned from their mistakes", "date": "2023-04-19T08:48:43.000Z", "content": "Russian troops often made themselves easy targets at the war's start, a Ukrainian soldier said.\nThey would fail to take cover and linger in their positions,\nBut Moscow's forces now move more often and appear to have learned from their mistakes, he added.\nThe leader of a Ukrainian drone unit said Russian troops made themselves easy targets at the start of the war but have since learned from their mistakes.\nThe Russians often failed to take cover in the invasion's early stages and wouldn't budge from their positions, said the Ukrainian corporal, known only as Petro. He spoke to Stefan Weichert, a freelance journalist reporting last month near the frontline for\n.\nBut Petro told Weichert he noticed Russian forces — tanks in particular — moving more often as the war continued.\n\"They adapt. They are starting to think about how to fight better. They learn from their problems and mistakes,\" said the corporal, whose primary role is to spot Russian artillery or tanks.\nThe early months of the war revealed\n, Western observers have said. Between February and July 2022, Russia lacked competent junior leaders on the ground who could command their units effectively, the\n. Their combat formations and targeting systems meant Russian troops were often vulnerable to friendly fire, the think tank added.\nBetween 60,000 to 80,000 Russian soldiers were killed or wounded in the war's first months,\n.\nRussia also\n, the Pentagon said in November.\nAs Moscow's losses mounted, the Kremlin began sending\nOne US official in January noted that Russia\n.\nNow, Ukrainian troops on the frontline say they're\nWeichert reported. Petro's unit spotted an anti-tank gun, but the responding Ukrainian artillery unit only fired one shot when six are usually needed to dispatch a target, Weichert wrote.\n\"Our biggest problem is that we are running out of artillery shells,\" a sergeant named Oleg told Weichert.\nNATO Secretary General Jens Stoltenberg\nthat Ukraine was expending its ammunition \"many times higher\" than the West's rate of production.\n\"The war in Ukraine is consuming an enormous amount of ammunition and depleting allied stockpiles,\" he said.\nThe European Union said in March that it would deliver one million rounds of ammo to Ukraine over the next year, while the Biden administration has promised\n.\nRead the original article on"},
{"url": "http://news.yahoo.com//no-charges-police-killing-pallbearer-181225814.html", "title": "No charges in police killing of pallbearer at dad's funeral", "date": "2023-04-18T18:12:25.000Z", "content": "CHARLESTON, W.Va. (AP) — Charges won't be brought against members of a West Virginia task force who fatally shot a pallbearer at his father’s funeral after an investigation found the fugitive was reaching for a concealed weapon, a special prosecutor said Tuesday.\nGrant County Prosecutor John Ours said in a telephone interview that he reviewed the State Police investigation into the shooting of Jason Arnie Owens and determined that “it was justified.” He found no probable cause to charge the officers.\nThe shooting happened as mourners\nin the Harrison County community of Nutter Fort on Aug. 24, 2022. Owens had helped to carry his father’s casket to a hearse, and then turned to embrace a relative, according to witnesses previously interviewed by The Associated Press.\nTwo officers with a fugitive warrant then sought to arrest Owens on a parole violation, calling his name and shooting him dead. Owens' blood spattered his 18-year-old son’s shirt with blood as horrified loved ones looked on.\nThe State Police investigation determined Owens had a holster with a 9mm pistol under his shirt, refuting previous witness statements that Owens was unarmed. The two officers said Owens reached for his weapon, although some witnesses said otherwise, the report noted.\n“The involved officers acted appropriately and were involved in no wrongdoing or criminal actions,” State Police Sgt. C.D. Whetzel, the lead investigator, said in the report.\nWhetzel said he attended Owens’ autopsy at the state medical examiner’s office and observed the brown leather holster still fastened to Owens’ belt on his right side. There also were 9mm bullets in his pockets. Owens, 37, had several illegal drugs in his system, including methamphetamine, fentanyl and norfentanyl, and a bag containing methamphetamine was removed from his pocket, according to the report.\nBridgeport Police Detective Cameron Golden, who was a member of a local drug and violent crimes task force, said the owner of the funeral home confirmed that Owens had been inside the facility at his father’s service. Owens helped set the casket into the hearse and moved away when Golden said he and Harrison County Sheriff’s Sgt. Corey Heater announced themselves as police and told Owens not to move.\nGolden said he grabbed Owens’ left hand and started to get his handcuffs when he heard Heater yell ”‘He’s reaching,’ and at that point Owens started to turn toward me. I saw his right hand pulling the right side of his shirt up from his hip, and I saw his right-hand wrap around the handle of a black pistol, which was concealed in his waistband, as he was pulling it.”\nAs Golden tried to step away, Heater shot Owens while Golden pulled his service weapon and fired as well.\n“I firmly believe if Sgt. Heater had not been with me at that time to alert me, Owens would have pulled (the) pistol and killed me,” Golden said in the report.\nState Police crime scene specialist Michael Kief said in an incident report that as the two officers tried to apprehend Owens, the “suspect moved toward a firearm located on his right side” before he was shot.\nOther witnesses described what happened differently.\nWitness Josh Owens, whose relation to Jason Owens wasn’t disclosed in the report, said in his statement to police that Owens “never made an attempt to flee, fight, or any sudden movements. On the right side of him, his shirt moved and you could see a gun. It was in a brown looking holster. His right hand never grabbed the gun. The gun never came out of the holster.”\nAnd a statement from Owens’ son Justin said his father had a weapon in a holster but had placed his hands behind his back and was “giving up,” according to the report.\nOwens, who was white, was released on parole in April 2021 after serving a sentence for fleeing a Harrison County sheriff’s deputy and trying to strangle him during a scuffle. Owens' cousin, Mandy Swiger, said after the funeral home shooting that Owens committed a parole violation “for not checking in just once. And that’s why he promised his mom after the funeral he would turn himself in.”\nBut Whetzel wrote that Owens had made statements to others that he “would put up a fight to prevent his incarceration.” According to a warrant obtained by Whetzel to search Owens' Facebook account, Owens had made threats toward others on social media. Whetzel said one such Facebook post indicated that Owens “would leave this world 'covered in someone else’s blood.'”\nAnd Brad Vincent, who worked with Owens at a meat market and was a pallbearer at the funeral, said in a statement to police a week after the shooting that Owens had been carrying firearms and had indicated he “wouldn’t be taken without a fight.”\nAs part of their initial response coordinated by the U.S. Marshals Service, some officers parked between the funeral home and Owens' SUV to prevent Owens from getting to his vehicle, where a revolver and a rifle were later confiscated along with multiple rounds of ammunition and drug paraphernalia, the report said.\nAmong the items redacted from the report were a photograph and a sheriff's deputy's body-cam video showing Owens on the ground."},
{"url": "http://news.yahoo.com//finance/news/going-ugly-ceo-just-issued-103500109.html", "title": "'It's going to be ugly': This CEO just issued a dire warning about US real estate, says areas will be 'destroyed' — but he still likes this 1 niche. What it is and how to invest", "date": "2023-04-19T10:35:00.000Z", "content": "The commercial real estate market is tumbling toward a crash that could be as devastating as the 2008-09 crisis, according to the CEO of a real estate investment firm.\nPatrick Carroll, founder and CEO of CARROLL, sounded the alarm about the state of the U.S. commercial real estate market in an interview with CNBC.\n“The party’s over, unfortunately,” he said. “The office market’s going to be destroyed, hotels are going to be destroyed — it’s going to be ugly.”\n(and collect fat grocery store-anchored income on a quarterly basis)\nUBS says 61% of millionaire collectors allocate up to 30% of their overall portfolio to\nOwning real estate for passive income is one of the biggest myths in investing — answer these\nCarroll is not the first — and certainly won’t be the last — to ring the warning bell for the commercial real estate sector.\nSince the\nin March, experts have raised concerns about the mega $1.5 trillion wall of debt looming for U.S. commercial properties.\nThat mortgage debt — which is held mostly by small and medium-sized banks — comes due for repayment before the end of 2025.\n“No lender is willing to lend because they don’t know where interest rates are going,” Carroll told CNBC.\nCarroll said offices are experiencing “a double whammy” of misery and he described the sector’s fundamentals as “terrible.”\n“After COVID, people worked from home. The work week is now Tuesday to Thursday — so, people are taking less office space, no one wants to lend on it … it’s a disaster,” he said.\nAccording to Carroll, there is one real estate niche that is riding out this wave: multi-family real estate.\nIn contrast to commercial real estate, the multi-family market has “strong fundamentals,” according to Carroll, whose real estate investment firm manages more than 33,000 multi-family units across nine states.\n“I spoke to the biggest landlord in the world yesterday and what he’s telling everybody is: ‘Stay alive ‘til ‘25.’ Right now, our fundamentals are great, people are paying rents [and] the market is healthy,” he said.\nBecause of sky-high property prices and mortgage rates, renting has become the only option for a lot of Americans.\n“This has all kind of been a perfect storm for the multi-family business,” Carroll said in a summer 2022 interview with Fox Business.\nIf you’re keen to invest in multi-family real estate, here are two ways to get involved.\nInvesting in a residential real estate investment trust is a way to\nwithout having to buy an actual property and manage tenants.\nthat own income-producing real estate like apartment buildings, shopping centers and office towers. They collect rent from tenants and pass that rent to shareholders in the form of regular dividend payments.\nHere are two multi-family REITs you may want to check out.\nCamden Property Trust (NYSE: CPT) owns, manages, develops and acquires multifamily apartment communities. As of March 31, it owned and operated 172 properties containing 58,702 apartment homes across the U.S.\nWith a market cap of $16 billion, Camden has a diverse portfolio of assets with a focus on high-growth markets (in terms of employment, population and migration). Another residential REIT worth considering is Mid-America Apartment Communities (NYSE:MAA), which has built its portfolio around the high-growth sunbelt regions of the U.S.\nMAA has ownership interest in 101,986 apartment homes, including those in communities under development, across 16 states and the District of Columbia.\nPrime commercial real estate has outperformed the S&P 500 over a 25-year period — and until recently, only the ultra-rich with millions to invest were able to get in on that action.\nBut new online investing platforms have\nto regular retail investors.\nMany platforms use a crowdsourcing model where you can join thousands of members with similar interests — in this case, in multi-family real estate — seeking to boost returns and generate passive income.\nWith these easy-to-use platforms — which are often backed by a team of experts who can help you build your ideal portfolio — you can\ninvested in diversified real estate portfolios that will maximize your returns while keeping your fees low.\nIf you’re keen to invest in commercial real estate, you can find options that best suit your needs by\nwith Moneywise's investment-finder tool.\nYour cash is trash:\n(without being a stock market genius)\nWhat do Ashton Kutcher and a Nobel Prize-winning economist have in common? An\nChad ‘Ochocinco’ saved 83% of his NFL salary by buying fake jewelry and sleeping in the stadium — here are"}
]