[
{"url": "http://www.straitstimes.com/asia/se-asia/malaysian-police-arrest-dive-instructor-accused-of-molesting-chinese-tourist-in-sabah-resort", "title": "Malaysian police arrest dive instructor accused of molesting Chinese tourist in Sabah", "date": "2023-05-10T12:14:00+08:00", "content": "KOTA KINABALU – Police in Malaysia have arrested a 27-year-old diving instructor for allegedly molesting a tourist from China.\nThe 24-year-old tourist accused the diving instructor of molesting her as they were diving in waters off Semporna in Sabah at around 1pm on Friday, Assistant Superintendent Arif Abdul Razak said in a report.\nThe suspect was doing freelance work in Semporna, according to the police.\nThe incident surfaced when photos of the tourist and the diver appeared on Facebook.\nIn two photos, the diver is seen removing his regulator from his mouth and kissing the tourist on the cheek.\nASP Arif said in a statement on Monday that the victim lodged a complaint with the Semporna police before flying back to China.\nPolice are investigating the case under Section 354 of the Penal Code “for using criminal force to outrage the modesty of the woman”, he said.\nHe added that the suspect had been remanded until Thursday.\nMs Christina Liew, tourism, culture and environment minister of Sabah, told the South China Morning Post on Monday that the incident dented the image of Sabah’s tourism industry just as it was beginning to recover from the Covid-19 pandemic.\n“Incidents like this greatly affect the image of tourism in the Semporna district in particular and Sabah in general, even more so as the tourism industry is recovering from the Covid-19 pandemic,” she said.\nMs Liew described the incident as “regrettable” and said she wanted all tourism players to be responsible in protecting the image of the industry.\n“I call on all travel agents in this state to play a role in providing quality service,” she said. “They must be responsible to ensure incidents like this will not happen again.” THE STAR/ASIA NEWS NETWOR"},
{"url": "http://www.straitstimes.com/asia/se-asia/malaysia-edition-rare-earths-miner-lynas-gets-extension-mahathir-sues-anwar", "title": "Malaysia Edition: Rare earths miner Lynas gets extension | Mahathir sues Anwar", "date": "2023-05-10T12:48:28+08:00", "content": "Follow\ncoverage as we continue to bring you the latest developments. And thank you for reading\nRare earths are crucial to high-technology applications such as smartphones, electric vehicles and military assets.\nThe sacking was to ensure the ministry can function in a smooth and proper manner, says minister.\nHaze is likely to return from June to September, with the country facing drier conditions and less rainfall.\nExperts are advising the public to avoid crowded places.\nDr Mahathir said Mr Anwar’s claims have marred his image as a statesman and former PM"},
{"url": "http://www.straitstimes.com/singapore/morning-briefing-top-stories-from-the-straits-times-on-may-10-2023", "title": "Morning Briefing: Top stories from The Straits Times on May 10, 2023", "date": "2023-05-10T07:52:26+08:00", "content": "You are reading the Morning Briefing newsletter. Get the news that prepares you for the day ahead, delivered to your inbox.\nThe prediction by some dealers comes after LTA announced a one-time redistribution of car COEs.\nThe Housing Board has announced changes to how it will disburse grants to those looking to buy flats.\nThe former US president will appeal, said his spokesman.\nVictims of family violence may get more help if proposed amendments are passed under the Women’s Charter (Family Violence and Other Matters) (Amendment) Bill. Here are other takeaways from Tuesday's Parliament session.\nAn 18-year-old patient from UAE will become the first patient in Singapore to receive the state-of-the-art proton beam therapy.\nKho Bin Kai, 32, was sentenced to two years and 10 months’ jail and a fine of $40,000.\nThis will take some pressure off the need to raise taxes on personal income, corporate income and goods and services for higher government expenditure, says the writer.\nThe Straits Times Picture Desk takes a visual look at Singapore’s love affair with mobile phones.\nThe Myanmar crisis, rising geopolitical tensions and internal disenchantment require a firmer response if Asean wants to secure its long-term relevance, writes Marty Natalegawa, former Indonesia foreign minister.\nHe popped the question just hours after finishing the men's triathlon in Cambodia"},
{"url": "http://www.straitstimes.com/singapore/courts-crime/jail-for-tycoon-peter-lim-s-former-son-in-law-for-offences-linked-to-illegal-gambling-activities", "title": "Jail for tycoon Peter Lim’s former son-in-law for offences linked to illegal gambling activities", "date": "2023-05-09T19:15:00+08:00", "content": "SINGAPORE - Billionaire Peter Lim’s former son-in-law, Kho Bin Kai, will be spending time behind bars after he pleaded guilty to multiple offences including those involving a syndicate linked to illegal gambling activities.\nKho, 32, was sentenced to two years and 10 months’ jail and a fine of $40,000 on Tuesday. He had earlier pleaded guilty to three charges under the Remote Gambling Act and two counts of dealing with the benefits of criminal conduct.\nHe was married to Mr Lim’s daughter, local socialite Kim Lim, for three years before\nHe was her first husband.\nKho, a Singaporean, was linked to multiple illegal gambling websites, earning an average of between $30,000 and $40,000 a month over one of them alone.\nHe later used $32,000 of his ill-gotten gains to pay for an Audemars Piguet watch. He also used $5,000 of the benefits of his criminal conduct to make a partial payment for a Rolex watch worth $21,000.\nHis lawyers said that among his offences, he had managed remote gambling on two websites, and had also assisted in the conduct of remote gambling on a third platform.\nAssistant Public Prosecutor Lydia Goh told the court that Kho started being involved in illegal gambling in 2012 when he became an agent for unlawful soccer betting, earning between $2,000 and $5,000 a month.\nIn mid-2016, he was introduced to a Malaysian man known only as “Ah Leong”. Kho then agreed to join Ah Leong in the latter’s 4-D and Toto business.\nKho stopped being an agent for soccer betting in early 2017. He then became a “master agent” for an illegal gambling website in April that year, earning between $30,000 and $40,000 a month on average. But there were months when he earned less than $30,000 or earned nothing at all.\nKho was also involved in the dealings of other gambling websites and earned cash from illegal activities.\nFor instance, he earned between $3,000 and $4,000 a month over one of the websites while for another, he earned between $2,000 and $3,000 monthly.\nKho’s offences came to light when police raided his home on July 28, 2019, and arrested him.\nIt was part of an islandwide operation that led to the arrest of 35 other people involved in a syndicate that carried out unlawful remote gambling activities.\nOfficers seized from Kho items including four Rolex watches, a laptop computer and two mobile phones.\nKho was represented by lawyers Sunil Sudheesan, Joyce Khoo and Chow Ee Ning from Quahe Woo & Palmer.\nIn their mitigation plea, they said: “(Kho) has put in sincere efforts at rehabilitation and promises never to engage in remote gambling again.”\nThe lawyers also told the court that this case involved their client’s first brush with the law.\nKho’s bail was set at $50,000 on Tuesday, and he is expected to surrender himself at the State Courts on May 23"},
{"url": "http://www.straitstimes.com/singapore/politics/number-of-people-receiving-palliative-care-increased-30-since-2017", "title": "Number of people receiving community palliative care in Singapore up 30% since 2017", "date": "2023-05-09T22:13:34+08:00", "content": "SINGAPORE - The number of people receiving community palliative care in Singapore increased by 30 per cent over the past five years, with about 8,800 terminally ill people receiving such care in 2022.\nThis was announced in Parliament by Senior Parliamentary Secretary for Health Rahayu Mahzam on Tuesday, as she spoke of the Government’s efforts to enhance end-of-life care.\nShe was responding to an adjournment motion by MPs Ng Ling Ling (Ang Mo Kio GRC) and Yip Hon Weng (Yio Chu Kang).\nCommunity-based palliative care is also referred to as hospice care.\nMs Rahayu said that as Singapore’s population continues to age, more people will need palliative care.\nHence, the Republic will be expanding such services and reviewing its financing frameworks to improve access to palliative care.\nPalliative care should be entrenched as a basic skill set for all healthcare professionals across disciplines and settings, she said.\nMs Rahayu said her ministry is working with the Agency for Integrated Care and care providers to equip clinicians with the necessary skills and tools in nursing and home care.\nIn her adjournment motion on enhancing the end of life with choices and dignity, Ms Ng said that while a 2014 Lien Foundation survey found that 77 per cent of Singaporeans wanted to die at home, only 30 per cent did. The latter figure rose to 39 per cent in 2022.\nShe referred to a Straits Times report on May 1 on\nto safely transfer patients who no longer wanted intensive care and wanted to be allowed to die at home.\nCommending the medical teams at NTFGH for starting its IAmGoingHome programme in October 2022, she asked if such initiatives could be centralised across public and private hospitals, as well as hospices.\nFamily doctors could be included in line with\nallowing more people the choice to “end our walk” in the world “with dignity, peace and comfort”, Ms Ng said.\nMs Rahayu replied that the Government is working with hospitals and palliative care providers to implement workflows that would allow more patients to get a “compassionate discharge” to go home.\n“This involves, for instance, providing appropriate training and resources, and implementing handover checklists to ensure continuity of care,” she said.\nMr Yip asked how palliative care could be kept affordable, noting that healthcare costs “can be a huge burden on families, especially when dealing with end-of-life care”.\nMs Rahayu said the overall financing framework for palliative care is being reviewed to ensure that it remains affordable.\nShe added that Dover Park Hospice and Tan Tock Seng Hospital will co-pilot a single bundled funding rate starting in the second half of 2023, which will empower hospice care providers to decide whether inpatient, day or home hospice settings are most suitable for patients.\nThis may be progressively expanded should the trial prove successful, and there will be “appropriate safeguards to ensure continued quality of care”.\nNoting that caregivers of end-of-life patients often come under tremendous stress, Ms Rahayu said that as of January this year, hospitals can refer patients to a home-based respite care service, which provides the patients with palliative-trained care staff.\nThis allows caregivers to rest or tend to other matters while their loved ones are cared for.\nA three-year campaign will be launched later in 2023 to increase awareness and the adoption of tools such as the\n(LPA) and advance care planning, Ms Rahayu added.\nAn LPA allows a person to appoint someone to make key decisions for him should he lose his mental capacity, while advance care planning lets him document his medical treatment preferences in advance and designate someone to decide on medical care for him in the event that he becomes mentally incapacitated"},
{"url": "http://www.straitstimes.com/singapore/transport/car-prices-likely-to-dip-but-longer-wait-ahead-for-buyers-hoping-for-cheaper-coes-motor-traders", "title": "Car prices expected to dip with more COEs, but sharp drop unlikely soon: Motor traders", "date": "2023-05-09T21:45:00+08:00", "content": "SINGAPORE - The additional certificates of entitlement (COEs) that will be redistributed to the car categories over the next few quarters may help to bring down car prices, but consumers hoping for a larger drop in COE premiums will have to wait longer.\nSome motor traders made this prediction in response to the\nmade by the Land Transport Authority (LTA) to the two car COE categories that was announced on Monday.\nAlready a subscriber?\nGet exclusive reports and insights with more than 500 subscriber-only articles every month\nNo contract\nST app access on 1 mobile device\nSubscribe now\nAll subscriber-only content on ST app and straitstimes.com\nEasy access any time via ST app on 1 mobile device\nE-paper with 2-week archive so you won't miss out on content that matters to yo"},
{"url": "http://www.straitstimes.com/singapore/live-pig-exports-from-pulau-bulan-could-take-a-year-to-resume-sfa", "title": "Pulau Bulan’s live pig exports to Singapore could take a year to resume: SFA", "date": "2023-05-09T21:44:54+08:00", "content": "SINGAPORE – It could take up to a year before the Indonesian farm that supplies two-thirds of Singapore’s freshly slaughtered pork once again exports live pigs to the Republic.\nThe Singapore Food Agency (SFA) said this in a Facebook post on Tuesday, in an update after Singapore detected African swine fever in a consignment of pigs from Pulau Bulan on April 19, and stopped imports from the island.\nThe authorities will continue to assess the situation on Pulau Bulan, located in Indonesia’s Riau Islands province, which accounts for 15 per cent of the city-state’s total pork supply.\nAfrican swine fever does not affect humans but is highly contagious and deadly to wild boars and pigs.\n“Such food supply disruptions can happen from time to time,” said SFA, adding that it will continue working with the industry to diversify import sources.\nFor instance, Mexico was recently approved to export chilled pork to Singapore, it said.\nSix suppliers from the country were given the green light to export pork to Singapore, according to an SFA circular dated April 28.\nSeparately, the Meat Traders Association (Singapore) said on Tuesday in a Facebook post that there is sufficient stock of frozen pork to “last for months” should the supply chain be disrupted.\nThe association represents about 80 members from the meat production and trading industry here.\nIt said it was committed to support hotels, restaurants, caterers, retailers, wet markets and cooked food stallholders in ensuring a constant supply of pork for their businesses.\nThe association also urged industry players and consumers to be open to alternative supply sources and remain flexible by considering chilled or frozen pork from other sources.\nAccording to a May 2 report by the World Organisation for Animal Health, African swine fever was first detected in the consignment of animals from Pulau Bulan as part of an investigation into high mortalities of the shipment.\nThe report said all pigs in the imported consignment have been slaughtered, with 55 found to have died of the virus while 95 infected pigs were killed and disposed.\nThis marked the first occurrence of African swine fever in pigs imported into Singapore.\n, after it was detected in a wild boar carcass in the north-west of the country.\nThe abattoir in Jurong where the virus was detected in pig carcasses has been sanitised and operations have resumed with a shipment of live pigs from Sarawak, Malaysia.\nLast week, a\nthat the pigs in Pulau Bulan were likely to have been hit by a new strain of the African swine fever virus as their clinical symptoms differed slightly from those found in previous cases in North Sumatra and other parts of Indonesia.\nHalf of the 70,000 pigs on the Pulau Bulan farm are currently under lockdown to prevent further infections while those infected and kept in the same cages have been culled, the official said"},
{"url": "http://www.straitstimes.com/singapore/community/why-we-need-to-protect-victims-who-refuse-to-report-abusers-even-when-lives-are-in-danger", "title": "Why we need to protect victims who refuse to report abusers, even when lives are in danger", "date": "2023-05-10T12:00:00+08:00", "content": "SINGAPORE - An elderly mother in her 70s has been repeatedly hit, strangled and threatened with death by her son whenever she does not give him money or give in to his other demands.\nHer neighbours called the police out of concern, and social workers found bruises all over her body.\nAlready a subscriber?\nGet exclusive reports and insights with more than 500 subscriber-only articles every month\nNo contract\nST app access on 1 mobile device\nSubscribe now\nAll subscriber-only content on ST app and straitstimes.com\nEasy access any time via ST app on 1 mobile device\nE-paper with 2-week archive so you won't miss out on content that matters to yo"},
{"url": "http://www.straitstimes.com/tech/vr-ai-and-quantum-computing-among-5-key-tech-trends-to-watch-imda", "title": "VR, AI and quantum computing among 5 key tech trends to watch: IMDA", "date": "2023-04-24T20:36:40+08:00", "content": "SINGAPORE – Like a scene out of Steven Spielberg’s science-fiction film Ready Player One, virtual reality (VR) treadmills that move along with a user’s footsteps in any direction are one step closer to being used beyond gaming.\nSynchronised with a user’s suit, the omnidirectional treadmill rolls along by anticipating the movement of a player’s legs to give the illusion that the player is physically travelling in the virtual world.\nThe technology is mostly used in gaming today but can open doors to make online training in healthcare, education and other industries more immersive, said Senior Minister of State for Communications and Information Janil Puthucheary at a media briefing on Singapore’s digital infrastructure.\nVR, artificial intelligence (AI), autonomous vehicles, edge computing and quantum computing are five key areas in the tech sector to build to cater to anticipated demand and maintain competitiveness, said the Ministry of Communications and Information (MCI) at the briefing to provide updates on its digital infrastructure.\nThe authorities are discussing with industry partners on how Singapore can anticipate demands for tech in these fields. Dr Janil said an advisory panel that was formed to discuss these matters will publish a blueprint in June to detail steps for industries to take in their digitalisation.\nThese are the five tech trends highlighted:\nThe $10,000 omnidirectional treadmill, developed by Singapore-based tech start-up StepVR, was among VR technologies presented to the media to highlight the progress of digital products made here.\nThe media was invited to use the treadmill and VR headset to play a Squid Game-inspired video game, which challenges players to hurry across a finish line while stopping each time a gigantic doll turned around.\nInnovations in gaming are often at the forefront of what technology can offer as video games require high processing power and the ability to play with others, said Dr Janil, adding that these developments pave the way for the technology to be used in other sectors.\nThe same software and graphics processors used to make video games have also been used in healthcare training in hospitals here, such as training simulators to prepare surgeons for the operating table.\nMultiplayer interactions that allow groups of users to meet online will also be key to VR’s development in the next decade, said MCI.\nData centres and other physical infrastructure need to be upgraded to accommodate a rise in AI applications, which need more computing power than usual programmes, said the Infocomm Media Development Authority (IMDA).\nIt added: “The increased use of AI will result in more data going the last mile to users as there is a growing need to process and analyse the data in real time to support AI applications.”\nAI programmes have been propelled into the mainstream since the launch of ChatGPT in November 2022, making sophisticated chatbots accessible to the average user.\nExpect self-driving electric vehicles and more autonomous options for those with disabilities within the next decade.\nHowever, safety protocols will need to improve before autonomous vehicles can be widely adopted. This includes digitising infrastructure to ensure that autonomous vehicles are able to recognise obstacles and drive safely, said IMDA.\nEdge computing refers to bringing processors and data storage closer to the devices they serve, instead of the data being accessed through the cloud thousands of kilometres away, which could cause delays.\nThis is critical to allow autonomous vehicles to drive safely as it would reduce any delays in connectivity, or doctors the confidence to perform surgery from remote locations.\nWith more of such services, businesses are likely to adopt more edge computing options in addition to cloud computing, and to require the technology to be faster and more reliable, said IMDA.\nCurrent cyber-security measures that form the basis of today’s Internet can soon be cracked by quantum computers that can easily hack into systems.\nQuantum computers harness the quantum properties of light particles to compute data far faster than traditional computers. In the wrong hands, they can potentially crack traditional code exponentially faster than even the best of non-quantum machines.\nCritical information infrastructure providers will need to update their cyber-security measures to ensure their data is protected as quantum computers are ushered in, said IMDA"},
{"url": "http://www.straitstimes.com/singapore/the-gist-emergency-response-team-to-help-victims-of-family-violence-rental-scams-soar-five-times-in-a-year", "title": "The gist: Emergency response team to help victims of family violence; rental scams soar in 2022", "date": "2023-05-09T19:40:00+08:00", "content": "SINGAPORE – Victims of family violence may get more help if proposed amendments are passed under the Women’s Charter (Family Violence and Other Matters) (Amendment) Bill. The Bill was tabled in Parliament on Tuesday.\nMeanwhile, home owners were warned to be careful of rental scams, while seniors were urged to get vaccinated against Covid-19 to keep infection at bay.\nHere are the key takeaways:\nThe setting up of a new 24-hour emergency response team was proposed as part of the Women’s Charter (Family Violence and Other Matters) (Amendment) Bill. This would help victims, especially those with immediate safety concerns.\nOfficers from this response team can issue an emergency order at the scene that is valid for 14 days, to give the victim ample time to apply for a personal protection order (PPO). Any breach of the emergency order by the perpetrator will be an arrestable offence.\nOther proposed changes include lowering the minimum age required to apply for a PPO from 21 to 18, and to allow for electronic monitoring of abusers.\nThe Ministry of Social and Family Development (MSF) investigated 2,254 new family violence-related cases in 2022, and 2,346 cases in 2021.\nMeanwhile, the National Anti-Violence and Sexual Harassment Helpline received 10,800 calls in 2022, up from 8,400 calls in 2021.\nMSF said there is currently a time gap between an incident of family violence and the granting of a PPO, which means there is a possibility of the abuser hurting the victim during this period.\nThe proposed amendments to the law will better protect victims of high-risk family violence cases.\nThe latest Covid-19 peak has subsided, with about 3,000 infections a day now. This is down from some 4,000 infections a day about two weeks ago, said Health Minister Ong Ye Kung.\nHe also told the House that there are now more than 300 Covid-19 hospitalised patients, which is a fraction of hospitalisations at the peak of the pandemic crisis. However, he said that this still “added significant workload” to hospitals.\nThis is the first infection wave Singapore has faced after transiting to Dorscon Green and treating Covid-19 as an endemic disease.\nIt is something that has been planned for, said Mr Ong, who called it a noteworthy milestone that the country has weathered through.\nIt is vital for vulnerable groups, such as those aged 60 and above, to keep up with their vaccinations to ensure that the resilience of Singapore’s population against the virus does not wane, he added.\nThe number of seniors aged 60 and above who have kept up to date with their vaccinations has been declining, said Mr Ong.\nAt the start of this year, 58 per cent of this group were updated with their Covid-19 vaccinations, but this has since dropped to 50 per cent.\nSome might think that they are not at risk if they do not go out much, while others are concerned about the risk of side effects if they take further vaccination shots, he added.\nHowever, Mr Ong stressed that the incidence of severe adverse reactions is very low in Singapore, and strongly urged this group to keep up with their vaccinations or risk catching an Omicron variant.\nHe added this is also the recommendation of the Expert Committee on Covid-19 Vaccination and the Health Sciences Authority.\nThe number of home rental scams via online platforms has jumped five times, from 192 cases in 2021 to 979 cases in 2022.\nMinister of State for Home Affairs Sun Xueling said such scams took place on e-commerce and social media platforms.\nScammers would usually impersonate property agents and list home rentals on these platforms.\nShe assured home owners, who unknowingly have their homes used in these scams, that they would not be penalised.\nThe hot rental market has seen rental rates surge amid strong demand in recent times.\nThis has led to victims falling for scams when asked to quickly make deposits to secure units, even though they had not viewed the apartment in person or met the supposed housing agent.\nThe Straits Times reported in March that there were at least 305 people who fell prey to home rental scams in the first quarter of 2023.\nMs Sun urged the public to verify the identities of housing agents by checking their phone numbers against the Council for Estate Agencies’ public register or calling the property agency directly, and to view the units in person before making any deposits.\nAbout 530,000 reusable recycling boxes, known as Blooboxes, were collected by April 30. This is 93 per cent of the boxes that were produced.\nSenior Parliamentary Secretary for Sustainability and the Environment Baey Yam Keng said that when planning for the number of Blooboxes to be distributed, the authorities took into account that not all households would require such a box, as many may have their own containers for collecting recyclables.\nThe remaining Blooboxes will be used to support efforts by the National Environment Agency to encourage household recycling.\nThe review on whether to establish a residential noise threshold will be concluded before the end of 2024, said Senior Minister of State for National Development Sim Ann.\nThe Community Advisory Panel on Neighbourhood Noise had recommended extending the quiet hours to be from 10pm to 8am, from the current 10.30pm to 7am.\nThe Municipal Services Office (MSO) is studying the feasibility of this plan, in consultation with relevant community stakeholders.\nMs Sim also said that MSO is working with the Ministry of Culture, Community and Youth and the Ministry of Law to strengthen the inter-agency Community Dispute Management Framework.\nOne measure is to have a pilot unit of dedicated personnel to address serious cases of neighbour noise disputes.\nThere have been no reported attempts to breach Wi-Fi access points or public charging stations at public transport nodes here, said Transport Minister S. Iswaran.\nMr Yip Hon Weng (Yio Chu Kang) had asked about the growing vulnerability of mobile devices and the possibility of compromised data through these shared public facilities.\nMr Iswaran said that data transmitted through public transport Wi-Fi access points, which operate on the Wireless@SGx network, is encrypted.\nTo further protect commuters, he added, charging stations at public transport operators have their data transmission pins removed and can only charge devices.\nStaff also check for physical tampering, while security cameras are in place to deter such attempts"},
{"url": "http://www.straitstimes.com/tech/twitter-labels-sow-doubts-about-what-we-can-trust", "title": "Twitter labels sow doubts about what we can trust", "date": "2023-04-28T07:31:44+08:00", "content": "SAN FRANCISCO – In the 24 hours after Twitter last week\nthat historically served as a means of identifying public agencies, at least 11 new accounts began impersonating the Los Angeles Police Department.\nMore than 20 purported to be various agencies of the federal government. Someone pretending to be the mayor of New York City promised to create a Department of Traffic and Parking Enforcement and slash police funding by 70 per cent.\nMr Elon Musk’s decision to stop giving check marks to people and groups verified to be who they said they were, and instead offering them to anyone who paid for one, is the latest tumult at Twitter, the social media giant he has vowed to remake since he acquired it in 2022 for US$44 billion (S$58.8 billion).\nThe changes have convulsed a platform that once seemed indispensable for following news as it broke around the world.\nThe information on Twitter is now increasingly unreliable.\nAccounts that impersonate public officials, government agencies and celebrities have proliferated. So have propaganda and disinformation that threaten to further erode trust in public institutions. The consequences are only beginning to emerge.\nMs Alyssa Kann, a research associate at the Atlantic Council’s Digital Forensic Research Lab, said Twitter under Mr Musk was systematically dismantling safeguards that had been put in place over years of consideration and controversy.\nShe added: “When there are so many things going wrong at once, it’s like: Which fire do you put out first?”\nAfter a public dispute with NPR, which Twitter falsely labelled state-affiliated media, the platform last week removed all labels that had identified state-owned media, including those controlled by authoritarian states such as Russia, China and Iran.\nThat, coupled with a decision to stop blocking recommendations for them, has coincided with a spike in engagement for many of these accounts, according to research by the Digital Forensic Research Lab and another organisation that studies disinformation, Reset, which is based in London.\nIn Sudan, new accounts on Twitter are falsely representing both sides of the civil war that has erupted there.\nOne account that, presumably, bought a blue check mark falsely proclaimed the death of Lieutenant-General Mohamed Hamdan Dagalo, leader of the rebel Rapid Support Forces. More than 1.7 million people viewed the tweet.\nTwitter’s new head of trust and safety, Ms Ella Irwin, did not respond to a request for comment on the changes and their consequences.\nTwitter has always been a font of misinformation and worse, but the previous policies sought to inform readers of the sources of content and limit the most egregious instances.\nThe debut of verified accounts on Twitter in 2009 is usually associated with Mr Tony La Russa, a Major League Baseball manager who sued Twitter for trademark infringement and other claims after being impersonated on the platform.\nOver time, verified accounts with blue check marks steered users to official sources and real people. Labelling news organisations as state media indicated that the accounts reflected a certain point of view.\nImpersonators became a problem almost immediately after Mr\nand offered to sell the check marks to anyone who subscribed for the monthly fee.\nHe backtracked after companies like Eli Lilly and PepsiCo grappled with seemingly verified spoof accounts promising free insulin and praising the superiority of Coca-Cola.\nBy last week, Twitter had begun removing the blue check marks from companies, government agencies, news organisations and others who did not agree to pay. It appears that many chose not to sign up, though Twitter has not disclosed any figures.\nSome cheered the changes.\n“Now you can even find me in the search,” tweeted Ms Margarita Simonyan, editor-in-chief of RT, the Russian state television network that has been accused of rampant misinformation and hate speech aimed at Ukraine. She signed off the tweet by saying: “Brotherly, Elon @elonmusk, from the heart.”\nTwitter’s algorithms previously excluded accounts labelled state officials or media from recommendations, dampening engagement.\nAccording to Reset, 124 accounts belonging to Russian state media have received on average 33 per cent more exposure in views and impressions after changes took effect in late March.\nThey include accounts like that of Mr Dmitry Medvedev, former president of Russia and deputy chairman of the country’s security council, who posted a distorted photograph of President Joe Biden on Tuesday, calling him in English “a daring geezer”.\nWhen an account argued this month that Twitter was amplifying Russia’s genocidal propaganda toward Ukraine, Mr Musk replied dismissively: “All news is to some degree propaganda. Let people decide for themselves.” (The account he was responding to has since been suspended.)\nResearchers said the abrupt changes in how the check marks are obtained threatened, at a minimum, to create confusion. They could also undermine trust in a tool for communication during crises such as natural disasters.\nThe main account of the Los Angeles Police Department has a grey check mark, which Twitter created for “legacy accounts”, but not all of its various bureaus do – the Hollywood division, for example.\nIn addition to providing blue check marks for US$8 a month, Twitter has invited organisations to pay US$1,000 to receive gold marks for multiple accounts.\nFor a time, at least, one was extended to a Disney Junior impostor account that tweeted racist and vulgar language.\n“This is going to be chaos for emergency services,” tweeted Dr Marc-Andre Argentino, a research fellow at the London-based International Centre for the Study of Radicalisation.\nMr Argentino tracked examples showing an account impersonating the mayor of Chicago replying to one impersonating the city’s Department of Transportation. Another had New York City’s actual government-run account arguing with an impostor.\n“Yes this is funny, let us all laugh,” Dr Argentino wrote. “Now take two seconds and go back to any mass casualty incident in a major city, or a natural disaster, or any crisis/critical incident when people turn to official sources of information in times need and think of the harm that this can cause.”\nOn Friday, comedian George Carlin’s daughter, Ms Kelly Carlin, tweeted an accusation that someone was masquerading as the account she runs for her late father, even using the same profile photo and claiming to be her.\n“HERE IT BEGINS,” she wrote, later complaining after several unsuccessful attempts to have the impostor account removed that “Twitter is broken”. The spoof account was still up on Wednesday, with nine followers.\nMr Josh Boerman, who co-hosts a pop culture podcast, The Worst Of All Possible Worlds, was the source of the account impersonating Mayor Eric Adams of New York, promising to create a traffic and parking department and cut police funding.\nMr Boerman said he had tried hard to leave obvious hints that he was an impersonator.\nHis tweet thread included unrealistic scenarios where all police officers’ guns were melted down and sold for scrap, with the proceeds going to the parks department. He made up an organisation with a ludicrous name: the New York City Porcine Benevolent Association. He promoted his podcast to his relatively small Twitter following of 1,700 users.\n“Pretty much everybody got that it was a joke immediately, which was my hope – I wasn’t trying to mislead anyone,” he said.\n“The point was that this can be both a joke on the state of the network right now, as well as an opportunity to think about the way that media is disseminated and how we think about our public figures.”\nThe removal of the blue verification badges caused “immediate and pure chaos”, but the novelty eventually wore off, he said. His profile name is now “bosh (not mayor anymore)”. He said he was careful to confirm any announcement he saw on Twitter using other sources.\n“The problem comes when you have accounts that maybe have hundreds of thousands of followers and are positioning themselves as the real thing,” he added.\n“Twitter’s approach of ‘Well, if people pay for verification, certainly they must be legit’ is so inane I don’t even know how to put words to it.” NYTIME"},
{"url": "http://www.straitstimes.com/singapore/over-300-cartons-and-1500-packets-of-duty-unpaid-cigarettes-found-in-malaysian-registered-car-at-woodlands", "title": "Over 300 cartons, 1,500 packets of duty-unpaid cigarettes found in  car at Woodlands Checkpoint", "date": "2023-05-10T12:50:00+08:00", "content": "SINGAPORE — The Immigration and Checkpoints Authority (ICA) foiled an attempt to smuggle 314 cartons and 1,558 packets of duty-unpaid cigarettes from Malaysia into Singapore last month.\nOn April 18, a Malaysia-registered car underwent enhanced checks at the Woodlands Checkpoint, according to the agency’s Facebook post on Tuesday.\nAn accompanying video shows officers unearthing the cigarettes from various parts of a silver Honda, including its bonnet.\nICA added that the case was referred to the Singapore Customs for investigations.\nIn two incidents in January this year, ICA officers\nat the Tuas Checkpoint. Chewing tobacco is prohibited and not allowed for import into Singapore.\nAlso, ICA foiled\nin a Malaysia-registered lorry entering Singapore on March 28.\nIn 2022, ICA detected 35,000 contraband cases, up from 27,000 in 2021.\nThe largest seizure of contraband in 2022 occurred on June 24. The 37,728 cartons of duty-unpaid cigarettes were hidden within large rolls of aluminium foil in a container at Pasir Panjang Scanning Station.\n𝙈𝙤𝙧𝙚 𝙘𝙞𝙜𝙨 𝙩𝙝𝙖𝙣 𝙥𝙖𝙨𝙨𝙚𝙣𝙜𝙚𝙧𝙨 𝙞𝙣 𝙩𝙝𝙞𝙨 𝙘𝙖𝙧 🚗\n\nOn 18 April 2023, ICA officers at Woodlands Checkpoint foiled an attempt to smuggle a total of 314 cartons and 1558 packets of duty-unpaid cigarettes into Singapore via a Malaysia-registered car.\n\nOur officers profiled the vehicle for enhanced checks and uncovered the contraband cigarettes in various nooks and crannies of the car.  \n\nThe case was referred to Singapore Customs for further investigations.\n\nAs Guardians of our Borders, ICA is committed to facilitating trade and safe travels while keeping Singapore’s borders safe and secure.\n\n#SecureBordersSafeSG #GuardiansOfOurBorder"},
{"url": "http://www.straitstimes.com/tech/with-new-5g-maritime-network-sick-seafarers-can-get-teleconsultation-medicine-delivered-by-drones", "title": "New 5G maritime network: Seafarers can have drones deliver medicine at sea after teleconsultation", "date": "2023-04-26T17:50:00+08:00", "content": "SINGAPORE - Seafarers who fall sick can soon have medicine flown to them by drones.\nThey can also do video consultation with a doctor instead of being ferried to shore.\nThis service will be launched in July as a partnership between telecommunications firm M1 and Fullerton Health, and is aimed at those who work at shipping companies in Singapore.\nThe use of drones and smooth video calls at sea are enabled by M1’s 5G maritime network which was launched on Wednesday at St John’s Island, with a network radius of at least 15km. Two other similar stations on Bukom Island and Raffles Lighthouse will be deployed later in 2023, and another nine stations by 2025 to cover the waters off Singapore’s southern coast.\nThe teleconsultation service will reduce the time that sick seafarers have to wait to receive medical attention, as well as the logistical burden of sending a patient to the mainland unless it is an emergency, said Fullerton Health country manager Walter Lim at the launch of the network.\nThe deployment of boats to ferry patients to the shore is understood to cost anywhere between $300 and $600 per trip.\nDr Lim told The Straits Times: “When seafarers are sick, it is still common to consult doctors over the phone or through e-mail. Video conferencing is not widely available because of the cost of connectivity.\n“But with a 5G network, there’s no lag and the image is sharper, which will give the doctor a clearer picture of what is happening. With this, the doctor can make an informed decision on whether the patient should go to the clinic, or if a drone should be sent out to deliver medicine.”\nWithin three hours of a consultation, sick workers can receive medicine for non-urgent conditions, such as an upset stomach and minor respiratory symptoms or wounds, without requiring the boat to dock inland, he said.\nFullerton Health receives up to five calls weekly for medical consultation from sea, said Dr Lim, adding that at least 15 doctors from the healthcare chain will be on standby for consultations via the LiveFuller app.\nSaid to be the first of its kind, the maritime 5G network has been in the works since 2019, in a partnership between the Infocomm Media Development Authority (IMDA), Maritime and Port Authority of Singapore and M1.\nThis also means that any M1 user out at sea will be able to tap its stronger network speeds.\n5G, which is roughly 10 times faster than 4G, enables unmanned vehicles, including aircraft and ships, to operate safely, thanks to less lag and a better signal. It also provides more precise real-time location data than satellite technology.\nM1 also launched a slate of new 5G services for clients on ships, including maritime surveillance for onboard security. Vessels can set up real-time camera systems to receive seamless video footage which can be streamed inland with little delay, replacing legacy systems on older ships that require the sharing of memory cards to access surveillance footage, said an M1 spokesman.\nFor a fee, workers can also receive smart wearables that monitor their health and whereabouts so that boat operators will know where they are and if they are safe while at sea.\nThese services are among the early use cases of 5G at sea, and M1 is working with industry players to find new ways that the network can be used, said M1 chief executive Manjot Singh Mann.\nThis is the latest among 5G projects slated to be launched in 2023, including unmanned electric vessels that by August will be used to clean and inspect rivers. At least 100 5G-enabled robots will be deployed on the factory floor of the upcoming Hyundai Motor Group Innovation Centre in Singapore to transport materials for electric vehicles in production"},
{"url": "http://www.straitstimes.com/tech/tech-news/80000-well-paying-jobs-in-infocomms-sector-by-2025-under-renewed-plan", "title": "80,000 well-paying jobs in infocomm sector expected by 2025 under refreshed industry road map", "date": "2023-05-05T23:43:28+08:00", "content": "SINGAPORE – The number of well-paying jobs in areas such as software and telecommunications is expected to grow to about 80,000 by 2025, under a new road map for the information and communications industry.\nUnder the refreshed Information and Communications Industry Transformation Map, the sector is also expected to achieve a value-added compound annual growth rate of between 5 per cent and 7 per cent by 2025.\nThis was announced by Deputy Prime Minister Lawrence Wong at an event celebrating the Singapore Computer Society’s 55th anniversary held at the Shangri-La hotel on Friday.\nThe map builds on the previous infocomm media Industry Transformation Map, which sought to achieve an annualised growth rate of 6 per cent between 2015 and 2020. It was developed by Digital Industry Singapore, a joint office which supports the growth of the technology sector here.\nThe refreshed map will focus on specific areas such as IT and online services, which are expected to outperform the rest of the economy, said Mr Wong, who is also Finance Minister.\nHe noted that the demand for digital services – which spiked during the Covid-19 pandemic – has tapered down, while rising interest rates have constrained investment spending and moderated growth in the tech sector.\nDespite this, the medium- to long-term outlook for the tech sector remains bright, he said, noting that rapid advances in areas such as quantum computing and artificial intelligence (AI) would open up new opportunities.\nThe use of technology such as data analytics and AI here is currently modest, Mr Wong said. Only about one in 10 companies has adopted data analytics, while as at 2021, just about 3.3 per cent had adopted AI.\nMr Wong presented four strategies for growth under the refreshed map, including enhancing efforts to grow Singapore’s ecosystem of tech companies.\nGlobal tech firms will be encouraged not just to establish their regional headquarters in Singapore, but to also do more innovative work here.\nMeanwhile, local companies will be provided with more support through programmes such as the Infocomm Media Development Authority’s Open Innovation Platform, where local tech firms are linked to potential customers.\nSingapore will also continue to invest in areas such as AI, Mr Wong said.\nThe country is building up its connectivity infrastructure, and is working to achieve nationwide 5G deployment by 2025, he added.\nThe first two 5G standalone networks have already achieved 95 per cent outdoor coverage nationwide, ahead of schedule.\n“And we are not stopping there. We are already building up capabilities in 6G, so that we can remain at the forefront of communications technology,” he said.\nThe Republic is also growing its network of digital economy agreements to allow companies here to engage in seamless cross-border digital trade with more countries.\nThe most critical factor in achieving Singapore’s information and communications ambitions is its people, Mr Wong said.\nHe encouraged employers to broaden their hiring practices and focus on skills-based assessments rather than just paper qualifications.\nAs co-chair of the TechSkills Accelerator for ITE and Polytechnics Alliance, the Singapore Computer Society has championed skills-based hiring for polytechnic and Institute of Technical Education graduates, Mr Wong noted.\nHe said he hopes more companies will join the alliance, which has grown to 15 companies – including Singtel, Google and Oracle – in the eight months since it was launched.\nMeanwhile, the Information and Communication Jobs Transformation Map launched in October 2022 will help identify jobs that will be disrupted by emerging technology, and recommend skills which workers can pick up.\nMr Wong said: “Despite the consolidation pressures the industry is presently facing, we can still look forward with confidence as we strive to strengthen Singapore’s competitive positioning as an innovative and trusted digital hub for the region and the world."},
{"url": "http://www.straitstimes.com/tech/tech-news/google-gives-early-look-at-pixel-fold-phone-before-debut-next-week", "title": "Google gives early look at Pixel Fold phone before debut next week", "date": "2023-05-05T09:00:00+08:00", "content": "Alphabet’s Google gave a surprise early look at a foldable Pixel smartphone, heralding its move into a category currently dominated by Samsung.\nThe company posted a video and photos of the device, called the Pixel Fold, showing a phone with a large external display and an even bigger internal screen that can close up like a clamshell.\nThe company said on its website that it would provide more information on the device at its I/O conference on May 10. The event is also expected to include details on a cheaper version of the Pixel 7 phone and a tablet that Google originally previewed in 2022.\nThe move signals that Google is getting more serious about competing with Samsung and Apple in smartphones, an area where it has struggled to gain a significant foothold. Though Google’s Android operating system is widespread, the company is dwarfed by other manufacturers in its sales of hardware.\nFoldables account for only 1 per cent of smartphone shipments, according to data from Strategy Analytics and International Data Corporation (IDC), but they contribute a larger share of revenue because they fetch higher prices.\nIDC estimates that shipments will more than triple from 2022, to roughly 50 million units annually, by 2027. That would still be less than 4 per cent of the market but would account for a US$42 billion (S$55.7 billion) segment. BLOOMBER"},
{"url": "http://www.straitstimes.com/tech/dished-up-by-3d-printers-a-new-kind-of-fish-to-fry", "title": "Dished up by 3D printers, a new kind of fish to fry", "date": "2023-05-03T18:20:00+08:00", "content": "REHOVOT – Forget your hook, line and sinker. An Israeli foodtech company says it has 3D-printed the first-ever ready-to-cook fish fillet using animal cells cultivated and grown in a laboratory.\nLab-grown beef and chicken\nto sidestep the environmental toll of farming and tackle concerns over animal welfare, but few companies have forayed into seafood.\nIsrael’s Steakholder Foods has now partnered with Singapore-based Umami Meats to make fish fillets without the need to stalk dwindling fish populations.\nUmami Meats extracts cells – for now from grouper – and grows them into muscle and fat. Steakholder Foods then adds them to a “bio-ink” suited for special 3D printers. The outcome – a narrow fillet that mimics the properties of sea-caught fish.\nUmami hopes to bring its first products to market next year, starting in Singapore and then, pending regulation, countries like the United States and Japan.\nCell cultivation alone is still too expensive to match the cost of traditional seafood, so for now the fish cells are diluted with plant-based ingredients in the bio-ink.\n“As time goes by, the complexity and level of these products will be higher, and the prices linked to producing them will decrease,” said Mr Arik Kaufman, the chief executive of Steakholder Foods.\nA glass dish slides back and forth in the 3D printer, the white finger-length fillet building mass with each pass. It has the flakiness of traditional fish and when fried and seasoned it is hard to tell the difference.\nThe process is simpler than with beef, but there are some disadvantages.\nCow stem cells have been studied extensively but much less is known about fish, said Umami’s chief executive, Mr Mihir Pershad.\n“We have to figure out what the cells like to eat, how they like to grow, and there’s just not so much literature to start from,” he said.\n“The number of scientists, you can imagine, working on fish stem cell biology is a small fraction of those working on animal cells and human cells.”\nThey have figured out a process for grouper and eel and hope to add three other endangered species in the coming months, he said.\nMeeting the price of fish from the sea is a key challenge.\n“We want consumers to choose based on how it tastes and what it can do for the world and the planetary environment. And we want to take cost off the table as consideration,” Mr Pershad added. REUTER"},
{"url": "http://www.straitstimes.com/sport/sea-games-2023-soh-rui-yong-finishes-fourth-in-5000m-in-games-return", "title": "SEA Games 2023: Soh Rui Yong finishes fourth in 5,000m in Games return", "date": "2023-05-09T21:15:22+08:00", "content": "PHNOM PENH – Back in the SEA Games after a six-year absence, distance runner Soh Rui Yong could not mark his comeback with a medal on Tuesday, but he was happy to have “punched above my weight”.\nCompeting in a near-empty Morodok Techo National Stadium, the 31-year-old set the early pace in the men’s 5,000m but could not keep up with the leading pack in the final few laps, clocking 14min 48.43sec to finish fourth. Teammate Jeevaneesh Soundararajah was 15th out of 16 runners in 15:51.63.\nThailand’s Kieran Tuntivate took the gold in 14:34.77, while the Philippines’ Sonny Wagdos was second in 14:36.45 and Indonesia’s Robi Syianturi (14:43.45) clinched the bronze.\nSoh, who won the marathon golds in 2015 and 2017, was happy with his best finish in the 5,000m, having been fifth in 2017. His time was also just short of\nHe said: “I’m very proud of it. I think I made the race as exciting and as advantageous to myself, to my strengths, as I could. I am a marathoner running a 5,000m.\n“Best case (for today) was third. My seed timing coming in was maybe eighth or ninth, so to get fourth means I punched above my weight. Maybe eight years ago, I would have been unhappy with coming in fourth and no medal but this is my best-ever 5,000m finish.\n“I am 31 and I am getting better as I age. Look out for me in two years in the marathon. But first we have the 10,000m to come.”\nSoh returned to the national fold recently after he was\nfollowing several clashes with the Singapore National Olympic Council. He was allowed to compete in Cambodia after an appeal was approved by a special appeals committee in late March.\nWhile Soh did not make the podium in Phnom Penh, teammate Goh Chui Ling – who is competing in her sixth Games – did, after a national-record 4:26.33 in the women’s 1,500m for the bronze.\nThe race was won by Vietnam’s Nguyen Thi Oanh (4:16.85), while compatriot Bui Thi Ngan (4:24.57) took the silver.\nGoh, 30, who\nin 2022, received news last Friday that her 1,500m medal would be upgraded to a silver. She will also be awarded a bronze in the 800m, taking her total from that edition of the Games to three.\nThe Southeast Asian Sports Council announced on Friday that 10 athletes involved in doping at the Hanoi Games had been stripped of their medals. They included Khuat Phuong Anh, who won the women’s 800m and was second in the women’s 1,500m.\nGoh said: “This is my sixth SEA Games and I am very happy to win another medal for the country. I always feel privileged to wear the national colours.\n“After what happened (with the disqualification), this is my fourth medal for Singapore so I am very happy. This is accumulation of years of hard work.\n“I broke the national record last year, and I am glad to go under it again.”\nHigh jumper Michelle Sng added another bronze medal for Singapore with her leap of 1.73m, finishing third out of seven competitors"},
{"url": "http://www.straitstimes.com/tech/health-experts-must-raise-alarm-on-ai-threats", "title": "Health experts 'must raise alarm on AI threats'", "date": "2023-05-10T09:05:00+08:00", "content": "PARIS – Health professionals must warn the world about the dangers of artificial intelligence (AI), a group of academics wrote on Wednesday, as clamours grow for work on the technology to be halted.\nThe academics wrote in the British Medical Journal that time was running out to take action because corporations, the military and governments were working so fast to develop AI tools.\nAI exploded into the public consciousness in 2022 with ChatGPT,\nThe wild popularity of the bot sparked a race between tech giants like Google and Microsoft to embed AI in everything from spreadsheets to search tools, and prompted investors to pour money into AI start-ups.\nBut the health academics pointed to a range of threats, including powerful AI surveillance systems being developed in dozens of countries, killer robots and disinformation.\nFor healthcare, they wrote, people with darker skin were at serious risk of harm or reduced care because the datasets used to “train” AI algorithms were often biased.\nThey argued that “the window of opportunity to avoid serious and potentially existential harms is closing”.\nThe authors, led by Mr Frederik Federspiel of the London School of Hygiene and Tropical Medicine and Dr David McCoy of the United Nations University in Kuala Lumpur, wrote that global cooperation would be needed.\n“Healthcare professionals have a key role in raising awareness and sounding the alarm on the risks and threats posed by AI,” they wrote in an analysis piece.\n“If AI is to ever fulfil its promise to benefit humanity and society, we must protect democracy, strengthen our public interest institutions, and dilute power so that there are effective checks and balances.”\nConcern about the direction of AI research is prompting alarm even among those at the centre of the field.\nEarlier this month, computer scientist Geoffrey Hinton, often dubbed “the godfather of AI”,\nto warn of the “profound risks to society and humanity” of the technology.\nIn March, billionaire Elon Musk – whose Tesla carmaker deploys AI systems – and hundreds of experts\nto allow time to make sure the technology was safe and properly regulated. AF"},
{"url": "http://www.straitstimes.com/sport/football/albirex-to-set-up-brand-new-methodology-department", "title": "Albirex Niigata to set up brand new methodology department", "date": "2023-05-09T22:16:07+08:00", "content": "SINGAPORE – In a bid to drive youth development in Singapore football, Albirex Niigata are\nled by director Marcal Trulls.\nThe 39-year-old Spaniard has been appointed as head of youth development and will also take over as coach of the centre of excellence Under-17 team.\nTrulls is a licensed coach from the Ekkono Soccer School Barcelona and holds a Uefa “A” coaching certificate. He was previously assistant coach of the Brunei national team as well as Oman Club and East Bengal. He has also coached in Spain, Thailand and China.\nAlbirex general manager Koh Mui Tee said: “He has a heavy task of influencing the next generation of players in Singapore and also educating our youth coaches about the Ekkono method, but we have full confidence in him.\n“It is important for the coaches and players from our football academy to learn this method thoroughly so that it can become the club’s culture and identity.”\nThe Ekkono method uses four pillars to help teams build their football identity and has been used in major European clubs such as Barcelona and Inter Milan.\nTrulls is also a big believer in neuro-linguistic programming (NLP), a psychological approach that involves analysing strategies used by successful individuals and applying them to reach a personal goal.\nHe completed a five-month course in February 2022 and describes it as a coaching tool for him to better connect with his players.\nHe said: “For me, this is something really, really important because, through that connection, you can unlock the full potential of the person that you’re working with by empowering the other person.”\nNoting that the programme is “all about relations”, he will work with the coaches to “more effectively bring those methodologies and those processes into the players”.\nThrough its four pillars of outcome orientation, rapport, flexibility and sensory acuity, NLP aims to use language to bring about changes in someone’s thoughts and behaviour.\nFormer Leicester City boss Brendan Rodgers is an advocate of NLP and has used it on his players, telling Sky Sports that “it really opens your mind up to your communication with people... I studied it for quite a long time and I still feel the benefits of that”.\nSimilarly, Trulls wants to use NLP and the Ekkono method to improve his charges.\nHe added: “I really believe in the Ekkono method because it matches my personal values.\n“Because for me, football is not just about winning or getting a result. Winning is not enough.\n“Football is a way to achieve social transformation... Of course, we improve football, we improve players, we improve the level of football in Singapore.\n“But we improve also as human beings."},
{"url": "http://www.straitstimes.com/tech/ai-could-replace-80-of-jobs-in-next-few-years-expert", "title": "AI could replace 80% of jobs in next few years: Expert", "date": "2023-05-09T09:15:00+08:00", "content": "RIO DE JANEIRO – Artificial intelligence could replace 80 per cent of human jobs in the coming years – but that is a good thing, says United States-Brazilian researcher Ben Goertzel, a leading AI guru.\nMathematician, cognitive scientist and famed robot-creator Goertzel, 56, is founder and chief executive of SingularityNET, a research group he launched to create “Artificial General Intelligence,” or AGI – artificial intelligence with human cognitive abilities.\nWith his long hair and leopard-print cowboy hat, Mr Goertzel was in provocateur mode last week at Web Summit in Rio de Janeiro, the world’s biggest annual technology conference, where he told AFP in an interview that AGI is just years away and spoke out against recent efforts to curb artificial intelligence research.\nHow far are we from artificial intelligence with human cognitive abilities?\nIf we want machines to really be as smart as people and to be as agile in dealing with the unknown, then they need to be able to take big leaps beyond their training and programming. And we’re not there yet. But I think there’s reason to believe we’re years rather than decades from getting there.\nWhat do you think of the debate around AI such as ChatGPT and its risks? Should there be a six-month research pause,\nI don’t think we should pause it because it’s like a dangerous superhuman AI. These are very interesting AI systems, but they’re not capable of becoming like human level general intelligences, because they can’t do complex multi-stage reasoning, like you need to do science. They can’t invent wild new things outside the scope of their training data.\nThey can also spread misinformation, and people are saying we should pause them because of this. That’s very weird to me. Why haven’t we banned the internet? The internet does exactly this. It gives you way more information at your fingertips. And it spreads bull***t and misinformation.\nI think we should have a free society. And just like the internet shouldn’t be banned, we shouldn’t ban this.\nIsn’t their potential to replace people’s jobs a threat?\nYou could probably obsolete maybe 80 per cent of jobs that people do, without having an AGI, by my guess. Not with ChatGPT exactly as a product. But with systems of that nature, which are going to follow in the next few years.\nI don’t think it’s a threat. I think it’s a benefit. People can find better things to do with their life than work for a living. Pretty much every job involving paperwork should be automatable.\nThe problem I see is in the interim period, when AIs are obsoleting one human job after another. I don’t know how to solve all the social issues.\nWhat can robots do for society today, and what will they be able to do in the future, if AGI is achieved?\nYou can do a lot of good with AI. Like Grace, (a robot nurse) we showcased at Web Summit Rio.\nIn the US, a lot of elderly people are sitting lonely in old folks’ homes. And they’re not bad in terms of physical condition – you have medical care and food and big-screen TV – but they’re bad in terms of emotional and social support.\nSo if you inject humanoid robots into it, that will answer your questions, listen to your stories, help you place a call with your kids or order something online, then you’re improving people’s lives. Once you get to an AGI, they’ll be even better companions.\nIn that case, you’re not eliminating human jobs. Because basically, there’s not enough people who want to do nursing and nursing assistant jobs. I think education will also be an amazing market for humanoid robots, as well as domestic help.\nWhat regulation do we need for AI to have a positive impact?\nWhat you need is society to be developing these AIs to do good things. And the governance of the AIs to be somehow participatory among the population. All these things are technically possible. The problem is that the companies funding most of the AI research don’t care about doing good things. They care about maximising shareholder value. AF"},
{"url": "http://www.straitstimes.com/sport/sea-games-2023-not-feeling-100-per-cent-but-leticia-sim-keeps-winning-gold", "title": "SEA Games 2023: Not feeling 100 per cent, but Letitia Sim keeps winning gold", "date": "2023-05-09T22:29:42+08:00", "content": "PHNOM PENH – Jet lag, allergies, coping with unfamiliar heat and humidity. Each time Letitia Sim travels from the United States, where she lives, to compete at the SEA Games, she rarely feels a hundred per cent.\nThat does not stop her from pushing herself in the pool, though. And winning.\nThe Singaporean, laser focused as she emerged from the tunnel in just her swimsuit instead of the usual tracksuit swimmers tend to favour, proved too good in the 100m breaststroke on Tuesday night, winning in a meet record of 1min 7.94sec.\nMalaysian Phee Jinq En, who held the previous mark of 1:08.50 set in 2019, was second in 1:09.60, followed by Singapore’s Christie Chue (1:10.94).\nSim, 20, who was congratulated by Phee after the race, said: “Not sure if it was sinuses or allergies, I was just not feeling it the first two days. Also, the time change could have been a big difference because I was coming from the US and a few days to adjust is hard.\n“At the Hanoi Games, I had a sinus infection near the 50m breaststroke race, so this has been a little bit of deja vu.”\nIn Vietnam 12 months ago, she still prevailed to complete the 50m and 100m double.\nShe was second this time in the shorter distance, losing to Thai Jenjira Srisa-Ard, but surprised herself to win the 200m individual medley the next evening at the Morodok Techo Aquatics Centre.\nSim said: “The first event was a bit rough but it was just the first one, so I didn’t mind it that much.\n“I’m glad it is (my form) going up, now I just have to level up the emotions. I still have two more days and a lot of events left.”\nTry telling that to an ecstatic Faith Khoo. She captured her first Games medal on Tuesday, finishing second in the 100m backstroke in 1:03.68.\nShe was sandwiched between Filipina Teia Isabella Salvino (1:01.64) and Indonesian Angel Gabriella Yus (1:03.71).\nKhoo, 19, said: “I was just focusing on improving from this morning’s heats. I’m just so happy.”\nIt was deja vu once again for Singapore on Tuesday as their other three golds came courtesy of the Quah siblings.\nJing Wen, 22, won the evening’s first race, the women’s 100m butterfly, in 59.02sec, beating older sister Ting Wen, 30, who finished 0.49sec behind for the silver. Filipina Jasmine Alkhaldi took bronze in 1:00.45.\nTheir brother Zheng Wen then overcame a poor first 50m to overhaul Teong Tzen Wei and win the 100m fly in 52.04, 0.56sec ahead of his teammate.\nJarod Hatch of the Philippines was third in 52.91.\nThe 100m fly win gave him 30 SEA Games golds, breaking Joseph Schooling’s record.\nThe Quahs then teamed up with Nicholas Mahabir in the 4x100m mixed medley, now an Olympic event and making its debut at the SEA Games.\nThe quartet dominated and won in 3:51.72, ahead of the Philippines (3:57.01) and Thailand (3:58.18).\nThis was the first time all three Quahs have raced together in a relay – the mixed gender format is relatively new – and it made Phnom Penh a special outing, said the trio.\nNot wanting to feel left out, their teammate and 17-year-old Games rookie Nicholas showed off his rhyming skills – “Normally I go by Nick Mah, but tonight I’m a Quah” – to laughter from his adopted family.\nHe added: “So there are actually four of us. But jokes aside, it was a really fun race, I’m glad I got to do it with these three."},
{"url": "http://www.straitstimes.com/sport/sea-games-2023-singapore-table-tennis-women-upset-by-malaysia-face-tougher-route-to-final", "title": "SEA Games 2023: Singapore table tennis women upset by Malaysia, face tougher route to final", "date": "2023-05-10T00:00:54+08:00", "content": "PHNOM PENH – In a stunning reverse of the 2022 Commonwealth Games final, Singapore’s women’s table tennis team were beaten 3-0 by Causeway rivals Malaysia in their SEA Games Group B round-robin match on Tuesday.\nAt the Morodok Techo National Stadium Table Tennis Hall, Zhou Jingyi, Zeng Jian and Wong Xin Ru were pushed to the brink by rivals Karen Lyne, Alice Chang and Tee Ai Xin, who managed to produce the extra oomph to seal their first Games victory against Singapore this millennium.\nAfter Tee claimed the win, the Malaysian tigresses let out a piercing roar, punching the air in delight and celebrating with high-fives.\nChang told The Straits Times they were surprised to win and by such a margin, but noted that it was a moment they worked hard for.\nShe said: “We lost to Singapore in the group stage at the last SEA Games in 2022, and then lost to them again in the Commonwealth Games final, which were regrettable. So, since then... building up to these SEA Games, we train every day with a strong desire of wanting to beat Singapore.\n“We have not made the women’s team final for 30 years and we also want this so badly. To do so, we know we have to beat Singapore or Thailand along the way.\n“Today, we played like we had nothing to lose against strong opponents, and we stepped up. Now, we most likely have to beat Vietnam to reach the final, we cannot relax.”\nWhile Singapore still progressed to the last four with an earlier 3-0 win over Cambodia, they did so as group runners-up, which means a more difficult semi-final on Wednesday against defending champions and Group A winners Thailand. It will be a tougher route to reclaiming the gold they lost in 2021 after nine straight triumphs.\nIn the Causeway derby, Zhou got off to a fine start against Lyne, taking the first game despite her opponent saving eight game points in a row, but she eventually lost 3-2 (16-18, 11-8, 9-11, 15-13, 11-6) and left the arena with ice packs on both knees.\nSimilarly, Zeng was also leading 2-1 before chopper Chang came from behind to deliver a 3-2 (12-10, 8-11, 9-11, 11-4, 11-3) upset.\nWong tried to stem the tide, but Malaysia’s momentum was too strong as Tee beat her 3-1 (12-10, 12-10, 7-11, 11-9).\nNational women’s team coach Jing Junhong said: “Malaysia have improved and the levels between both teams are similar. The difference today was we were more tense, and they were more aggressive.\n“We expected this to be a tough match and our players wanted to win so badly, they were not able to play freely. Maybe they put unnecessary pressure on themselves and were hesitant while applying our strategy.\n“We are definitely underdogs against Thailand. We need to get over our disappointment, try to pose them some problems, learn about our inadequacies and improve.”\nThe men’s team fared better in their Group B matches, as Koen Pang, Clarence Chew and Izaac Quek all won against Laos (3-0) and Malaysia (3-0) on Tuesday.\nThey are expected to beat the Philippines in their final round-robin match on Wednesday to advance as group winners into the semi-finals, where they will meet defending champions Thailand, who are second in Group A after losing to Vietnam.\nWhile Pang and Chew had straightforward 3-0 wins over Malaysians Javen Choong (11-5, 11-2, 11-6) and Leong Chee Feng (11-9, 11-8, 11-7) respectively, Quek faced more resistance from southpaw Wong Qi Shen.\nHowever, the 17-year-old debutant showed maturity and composure to rebound from 2-1 down to win 3-2 (8-11, 12-10, 4-11, 13-11, 11-4).\nMen’s national coach Gao Ning said: “We went all out and played our normal levels today. Beating the 2022 silver medallists is good for our confidence, but there is still work to be done."},
{"url": "http://www.straitstimes.com/sport/football/de-bruyne-rocket-leaves-man-city-and-madrid-level", "title": "Pep Guardiola looks forward to Champions League ‘home final’ against Real Madrid", "date": "2023-05-10T05:17:13+08:00", "content": "MADRID – Manchester City manager Pep Guardiola is relishing playing a “final at home with our people” next week as his team drew 1-1 at Real Madrid in the first leg of their Champions League semi-final at Real Madrid on Tuesday.\nFor once, City goal monster Erling Haaland was shackled by the Real defence. But when they needed a moment of magic, the old reliable Kevin de Bruyne stepped up to equalise in an absorbing clash at the Bernabeu.\nVinicius Jr had scored for the home side with a stunning strike against the run of play in the first half, before de Bruyne then netted an equally impressive shot after the break.\n“It was a tight game,” said Guardiola.\n“It will be a final playing at home with our people and we look forward to it. It’s like a play-off now.\n“We know exactly what they have done. Maybe they will adjust something, maybe not. We have to see if we can defend a little bit better in some departments and attack because (David) Alaba and (Antonio) Rudiger were so close to Erling. It was not easy to find spaces for Erling.\n“But we will try to adjust something maybe in the second leg to be more fluid and play with a bit more rhythm because we play at home and at home we feel comfortable with our people. We are going to try.”\nThe 31-year-old de Bruyne, like the rest of City’s high-quality collection of internationals, has been outshone by Haaland’s record-shredding first season in England.\nNorwegian powerhouse Haaland has netted 51 goals in all competitions but he found Alaba and Rudiger a little less accommodating than the Premier League centre-backs he has bullied mercilessly all season.\nHe was kept relatively quiet, with Alaba denying him with one sensational covering tackle, but de Bruyne popped up to make sure City emerged from the Bernabeu with at least a draw.\nWith Real looking comfortable and threatening to add to the lead given to them by a Vinicius, de Bruyne showed again why he remains so indispensable for City as they seek to finally win the Champions League and perhaps a treble.\nHis shot from outside the area was a thing of beauty, the ball rising no more than a foot off the turf as it streaked like a missile through the Madrid air and past Thibaut Courtois.\nThe Belgian playmaker’s 14th Champions League goal for City means he is the first player in the tournament’s history to score in separate away games against Real in the knockout rounds.\nIt also swung the tie in favour of Guardiola’s side who will be slight favourites in the second leg next Wednesday at the Etihad Stadium where they are unbeaten for five years in Europe’s elite club competition.\nThey will have to be wary, however, of a Real side who will also take a large amount of comfort from the first leg as they seek to win the trophy for a record-extending 15th time.\nDespite ceding the lion’s share of possession to City, especially in the first half in which the visitors had nearly 70 per cent, they oozed serenity, never panicked, and looked razor-sharp on the counter-attack.\nIt was through the counter that they took the lead, with Eduardo Camavinga surging past Bernardo Silva, tearing into space and feeding Vinicius.\nNo wonder wily old manager Carlo Ancelotti did not look too perturbed at not winning the opening leg.\n“I think we deserved to win,” said the Real boss.\n“It was a good match and we head to the second leg with a good feeling. The result doesn’t reward us for what we did on the pitch, but this tie will be close until the last minute.\n“They had more possession in the first 30 minutes, but that didn’t worry us, because we were well positioned at the back and waited to make an effective transition.\n“In the second half, we managed to come out from the back better... and we should have won.” REUTERS, AF"},
{"url": "http://www.straitstimes.com/singapore/8-new-two-carriage-trains-to-be-added-to-sengkang-punggol-lrt-line", "title": "8 new two-carriage trains to be added to Sengkang-Punggol LRT line", "date": "2023-05-09T19:13:00+08:00", "content": "SINGAPORE – Another eight two-carriage trains will be added to the Sengkang-Punggol LRT (SPLRT)\nfleet  to boost the line’s capacity.\nMitsubishi Heavy Industries (MHI) on Tuesday said it received an order from the Land Transport Authority (LTA) for the eight SPLRT trains, which are in addition to a previous order for 17 two-car trains MHI received from LTA in January 2022.\nThe contract for the additional eight trains is valued at about $87 million, LTA said.\nThe new order of the two-car trains will be progressively delivered from the second half of 2027.\nIn February 2022, the LTA announced that it awarded a $439 million contract to a consortium made up of Mitsubishi Corporation, Mitsubishi Heavy Industries Engineering and Mitsubishi Heavy Industries Asia Pacific for 17 two-car trains that will be delivered in batches from 2024 to 2027.\nThe contract also covers the provision of a signalling system, guideway system and depot equipment.\nWith the latest order, the SPLRT network will have a total of 41 two-car trains in future.\nIt currently has 25 one-car trains, which will be phased out, and 16 two-car trains.\nThe Straits Times previously reported that each train car can accommodate 105 passengers.\nThe Sengkang-Punggol train depot – located above the North East Line (NEL) depot in Sengkang – is also\nIt will include a new train stabling area and a new maintenance workshop, as well as two new reception tracks which will shorten the trains’ launching time.\nThe expansion will also see enhanced power supply systems to support the operations of the additional trains, along with the addition of three new traction power stations to the existing five for improved traction power.\nThe LRT network connects the residential areas of Sengkang and Punggol to the NEL MRT stations. The Sengkang LRT was opened in 2003, while the Punggol LRT came into service in 2005.\nMHI said the network’s capacity is being increased to “accommodate the growing use of its branch lines, given local population growth in recent years”. According to a 2022 report by SBS Transit, the SPLRT recorded a 26.6 per cent increase in average daily ridership to 135,675 passenger trips post-pandemic.\nMr Kenji Terasawa, chief executive and head of engineering solutions at MHI Engineering, said: “We are honoured to contribute to this expansion project and look forward to continuing our partnership with LTA to provide safe and reliable transportation for people in Singapore."},
{"url": "http://www.straitstimes.com/tech/tech-news/uk-blocks-microsofts-90b-activision-deal-over-cloud-gaming-concerns", "title": "UK blocks Microsoft's $90b Activision deal over cloud gaming concerns", "date": "2023-04-27T05:09:16+08:00", "content": "LONDON - Britain will block Microsoft’s US$69 billion (S$92 billion) acquisition of “Call of Duty” maker Activision Blizzard over concerns it would hinder competition in cloud gaming, dealing an unexpected blow to the biggest-ever deal in gaming.\nThe country’s antitrust regulator said on Wednesday that Microsoft’s commitment to offer access to Activision’s multi-billion dollar “Call of Duty” franchise to leading cloud gaming platforms would not effectively\nMicrosoft’s president Brad Smith said in a statement the company remained fully committed to the acquisition and would appeal the decision, while Activision said it would “work aggressively” with Microsoft to reverse it.\nActivision’s chief executive officer Bobby Kotick told staff it was not “the news we wanted - but it is far from the final word on this deal”.\n“We will reassess our growth plans for the UK,” the company said in a separate statement. “Global innovators large and small will take note that - despite all its rhetoric - the UK is clearly closed for business.”\nShares in Activision, which also makes “Candy Crush”, “Overwatch” and “World of Warcraft”, fell nearly 12 per cent to US$76.65, moving further from Microsoft’s offer price of US$95 per share. The video-game publisher was set to erase nearly US$8 billion in market valuation, if the losses hold.\nThe gaming company also reported quarterly results on Wednesday, a day earlier than scheduled, beating quarterly bookings estimates although that seemed to do little to allay investor concerns about Britain’s move.\nShares in Microsoft rose to their highest in more than a year, a day after the maker of Office software beat Street estimates for quarterly revenue and profit.\nThe company announced its Activision bid in January 2022 to boost its firepower in a video gaming market led by Tencent and Sony.\n“We expect that Microsoft will continue to fight this,” Evercore ISI analyst Kirk Materne said in a note.\nIf Microsoft throws in the towel, it would free up more than US$60 billion in cash flow to either return to investors or make investments in AI-related offerings, he noted.\nThe Activision deal is the biggest involving technology companies the Competition and Markets Authority (CMA) has blocked, the latest sign the UK watchdog is ready to take on Big Tech after blocking in 2021 Facebook-owner Meta’s acquisition of Giphy.\nEurope will decide on the Activision deal by May 22.\nThe\nThe surprise ruling comes after the CMA last month dropped its concerns about the impact of the deal on the console market led by Sony’s market-leading PlayStation.\nThat left cloud streaming services as the remaining hurdle, which Microsoft sought to overcome by signing licensing deals with the owners of streaming platforms including Valve Corp, Nvidia and Boosteroid.\nIt had already offered Sony - a vocal opponent of the deal - a 10-year “Call of Duty” licence, in line with an agreement to bring the multi-billion dollar franchise to Nintendo’s Switch.\nThe CMA said the cloud gaming market was forecast to be worth £11 billion (S$18 billion) globally by 2026.\n“Cloud gaming is growing fast with the potential to change gaming...freeing people from the need to rely on expensive consoles and gaming PCs and giving them more choice over how and where they play games,” said CMA panel chair Martin Coleman.\n“This means that it is vital that we protect competition in this emerging and exciting market.”\nMicrosoft offers Xbox Game Pass, a subscription service for users of its Xbox console, and PC Game Pass for PC users.\nThe CMA said Microsoft had an estimated 60 per cent-70 per cent of global cloud gaming services as well as competitive advantages including owning Xbox, PC operating system Windows and cloud provider Azure. REUTER"},
{"url": "http://www.straitstimes.com/sport/football/record-breaking-world-cup-goalkeeper-carbajal-dies-aged-93", "title": "Record-breaking World Cup goalkeeper Carbajal dies aged 93", "date": "2023-05-10T08:30:00+08:00", "content": "MEXICO CITY - Former Mexico goalkeeper Antonio Carbajal, the first footballer to play in five World Cups, has died at the age of 93, local media announced on Tuesday.\nTota, as Carbajal was known, appeared in goal for Mexico at the World Cups in Brazil 1950, Switzerland 1954, Sweden 1958, Chile 1962 and England 1966, in which he made 11 caps for his country.\nHe held the record of playing in five World Cups for 32 years until 1998, when German midfielder Lothar Matthaus reached the mark.\nCarbajal’s compatriots Rafael Marquez and Andres Guardado, along with Lionel Messi and Cristiano Ronaldo have also since equalled his record.\nAlthough Carbajal said he was scouted by Real Madrid between 1950 and 1954, the Mexican never left his domestic league and played most of his career in his hometown with Club Leon. REUTER"},
{"url": "http://www.straitstimes.com/business/olam-agri-s-singapore-saudi-13-billion-dual-listing-may-launch-as-early-as-june-sources", "title": "Olam Agri’s Singapore-Saudi $1.3 billion dual listing may launch as early as June: Sources", "date": "2023-05-10T07:05:02+08:00", "content": "SYDNEY/SINGAPORE - Agri-food giant Olam Group aims to launch the dual\nand Saudi Arabia in June, two sources with knowledge of the matter said.\nThe IPO, the first of such a dual listing in the world, is subject to regulatory approval, one of the sources added.\nThe sources could not be named as the information was not yet public.\nMost of the IPO’s processes have been completed, ranging from hosting global roadshows to getting indicative commitments from anchor investors, one of the sources added.\nOlam declined to comment.\nThe dual IPO on the stock exchanges of Singapore and Saudi Arabia would make Olam Agri the first company to list in both countries and also the first non-Gulf Cooperation Council incorporated business to list in Saudi Arabia.\nThe dual listing would also solidify South-east Asia as a global IPO hot spot. The region is the only part of the Asia-Pacific region, excluding Japan, where the IPO market has grown in 2023, rising 4.5 per cent to US$2.23 billion, according to Refinitiv data.\nThe share sale would also give a lift to Singapore’s IPO activity, which amounted to only US$68.7 million in 2022, not counting IPOs of special purpose acquisition companies, versus US$1.94 billion in 2021, Refinitiv data showed.\nThe plan to list Olam Agri comes after Singapore-based commodity trader Olam sold a 35.4 per cent stake in the unit in 2022 for US$1.24 billion to Saudi Agricultural and Livestock Investment, a unit of Saudi’s sovereign wealth fund Public Investment Fund.\nThe deal valued Olam Agri at an equity valuation of US$3.5 billion, Olam said previously.\nBesides Olam Agri, Olam has plans to list its other unit, Olam Food Ingredients, as part of a business overhaul flagged three years ago. The listing will take place after Olam Agri’s IPO, Olam’s co-founder and group chief executive Sunny Verghese told a news conference in January.\nOlam is one of the world’s biggest agricultural commodity traders. It counts Singapore state investor Temasek as its largest shareholder with a 51 per cent stake, followed by Japanese trading house Mitsubishi Corp with 14.4 per cent, Refinitiv data showed. REUTER"},
{"url": "http://www.straitstimes.com/sport/basketball/joel-embiid-sixers-overpower-celtics-in-game-5", "title": "Joel Embiid, Sixers overpower Celtics in Game 5", "date": "2023-05-10T10:45:00+08:00", "content": "BOSTON - Joel Embiid scored 33 points, grabbed seven rebounds and blocked four shots to lead the Philadelphia 76ers to a 115-103 road victory over the Boston Celtics in Game 5 of the National Basketball Association’s Eastern Conference semi-finals on Tuesday night.\nTyrese Maxey added 30 points and seven rebounds for Philadelphia, who lead the best-of-seven series 3-2. The 76ers can wrap up the series on Thursday, when Game 6 will be played in Philadelphia.\nThe 76ers received 17 points, 10 assists and eight rebounds from James Harden, while Tobias Harris contributed 16 points and 11 rebounds.\nJayson Tatum led Boston with 36 points and 10 rebounds. Jaylen Brown (24) and Marcus Smart (14) were the only other Celtics who scored in double figures.\nThe 76ers never trailed after the first quarter, and the lead never dipped below nine in the second half.\nBoston were within 11 points early in the fourth quarter, but Philadelphia went up 98-81 on an Embiid three-pointer with 8min 33sec to play. The 76ers took a 113-92 lead – their largest advantage of the series – on a Maxey three-pointer with 3:57 remaining.\nBoston’s Al Horford missed each of his seven three-point attempts and did not score in the game.\nPhiladelphia had a 49-36 edge in rebounds, and Boston shot 39.8 per cent from the field (33 of 83). The 76ers hit 50.6 per cent (40 of 79).\nPhiladelphia led 33-26 after one quarter, then opened the second quarter on a 7-0 run. The Celtics closed the half with a 8-3 spurt but trailed 58-49 entering the third.\nEmbiid had 21 points and five rebounds in the first half. Tatum missed his first six shots on the night but had 15 points at the break.\nThe 76ers stretched their nine-point half-time lead to 18 points on two Harden free throws with 2:44 left in the third, then went up by 19 on a Maxey lay-up with 29 seconds left in the period. Boston trailed 88-72 with 12 minutes to play.\nThe Celtics took their third loss in six home playoff games this season. The 76ers improved to 4-1 on the road in the postseason. REUTER"},
{"url": "http://www.straitstimes.com/business/china-s-shift-away-from-big-four-auditors-has-ey-most-exposed", "title": "China’s shift away from Big Four auditors has EY most exposed", "date": "2023-05-10T07:39:53+08:00", "content": "LONDON - Among the four biggest global accounting firms, Ernst & Young (EY) is likely to be the most exposed to Beijing’s crackdown on US-linked auditors, as it stands to lose about a 10th of its China revenue.\nChina recently\nand hire locally instead in a bid to rein in foreign accountants amid what it called data security concerns. For now, the guidance applies to only central SOEs, and it’s unclear whether province-level SOEs and private companies will be included later.\nIn 2021, the Big Four audited a quarter of China’s 98 central SOEs, but EY led the pack, earning about 12 per cent of its revenue in the country from these giant corporations.\nKPMG, PwC and Deloitte got less than 4 per cent each, according to data from the Chinese Institute of Certified Public Accountants analysed by Bloomberg.\nThe bigger the pie, the harder the impact, said Mr Howard Shatz, a senior economist at Rand Corporation, adding the loss of central SOEs may have a cascading effect.\n“If you lose the Chinese state enterprises, you lose companies that are operating around the world,” Mr Shatz said. “These are highly complex companies - so the audit fees for them are pretty hefty.”\nRepresentatives for EY and Deloitte declined to comment, while PwC and KPMG did not respond to requests for comment.\nIt is not just the Big Four that are facing headwinds in China. Beijing has launched a nationwide anti-espionage crackdown on consulting firms, state media have reported, as part of efforts to tighten foreign access to sensitive information.\nBarring the Big Four could also hurt Chinese businesses, as an audit by a global firm lends credibility to their books on an international stage. An absence of that endorsement risks turning foreign investors wary.\nChina contributed 5.49 billion yuan (S$1.05 billion) to EY’s revenue in 2021, or 2 per cent of its total, of which 661 million yuan came from 11 central SOEs. Additionally, it got 1.3 billion yuan from 280 Hong Kong-listed firms.\nThe Big Four earned a combined revenue of 20.6 billion yuan from all Chinese clients in 2021, according to the Finance Ministry. Though it represents just 2 per cent of their total, the value of the Chinese market – and the Asia Pacific region more broadly – lies in its potential as growth outpaces most major economies.\nRising geopolitical tensions between the United States and China spell further trouble for EY just as it is dealing with the fallout from a failed attempt to split its audit and consulting arms. They also add to the uncertainty facing the professional services sector more broadly amid a slump and mass layoffs. BLOOMBER"},
{"url": "http://www.straitstimes.com/sport/sea-games-2023-rain-sodden-cambodian-badly-loses-race-but-wins-hearts", "title": "SEA Games 2023: Rain-sodden Cambodian badly loses 5,000m race, but wins hearts", "date": "2023-05-10T12:25:39+08:00", "content": "PHNOM PENH – A Cambodian athlete won a special place in her compatriots’ affections after persevering to complete the women’s 5,000m in torrential rain at the SEA Games, despite the winner having finished nearly six minutes earlier.\nWhen Bou Samnang did make it over the line, she broke down in tears, joining her palms in thanks to her supporters.\nThe winner, Vietnamese athletics star Nguyen Thi Oanh, had already finished the race, five minutes and 54 seconds earlier.\nThe second-last-placed competitor, Run Romdul, was also from Cambodia, which is hosting the Games in the capital Phnom Penh.\n“Although you lost, you won the hearts of Cambodia,” wrote Facebook user Mao Vanthan.\nAnother user, Chanphal Ngy, was equally effusive: “We dropped tears with you... You will be successful in life as your wishes.”\n“Your resilience is a true inspiration to all of us,” chimed in Kong Dara.\n“Your commitment to pushing through the challenges, maintaining a positive attitude, and never giving up on yourself is a testament to your strength and character.\n“You may not have won the race, but you have won our admiration and respect for your unwavering spirit.”\nShe also won a US$250 (S$330) bonus from information minister Khieu Kanharith, according to a ministry official. AF"},
{"url": "http://www.straitstimes.com/sport/pegula-upset-with-madrid-organisers-after-finalists-denied-speeches", "title": "Pegula upset with Madrid organisers after finalists denied speeches", "date": "2023-05-10T13:00:00+08:00", "content": "MADRID - World number three Jessica Pegula has criticised Madrid Open organisers after the American and her fellow women’s doubles finalists were not allowed to make speeches at the trophy ceremony.\nPegula and Coco Gauff lost the women’s doubles final 6-1, 6-4 to Victoria Azarenka and Beatriz Haddad Maia on Sunday and none of the players were given the chance to address the audience.\nThe men’s doubles finalists were allowed to do so following their match a day earlier.\n“What happened in Madrid, it was really disappointing... I had a feeling something was going to happen,” Pegula told reporters on Tuesday ahead of the Italian Open.\n“Did I think we were not going to be able to speak? No. I’ve never heard of that... in my life. I don’t know what century everyone was living in when they made that decision.”\nReuters has contacted organisers for comment.\nBBC Sport quoted organisers as saying of the decision: “The tournament will not comment on the matter.”\nGauff said the issue was not about the speech itself.\n“I have a lot of finals, so it’s not about that,” she told reporters. “It’s more about the principle behind it, so this can’t happen again for future girls, take the opportunity away from them.”\nAzarenka said on Twitter that it was “hard to explain” to her son Leo that she was not able to speak at the trophy ceremony. REUTER"},
{"url": "http://www.straitstimes.com/world/trouble-remembering-passwords-google-has-the-answer-with-passkeys", "title": "Trouble remembering passwords? Google has the answer – with passkeys", "date": "2023-05-04T13:30:00+08:00", "content": "Good news for you if you are one of those who dislike passwords: Google has introduced passkeys.\nThe search engine giant is calling it “the easiest and most secure way to sign in to apps and websites”.\nGoogle said it is a major step towards a “passwordless future”.\nThey are a new way to sign in that is both easier to use and more secure than passwords.\nThis means you would not have to rely on the name of your pet, a birthday or your mother’s maiden name.\nA passkey would let you sign in to an app and website the same way you unlock your device: by means of a fingerprint, face scan or screen lock PIN.\nThe added advantage of a passkey is that it is resistant to online attacks like phishing.\nGoogle has designed its passkeys to work with a variety of devices, according to a report by AP.\nThis means you can use them on devices such as iPhones, Windows computers and Android phones.\nBeyond the hassle of remembering them, passwords are often easy to steal or defeat, and they are frequently compromised in security breaches.\nThis is exactly why you are often required to create one with a mixture of letters, numbers and even symbols.\nThe problem with that is the more complex they become, the harder it is for you to remember them. In other words, security and ease of use are on opposing ends of the equation.\nThe other advantage of a passkey is that it would be specific to a particular website.\nThis means a scammer would not be able to steal a passkey from Tinder and use it to empty your bank account.\nYou would first have to enable them for your Google account.\nOpen the browser on your trusted device and sign in to your Google account.\nGo to the page g.co/passkeys and click the option to “Start using passkeys”, following which the passkey feature would be activated.\nIf you use an Apple device, you would first need to set up the Keychain app if you do not already use it. This app securely stores passwords and will do the same with passkeys.\nNext, create the actual passkeys that will connect your trusted device.\nIf you use an Android phone, you would automatically be ready to use passkeys, though you would still need to enable the function first.\nOn the same Google account page, you need to look for the “Create passkey” button and press it.\nIt will let you create a passkey either on the current or another device. The system will notify you if that passkey already exists.\nIf you are on a PC that does not allow you to create a passkey, it will open a QR code, which you can scan with the camera on your iPhone or Android device.\nYou might have to move the phone close to the code until the message “Set up passkey” appears on the image, and tap it.\nOnce everything is set up properly, you can sign in to Google by just entering your e-mail address.\nYour phone or device will ask for your fingerprint, face scan or a PIN.\nYour password would still exist, of course.\nBut if passkeys take off, you would not need it very much. And some day, maybe never"},
{"url": "http://www.straitstimes.com/business/kkr-macquarie-eyeing-sembcorp-s-waste-management-unit-sembwaste-sources", "title": "KKR, Macquarie eyeing Sembcorp’s waste management unit SembWaste: Sources", "date": "2023-05-10T08:09:06+08:00", "content": "HONG KONG/SINGAPORE - United States private equity group KKR & Co and Australia’s Macquarie Asset Management are among potential bidders for the waste and recycling management arm of Sembcorp Industries in a deal that could value the unit at around US$500 million (S$664 million), said two sources with knowledge of the matter.\nSembcorp, which is 49.3 per cent owned by Singapore’s state investor Temasek, has hired HSBC to run the sale of SembWaste, according to the sources. HSBC declined to comment.\nThe first round of non-binding bids are due by early June, said one of the sources, declining to be named as the matter is private.\nIn 2022, SembWaste’s earnings before interest, taxes, depreciation, and amortisation was $50 million, one of the sources added.\nPotential bidders also include global infrastructure investment manager I Squared Capital, the sources added.\nKKR and Macquarie Asset declined to comment. Sembcorp and I Squared Capital did not immediately respond to requests seeking comment.\nThe sale comes at a time when many cities in South-east Asia need more investment in the waste management sector, due to their rapid growth in population and a shift towards both greener and cleaner energy and environment.\nIn 2022, Singapore’s asset manager Keppel consortium bought an\nSembWaste is one of three public waste collectors appointed by Singapore’s National Environment Agency to provide waste and recyclable collection services to residential, schools and trade premises in the city-state, according to its website.\nBesides SembWaste, Singapore-listed Sembcorp is also involved in renewable energy businesses and has a balanced energy portfolio of 17.2GW, with 10.3GW of gross renewable energy capacity comprising solar, wind and energy storage globally, according to its website.\nShares of Sembcorp have surged 36.5 per cent year to date, beating the local benchmark stock index’s 0.2 per cent rise. It commands a market value of US$6.2 billion, according to Refinitiv data. REUTER"},
{"url": "http://www.straitstimes.com/business/debt-restructuring-firm-houlihan-bets-on-more-distress-in-china", "title": "Debt-restructuring firm Houlihan bets on more distress in China", "date": "2023-05-10T10:30:00+08:00", "content": "HONG KONG – Houlihan Lokey, a US financial services firm that has featured in some of China’s high-profile offshore restructurings, is betting on the country’s US$4.7 trillion (S$6.2 trillion) onshore credit market as a new source of expansion.\nGrowth in the Asian restructuring business for Houlihan, which has advised on the debt reorganisation of major firms from China Evergrande Group to Luckin Coffee, will largely come from China’s local market in the next six to 18 months, said Mr Brandon Gale, head of Asia restructuring.\nStaffing there may double over the next two years from about eight employees currently, he added.\n“Right now, most of our business is focused on dollar-denominated bonds in different geographies across the region. But we’re working with Chinese companies on yuan-denominated debt issues as the goal over the next couple of years,” he said at a recent media event.\nHoulihan’s shifting focus towards China’s domestic market follows a period of rapid expansion for global financial advisers in Asia as the country’s property debt crisis unleashed a record wave of offshore defaults.\nGearing up for more local opportunities also reflects the longstanding anticipation that as China’s debt market matures, authorities will allow delinquencies and bankruptcies to become a norm.\n“We’re actively watching spaces like new energy vehicle or electric vehicles given the inundation of supply in the Chinese market,” said Mr Gale.\nMs Sophia Xia, Houlihan’s co-head of China restructuring, said: “Definitely these capital structures may not be sustainable but it’s hard to say how quickly that will actually materialise, depending on the consumption demand and whether export to Europe or the Middle East can help these companies survive.”\nPatience is likely key to the success of local adventures for foreign financial advisers such as Houlihan, given China’s onshore corporate debt market has stayed surprisingly uneventful since the pandemic started.\nIn contrast to its tolerance for surging offshore repayment failures, Beijing has used a combination of tools, from easy monetary policy to encouraging debt swaps or maturity extensions, to maintain domestic financial stability in the past three years.\nHowever, authorities have repeatedly stressed the need to develop a modern, well-functioning credit market that prices risks accurately and treats defaults as a routine.\nRegulators have in recent years launched a campaign to meet that long-term goal, including overhauling China’s notoriously lenient local credit rating industry, improving information disclosure and cracking down on bond issuance irregularities.\nTo be sure, the onshore business will be “very different” from Houlihan’s offshore practice, said  Mr Gale.\n“What we want to build is a China business done in a Chinese way,” he added.\n“We’ve thought about branding, we’ve thought about bringing in strategic investors onshore to help. We’re still developing that model, and we may not be a controlling shareholder in that business when all the dust settles, but we’ll see.” BLOOMBER"},
{"url": "http://www.straitstimes.com/business/coupang-s-sales-beat-estimates-after-big-spending-pays-off", "title": "Korean e-commerce giant Coupang’s sales beat estimates after big spending pays off", "date": "2023-05-10T10:00:00+08:00", "content": "SEOUL – Coupang, the South Korean e-commerce giant backed by SoftBank Group, reported better-than-expected revenue growth after spending to expand and lock in customer demand during an online shopping slowdown.\nRevenue rose 13 per cent to US$5.8 billion (S$7.7 billion) in the quarter ended March, the United States-listed company said.\nThat beat analysts’ estimates for US$5.6 billion. Coupang posted a US$106.8 million operating profit while active customers grew 5 per cent to 19 million.\n“Our sustained focus on operational excellence allowed us to achieve this milestone even as we continue to invest hundreds of millions of dollars in capex and hundreds of millions more in developing offerings over the past year,” Mr Bom Kim, founder and chief executive officer at Coupang, said on a call with analysts.\n“Because we take the long view, we don’t expect every initiative to bear fruit immediately or evenly every quarter.”\nCoupang shares were little changed in late US trading after the results. They climbed about 18 per cent this year through Tuesday’s close.\nThe company said it is still at a single-digit share of the overall retail market that is projected to grow to US$550 billion in the next three years. Coupang is expanding faster than the market overall, Mr Kim noted, calling the opportunity ahead “staggering”.\nCoupang’s core delivery business grew exponentially during the pandemic as people bought everything from eggs and masks to home appliances through apps. While e-commerce has decelerated, the company has sustained momentum thanks in part to a fast delivery service supported by a growing network of automated fulfillment centres, which helps retain customers and merchants.\nDespite tepid growth and fierce competition locally, Coupang has managed to report quarterly profits thanks to economies of scale through the fulfillment centres.\nIts Taiwan business is still in an early stage but the firm is seeing “signs of transformative potential”, Mr Kim said.\nHe confirmed the company has shuttered its operations in Japan, where returns were below expectations.\nAlthough Coupang’s delivery business – famous for its promise of dawn delivery – has stabilised and become profitable, the company is grappling with rising costs of new businesses such as food delivery and streaming.\nIn April, Coupang Eats started to roll out discounts of 5 per cent to 10 per cent on all orders in most of the areas in Seoul, with the regions of the coverage  continuing to be expanded in coming months, said Mr Kim.\nCitigroup said Coupang is seeking to boost market share for the meals business through the discounts.\nRegarding the adoption of generative artificial intelligence (AI), Mr Kim said Coupang has been working with machine learning models across all aspects of the company’s business.\n“I think generative AI is exciting,” he added. “Like all these new technologies, we will continue to invest and look at all the tools that we can harness to deliver a better customer experience and drive operational excellence.” BLOOMBER"},
{"url": "http://www.straitstimes.com/business/banking/ocbc-q1-profit-jumps-39-to-record-188-billion-ceo-cautious-on-tighter-financial-conditions", "title": "OCBC Q1 profit jumps 39% to record $1.88 billion; CEO cautious on tighter financial conditions", "date": "2023-05-10T07:58:05+08:00", "content": "SINGAPORE – OCBC Bank posted on Wednesday record first-quarter earnings from higher interest rates, even as its chief executive cautioned that tighter financial conditions might slow global economic growth and elevate overall risks.\nSingapore’s second-largest lender saw its net profit rise 39 per cent year on year to $1.88 billion, beating the $1.74 billion estimate by analysts in a Refinitiv poll.\nOCBC’s net interest income rose 56 per cent to $2.34 billion amid a 5 per cent growth in average asset balances. Net interest margin (NIM) – a key gauge of a lender’s profitability – shot up by 75 basis points to 2.3 per cent\nNIM compares the interest income a bank generates from credit products like loans and mortgages with the interest it pays out, such as to savings accounts or fixed deposits.\nMeanwhile, OCBC’s non-interest income slipped 11 per cent to $1.01 billion. It was weighed down by declining wealth management fees that were partly offset by a rise in trading income and net realised gains from the sale of investment securities.\nGroup chief executive Helen Wong said the bank is watchful of tighter financial conditions but confident of long-term prospects in its key Asian markets, adding that it has ample buffers for uncertainties and to pursue growth opportunities.\nThe bank set aside total allowances of $110 million for potential bad loans, up from $44 million a year ago, mainly due to higher general allowances. However, the amount was lower than the $314 million set aside in the fourth quarter.\nGreater China is a key region for OCBC outside of Singapore, and the bank has started to see growth in cross-border flows from China’s reopening, said Ms Wong.\nOn the whole, growth in non-trade corporate loans and mortgages offset softer trade loans, while the wealth management business continued to attract net new money inflows, she added.\nThe bank will have to contend with a likely peak in its margins as the Fed comes to the end of its rate-hiking cycle, as well as slowing loan growth amid the higher rates.\nMs Wong expects NIM to come in around 2.2 per cent in 2023 amid low- to mid-single-digit loan growth, comparable with her previous forecast for mid-single-digit growth.\nOCBC, which pays dividends half-yearly, saw its first-quarter earnings grow by 44 per cent compared with the previous quarter. A rebound in wealth management activities drove a 14 per cent increase in fee income to $453 million that was buoyed by higher wealth management fees.\nIts numbers wrap up local banks’ earnings season. The net profit of Singapore and South-east Asia’s largest lender DBS climbed by 43 per cent to $2.57 billion, while UOB’s rose by 67 per cent to $1.5 billion"},
{"url": "http://www.straitstimes.com/business/dbs-considering-expansion-in-dubai-ceo-says", "title": "DBS considering expansion in Dubai, CEO Piyush Gupta says", "date": "2023-05-10T09:04:16+08:00", "content": "- DBS Group Holdings is considering an expansion in Dubai, making South-east Asia’s biggest lender the latest financial company to explore scaling up in the Middle Eastern business hub.\n“We’re revisiting the thesis that there is real opportunity to do more stuff out of Dubai and this region,” chief executive Piyush Gupta said on Tuesday in an interview with news anchor Yousef Gamal El-Din at the Dubai FinTech Summit.\nThe Singapore-based lender’s presence in the region is limited and “there’s an opportunity to scale it up”, he said.\nMr Gupta’s remarks underscore the growing importance of Dubai, which is emerging as a favoured destination for hedge funds and financial firms, drawn by its ease of doing business, tax-free status and its allure as a nexus for global travel.\nHubs like Dubai can act as a neutral player in a multipolar world, being able to intermediate flows from the West and the East, Mr Gupta said.\nGoldenTree Asset Management recently joined a cohort of hedge funds including Millennium Management that have opened offices in the city.\nElsewhere, some of the private equity industry’s biggest names are expanding in the Middle East to develop closer ties with the region’s deep-pocketed investors and source dealmaking opportunities.\nSeparately, Mr Gupta said the bank is reviewing its infrastructure for ways to improve its recovery capabilities, in his first public comments after the most recent disruption to digital banking services.\nThe bank was\nafter the issues Singapore’s regulator called “unacceptable”.\nTwo earlier incidents involved software glitches, he said.\n“The most recent thing was just coincidental,” he added, saying the bank’s infrastructure is robust.\nIn 2021, the bank suffered one of its worst digital disruptions in the past decade.\nIn March 2023, DBS’ digital banking services in Singapore were disrupted for about 10 hours. Just over a month later,\naccording to the bank.\n“I’m a firm believer in the fact that if you start penalising people every time something goes wrong, you will never build the kind of culture you want to build,” he said. “The culture of risk-taking, entrepreneurship and winning.” BLOOMBER"},
{"url": "http://www.straitstimes.com/business/airbnb-shares-tumble-as-muted-outlook-shows-cracks-in-travel-demand", "title": "Airbnb shares tumble as muted outlook shows cracks in travel demand", "date": "2023-05-10T07:26:08+08:00", "content": "NEW YORK - Airbnb shares tumbled after the holiday home rental company gave a cautious forecast for revenue in the second quarter, suggesting rising prices and a murky economic outlook are beginning to weigh on consumer appetite for trips.\nThe company expects revenue of US$2.35 billion (S$3.12 billion) to US$2.45 billion in the three months ending in June, representing an increase of 12 per cent to 16 per cent from a year earlier and its slowest pace of growth yet. Analysts were projecting US$2.4 billion, according to a Bloomberg survey. Airbnb said it expects earnings before interest, tax, depreciation and amortisation (Ebitda), excluding some costs, to be similar to the second quarter in 2022.\nAirbnb had benefited over the past few years from shifts in work and lifestyle due to the coronavirus pandemic. But the post-Covid-19 rush to travel is losing steam, and some consumers are reining in leisure budgets amid persisting inflation and an unsteady economy.\nAirbnb said the number of nights and experiences booked in the current period will look unfavourable compared with a year ago, when there was a surge in demand following the outbreak of the Covid-19 Omicron variant. As a result, the company expects year-on-year growth in nights and experiences booked to increase at a slower pace in the second quarter than revenue.\nIts shares fell 10 per cent to US$114.25 on Tuesday. They had gained almost 50 per cent so far in 2023 through the close of trading.\nThe forecast came on the heels of a quarter that set records in several metrics. Revenue in the three months ended March 31 increased 20 per cent to US$1.82 billion, Airbnb’s highest ever for that period. Adjusted Ebitda was US$262 million, better than Wall Street’s estimates and also a record first quarter. Earnings per share were 18 US cents, while analysts were expecting 17 US cents.\nCompanies from airlines to hotels have been increasing prices as consumers have so far shown a willingness to pay. But people may be starting to draw the line.\nBank failures, a rising rate of inflation, elevated mortgage payments and a softening labour market, especially in high-income sectors such as tech, could see tourists start to pull back on spending.\nChief executive Brian Chesky said in an interview last week that the strong demand he is expecting for this summer could be even better if not for the economic uncertainty. Airline prices are still expensive, he noted, and “when the cost of flights goes up, that impacts our business”.\nAirbnb’s results follow robust results and optimistic commentary from its online travel peers. Booking Holdings and Expedia Group both reported double-digit increases in gross bookings in the first quarter.\nIn a call with investors to discuss results, Mr Chesky said price affordability is the top priority for Airbnb. He said the hope is that the substantial supply on the platform will help ease price pressures.\nAirbnb has been taking steps to keep prices on rentals from exploding. The company rolled out more than 50 new features and upgrades in part to increase price transparency and affordability.\nIn an effort to ensure the platform has places to stay at reasonable prices, the company launched Airbnb Rooms with an average rate of US$67 per night. Guests stay in homes with hosts and share common spaces like living rooms, kitchens and backyards.\nAirbnb is also implementing a series of changes including lower fees, adding the ability to pay in instalments through a new partnership with Klarna Bank, and a new discount tool for hosts to offer the best deals. BLOOMBER"},
{"url": "http://www.straitstimes.com/business/gold-steady-as-inflation-data-could-prove-key-to-next-rate-move", "title": "Gold steady as inflation data could prove key to next rate move", "date": "2023-05-10T11:30:00+08:00", "content": "MELBOURNE – Gold held gains, with investors turning their focus to upcoming US inflation data that will influence the Federal Reserve as it\nThe precious metal has risen almost 1 per cent this week following its 1.4 per cent increase last week, to put it within reach of a record high.\nCore consumer price index figures due on Wednesday are expected to show headline inflation in the United States up by 5 per cent in April on a year-on-year basis, a level likely to be still uncomfortably high for the Fed.\nOptions traders are now betting on further rate hikes in the next couple of central bank policy meetings in June and July.\nWhile higher rates are generally negative for non-interest-bearing bullion, gold could be entering a “win-win scenario”, according to Oanda senior market analyst Ed Moya.\n“A hot inflation report will justify higher rates for longer that will cripple growth prospects and trigger a stock market sell-off,” potentially boosting short-term safe haven demand for bullion, he added.\n“A cooling round of inflation data points could vindicate calls that the Fed is done tightening and support Fed rate cuts to happen later in the year.”\nMeanwhile, a looming US debt ceiling crisis is further deteriorating investor sentiment. A failure to find a resolution presents a genuine risk to the standing of the dollar, boosting the appeal of bullion.\nSpot gold was steady at US$2,035.12 an ounce as of 9.28am in Singapore. BLOOMBER"},
{"url": "http://www.straitstimes.com/business/china-junk-dollar-bonds-hit-five-month-low-as-worries-spread", "title": "China high-yield dollar bonds hit five-month low as worries spread", "date": "2023-05-10T12:30:00+08:00", "content": "HONG KONG – Chinese high-yield dollar bonds are at their lowest level of the year, as liquidity worries about property firms dash optimism about rising new-home sales.\nJunk notes fell at least one cent on Wednesday morning, according to credit traders. Average prices dropped for a seventh straight session a day earlier, according to a Bloomberg index of the market, putting them below 70 cents for the first time since December.\nThe high-yield sector is dominated by developers which, despite several months of growing home sales, continues to see firms run into trouble.\nFrom concerns increasing last month about Sino-Ocean Group Holdings and conglomerate Dalian Wanda Group to a smaller builder facing court-ordered liquidation and KWG Group Holdings defaulting, weakened sentiment for high-yield notes resulted in early 2023 gains being erased.\nWanda dollar bonds plunged to record lows on Tuesday after Bloomberg News reported that the firm has been in talks with major Chinese banks regarding a loan-relief plan.\nThat evening, distressed builder Sichuan Languang Development said it received a delisting notice from the Shanghai Stock Exchange because of a low share price, an example of investors’ lack of faith in smaller developers’ ability to restructure their debt.\nOptimism for China’s high-yield dollar bonds was strong by early February, after a record three-month rally thanks to myriad government steps to bolster the property market.\nThe real estate sector is undergoing an uneven recovery, which is set to keep credit stress high among junk-rated issuers, Goldman Sachs analysts said in an April report.\nThey expect a still-elevated 19 per cent default rate for China property high-yield bonds this year. BLOOMBER"},
{"url": "http://www.straitstimes.com/life/entertainment/singapore-idol-taufik-batisah-is-now-also-a-spartan-race-champion", "title": "Singapore Idol Taufik Batisah is now also a Spartan race champion", "date": "2023-05-09T16:38:00+08:00", "content": "SINGAPORE – Singapore Idol winner Taufik Batisah took part in his first trail race and came in first last Saturday.\nThe singer-cum-property agent posted photos and videos on Instagram after winning the Sarawak Spartan Super 10K 25 Obstacles race.\nIn a caption, he wrote that he “took first place in my age group at my first ever 10km Spartan trail race in beautiful Miri, Sarawak”, adding his thanks to his trainers at Hybrid Strength Fitness.\nIn one of the photos, he is seen on the podium with the Singapore flag, together with the second-place runner holding a China flag and third-place runner with a Malaysia flag.\nHe also shared a photo of his hands with bloody blisters from the gruelling race.\nSpartan race obstacles are designed to test physical and mental endurance, and include climbing walls or ropes, and carrying heavy objects like chains or logs.\nTaufik catapulted to fame in 2004 when he won the first season of reality singing show Singapore Idol and went on to release five studio albums.\nIn 2019, he joined his elder brother Mustaffa Batisah as a registered property agent under the name Batisah Bros Property.\nFresh off his race win, Taufik added that he will continue training as there is still room for improvement.\n“I’m 42 years old this year and I only started joining competitions in 2022. It’s never too late to start. You can do it too,” he said, adding the hashtag #taufitness.\nHis celebrity pals, including singer-actress Rui En and actors Terence Cao and Benjamin Heng, congratulated him in the comment section.\nNetizens too chimed in, with one writing: “This one is Singapore’s idol."},
{"url": "http://www.straitstimes.com/sport/tennis/kenin-moves-into-rome-second-round-with-battling-win-fernandez-out", "title": "Kenin moves into Rome second round with battling win, Fernandez out", "date": "2023-05-10T05:03:53+08:00", "content": "ROME - Sofia Kenin was made to work hard by Cristina Bucsa at the Italian Open on Tuesday, before the former Australian Open champion prevailed 6-3 6-7(8) 7-5 to set up a second round meeting with world number two Aryna Sabalenka.\nAmerican Kenin, who was once ranked number four but has slipped to 134 in the world following her 2020 Melbourne Park triumph due to illness and injuries, was far from her best but managed to get past Bucsa in a little over three hours.\n“It was obviously tough, but I was able to somehow get through. I didn’t feel a 100 per cent but it doesn’t matter, a win is a win and I’m going to take it,” said Kenin, who converted seven of her 21 breakpoints.\n“It could have gone either way and it was a matter of who could be mentally strong. I felt tired and... after three hours I’d imagine that she was too, so I just had to battle it out.”\nFormer US Open runner-up Leylah Fernandez was beaten 7-6(4) 4-6 6-3 by Aliaksandra Sasnovich, while 2019 French Open runner-up Marketa Vondrousova overcame Kaia Kanepi 6-0 4-6 6-2 in other first round matches.\nEarlier, former doubles world number one Barbora Strycova downed Maryna Zanevska 6-1 3-6 6-3 for her first singles victory since 2020 following her return to the WTA tour at last week’s Madrid Open from a two-year maternity break.\nThe 37-year-old Czech will take on world number eight Maria Sakkari in the second round.\n“I can’t believe it,” Strycova, who celebrated her victory with her son Vincent, said. “I don’t know how it feels because I didn’t really process it.\n“I went off the court and right away grabbed my son because he was hungry. So I wasn’t really realising I won the match.\n“I’m very happy. I’m a little shy about being happy. Also, I feel a little strange because he’s here and I will be changing a diaper in a little while instead of getting a glass of wine.”\nMayar Sherif, who became the first Egyptian ever to reach a WTA 1000 quarter-final at Madrid, crashed at the opening hurdle against Russian Anna Blinkova who prevailed 2-6 6-2 6-3.\nThe men’s tournament headlined by six-times champion Novak Djokovic and Rome debutant Carlos Alcaraz begins on Wednesday. REUTER"},
{"url": "http://www.straitstimes.com/life/robert-de-niro-becomes-father-again-at-79", "title": "Meet the parent: Robert De Niro a dad again at 79", "date": "2023-05-10T08:10:00+08:00", "content": "LOS ANGELES – Robert De Niro has become a father again at the age of 79, the Raging Bull (1980) actor said in a recent interview.\nDouble-Oscar winner De Niro corrected an interviewer who suggested he only had six children, telling her it is now “seven, actually”.\n“I just had a baby,” he told ET Canada, without revealing the baby’s gender or the identity of the mother.\nDe Niro’s publicist confirmed the news to AFP.\nThe 79-year-old already shares two children with his first wife, Taxi Driver (1976) co-star Diahnne Abbott, and two more with socialite Grace Hightower, from whom he separated in 2018.\nHe also had twin sons with model Toukie Smith, whom he dated in the late 1980s and early 1990s.\nDe Niro is currently promoting his new comedy film About My Father, which will be released in United States theatres on May 26.\nRegularly voted among the greatest actors of his generation, De Niro won two Academy Awards before he was 40.\nDe Niro scored his first Oscar, for best supporting actor, in 1974‘s The Godfather Part II, followed by another in 1981 for his leading actor role as boxer Jake LaMotta in Raging Bull.\nIn his later career he has found popular, if not always critical, success with family-friendly comedies, including Meet The Parents (2000) with American actor Ben Stiller, and The Big Wedding (2013) with American actress Diane Keaton.\nOther Hollywood and entertainment stars who became fathers again later in life include film-maker George Lucas, at 69, and comedian Charlie Chaplin and singer Mick Jagger – both at 73. AF"},
{"url": "http://www.straitstimes.com/life/entertainment/at-the-movies-living-is-life-affirming-new-asterix-obelix-flick-has-few-bright-spots", "title": "At The Movies: Living is life-affirming, new Asterix & Obelix flick has few bright spots", "date": "2023-05-10T11:00:00+08:00", "content": "A civil servant in 1953 London learns he has terminal cancer. Bill Nighy earned an Academy Award nomination for his quietly devastating turn as a drab, lonely widower reckoning with his impermanence.\nIf anyone is going to reinterpret Japanese master Akira Kurosawa’s 1952 classic Ikiru, which was itself inspired by Russian writer Leo Tolstoy’s 1886 novella The Death Of Ivan Ilyich, it may as well be a Nobel Laureate no less than British-Japanese author Kazuo Ishiguro.\nLiving was, unsurprisingly, Oscar-nominated for his adapted screenplay, along with Nighy for Best Actor.\nDirector Oliver Hermanus neatly transposes the bureaucracy and cultural reticence of 1950s Japan to post-war England, where Nighy’s Mr Williams apathetically shuffles documents at his desk every day as the head of London County Council’s Public Works Department.\nShrivelled and solemn in his funereal suit and bowler hat, Williams is a dead man walking long before his grim diagnosis. He now wants to “live a little” – but does not know how.\nHe tries a boozy night out with a local bohemian (Tom Burke). But it is the spirited youth of a junior female employee, wonderfully played by Aimee Lou Wood (Sex Education, 2019 to present), that becomes his awakening – so what if their blossoming friendship attracts gossip?\nWilliams resolves to spend the few months he has left redeveloping an abandoned bomb site into a children’s playground, and Nighy remains a masterclass in understatement as his character, with sudden vigour, badgers the city authorities to see the construction through.\nThe poignancy lies in the modesty of the project.\nWhat makes life worthwhile? Williams finds his purpose in the face of death, and his graceful and moving rebirth is a reminder to live while alive.\nThe story of a dying man is elegantly transformed into a life-affirming parable both optimistic and joyful.\nThe year is 50BC. Gaul’s indomitable pair of title warriors come to the aid of a Chinese princess (Julie Chen), journeying from their village to save the Middle Kingdom from a coup even as Julius Caesar (Vincent Cassel) leads his Roman army east in his imperialist campaign.\nThe Asterix series of Franco-Belgian comics, created in 1959 by Rene Goscinny and Albert Uderzo, endures as a French cinema blockbuster franchise.\nAsterix & Obelix: The Middle Kingdom is the first of the five live-action adventure comedy movies without French star Gerard Depardieu in the role of Obelix.\nGilles Lellouche is the new Obelix and he looks befuddled. How is it that his best friend Asterix (Guillaume Canet), he must be wondering, is now a vegan fretting over the ingredients in their magic potion?\nCanet doubles as director and wrote the original story, the first of the films to not be based on any of the 39 published volumes, and he has made the endearing heroes churlish and dumb with his wrong-headed idea to modernise them. It is an ugly sight, watching Asterix and Obelix row.\nThey also pine for unrequited loves: Asterix for the princess and Obelix for her bodyguard Kah Ra Tay (read: karate), played by Leanna Chea.\nThe duo’s latest foreign crusade is a €65 million (S$94.7 million) folly that sidelines the bromance for bad puns and slapstick, anachronisms such as a Citroen 2CV chariot, a bloated cast that includes Swedish footballer Zlatan Ibrahimovic, and special effects, especially in the epic final battle against the Romans.\nCassel is at least mightily droll as pompous Caesar, hamming it up with Marion Cotillard’s Queen Cleopatra, who breaks his heart by leaving him for gym teacher Tabascos (Florent Manaudou).\nThere are few bright spots in this Gaul-ling retelling of a beloved comic book"},
{"url": "http://www.straitstimes.com/life/entertainment/hairstylist-addy-lee-slams-fellow-mdada-co-founder-pornsak-in-two-hour-live-stream", "title": "Hairstylist Addy Lee slams fellow Mdada co-founder Pornsak in two-hour live stream", "date": "2023-05-09T18:28:00+08:00", "content": "SINGAPORE – Malaysia-born local celebrity hairstylist Addy Lee went on a two-hour tirade against fellow Mdada founder, host Pornsak, on Facebook Live on Monday night.\nLee’s main beef appeared to be an accusation of alleged embezzlement, supposedly levelled by Pornsak against an Mdada staff member who worked as Lee’s assistant.\nLee, 52, Pornsak, 41, and local actress-host Michelle Chia, 47,\nIt has come under scrutiny recently\namong other complaints lodged with the Consumers Association of Singapore.\nPornsak, who is Thai Chinese and based in Singapore,\nciting a generation gap between himself and the other two founders, as well as differences in views on “corporate governance”.\nMdada\nand Pornsak later clarified he had no intention of defaming his former company.\nLee also\ndue to ill health, which he revealed in a shock announcement.\nIn the live stream, during which he appeared animated and often angry, he said he was speaking in his personal capacity.\nLee initially did not refer to Pornsak by name, calling him “my ex-CEO”, but later responded to comments to say: “Is it the man or the woman? Of course I’m talking about the man. Michelle is a very good girl.”\nLee also accused Pornsak of bullying and defaming the staff member.\n“If it’s misappropriation, why didn’t you call the police? You only gave a warning letter, why did you force the person to sign the warning letter?” Lee said.\nHe added: “I am waiting for your reply and I’m ready for your lawyers. Mine are ready too.”\nLee repeatedly said Pornsak was two-faced and called him a “smiling tiger”.\nPornsak, who appeared to be in South Korea from his Instagram Stories posted on Tuesday afternoon, has not responded to Lee’s online rant.\nDespite falling out with Pornsak, Lee appeared to still be on good terms with Chia, saying she was having a difficult time handling the company on her own and was working hard to “have everything owed to customers cleared within a month”.\nHe added that she was “crying almost every night”, but has no plans to close down the company or regroup under a new name"},
{"url": "http://www.straitstimes.com/life/arts/sifa-2023-talking-rice-cookers-in-jaha-koo-s-cuckoo-tell-south-korea-s-dark-history", "title": "Sifa 2023: Talking rice cookers in Jaha Koo’s Cuckoo tell South Korea’s dark history", "date": "2023-05-10T12:00:00+08:00", "content": "SINGAPORE – Talking rice cookers take centre stage in Jaha Koo’s Cuckoo and they do more than croon that your rice is ready. These ones smile, sing songs and deliver a dose of social commentary.\n“I find them quite beautiful objects. But I wanted to develop their speaking, expression and emotional skills,” says the South Korean artist, who will perform with his modified Cuckoo-brand cookers at the Drama Centre Black Box on May 27 and 28 as part of the Singapore International Festival of Arts (Sifa).\nAlready a subscriber?\nGet exclusive reports and insights with more than 500 subscriber-only articles every month\nNo contract\nST app access on 1 mobile device\nSubscribe now\nAll subscriber-only content on ST app and straitstimes.com\nEasy access any time via ST app on 1 mobile device\nE-paper with 2-week archive so you won't miss out on content that matters to yo"},
{"url": "http://www.straitstimes.com/life/entertainment/pesta-raya-2023-orkestra-melayu-singapura-brings-keroncong-music-back-to-the-fore", "title": "Pesta Raya 2023: Orkestra Melayu Singapura brings keroncong music back to the fore", "date": "2023-05-10T12:20:00+08:00", "content": "SINGAPORE – Mr Amri Amin, music director of home-grown Malay orchestra Orkestra Melayu Singapura (OMS), remembers a time when keroncong music was the popular music of its day in Singapore.\n“Back in the 1970s, you could hear it on the radio,” he recalls fondly.\nAlready a subscriber?\nGet exclusive reports and insights with more than 500 subscriber-only articles every month\nNo contract\nST app access on 1 mobile device\nSubscribe now\nAll subscriber-only content on ST app and straitstimes.com\nEasy access any time via ST app on 1 mobile device\nE-paper with 2-week archive so you won't miss out on content that matters to yo"},
{"url": "http://www.straitstimes.com/life/entertainment/pesta-raya-2023-indonesian-alt-rockers-efek-rumah-kaca-return-to-singapore-after-13-years", "title": "Pesta Raya 2023: Indonesian alt-rockers Efek Rumah Kaca return to Singapore after 13 years", "date": "2023-05-10T12:20:00+08:00", "content": "SINGAPORE – There is more to pop music than just love songs, say Indonesian alternative rockers Efek Rumah Kaca.\nWhen the quartet released their self-titled debut album in 2007, one of the more prominent songs from the release was Cinta Melulu, a critique on the music industry’s over-reliance on the tired cliche of romantic tunes.\nAlready a subscriber?\nGet exclusive reports and insights with more than 500 subscriber-only articles every month\nNo contract\nST app access on 1 mobile device\nSubscribe now\nAll subscriber-only content on ST app and straitstimes.com\nEasy access any time via ST app on 1 mobile device\nE-paper with 2-week archive so you won't miss out on content that matters to yo"},
{"url": "http://www.straitstimes.com/life/entertainment/pesta-raya-2023-dayang-nurfaizah-aims-to-reignite-interest-in-traditional-malay-music-among-youth", "title": "Pesta Raya 2023: Dayang Nurfaizah aims to reignite interest in traditional Malay music among youth", "date": "2023-05-10T12:20:00+08:00", "content": "SINGAPORE – In recent years, Malaysian singer Dayang Nurfaizah has reinvented herself from an R&B-pop singer to a champion of traditional Malay music.\nIt proved to be a winning move. Her 2021 album of reimagined traditional songs, Belagu (“singing” in the Sarawak dialect), won three prizes at Malaysian music awards show Anugerah Industri Muzik (AIM) in 2022, including best song arrangement for her rendition of classic song Tudung Periuk.\nAlready a subscriber?\nGet exclusive reports and insights with more than 500 subscriber-only articles every month\nNo contract\nST app access on 1 mobile device\nSubscribe now\nAll subscriber-only content on ST app and straitstimes.com\nEasy access any time via ST app on 1 mobile device\nE-paper with 2-week archive so you won't miss out on content that matters to yo"},
{"url": "http://www.straitstimes.com/world/attack-near-tunisia-synagogue-kills-4", "title": "4 killed in attack near Tunisia synagogue", "date": "2023-05-10T08:10:00+08:00", "content": "TUNIS – An attack near a synagogue in Tunisia killed two security officers and two visitors on Tuesday, the government said.\nThe attack came at the time of an annual pilgrimage to the island of Djerba that draws hundreds of Jews from Europe and Israel.\nThe attack was staged by a guard at a naval installation on Djerba who used his weapon to shoot a colleague and seize his ammunition before heading towards the synagogue, the Interior Ministry said in a statement.\nThe attacker fired indiscriminately at security units located near the synagogue, killing the two visitors and another security officer, as well as injuring five security officers and four visitors.\nSecurity forces then shot him dead, the Interior Ministry said.\nThe Tunisian Foreign Ministry said one of the visitors killed was French and one was Tunisian.\nVideo posted on social media that Reuters was not immediately able to verify showed frightened-looking people standing in a courtyard as a gunshot rang out. Residents of the island said they had heard an exchange of fire.\nThe authorities did not identify a motive for the attack.\nHowever, militants have previously targeted the pilgrimage in Djerba and have staged other attacks in the country.\nTunisia’s last significant attack was a blast targeting the police outside the United States embassy in 2020 that killed one officer.\nTwo suicide blasts targeted the police outside of the French embassy in 2019, also killing one officer.\nMilitants killed scores of tourists in two separate attacks at a beach resort and a Tunis museum in 2015.\nThe annual pilgrimage to Africa’s oldest synagogue regularly draws hundreds of Jews from Europe and Israel to Djerba, a holiday destination off the coast of southern Tunisia, 500km from the capital Tunis.\nThe pilgrimage has had tight security since Al-Qaeda militants attacked the synagogue in 2002 with a truck bomb, killing 21 Western tourists.\nMainly Muslim Tunisia is home to one of North Africa’s largest Jewish communities.\nThough they now number fewer than 1,800 people, Jews have lived in Tunisia since Roman times.\nUS ambassador Joey Hood visited the synagogue on Monday along with the US envoy for monitoring and combating anti-semitism, Ms Deborah Lipstadt, according to US embassy post on Twitter. REUTER"},
{"url": "http://www.straitstimes.com/world/united-states/biden-says-us-default-is-not-an-option", "title": "Biden says US 'default is not an option'", "date": "2023-05-10T08:00:00+08:00", "content": "WASHINGTON – President Joe Biden said on Tuesday he made clear in a meeting with top Republican lawmakers that a United States default “is not an option”, as both sides\nRepublican House Speaker Kevin McCarthy and Mr Mitch McConnell, the Senate minority leader, met with Mr Biden at the White House in the latest round of a power struggle\nThe Republicans were also joined by the top two congressional Democrats: Senate Majority Leader Chuck Schumer and House Minority Leader Hakeem Jeffries.\nWhile they did not reach an agreement on raising or suspending the debt ceiling, the group will meet again on Friday.\n“We need to take the threat of default off the table,” Mr Biden said after the talks, warning of dire economic consequences that would ensue.\nAsked if he was considering postponing his upcoming trip to Asia for Group of Seven meetings, Mr Biden added that he is “still committed” to attending but added that the debt ceiling talks were crucial.\nHe conceded it was “possible” he did not make the trip, telling reporters: “If somehow we got down to the wire and still haven’t resolved this... I would not go.” AF"},
{"url": "http://www.straitstimes.com/world/united-states/us-opens-embassy-in-tonga-in-new-pushback-against-china-in-pacific", "title": "US opens embassy in Tonga in new pushback against China in Pacific", "date": "2023-05-10T08:03:00+08:00", "content": "WASHINGTON – The United States has opened a new embassy in Tonga, the State Department said on Tuesday, part of efforts to step up the US diplomatic presence in the Pacific region to counter China.\nThe US “officially opened the US Embassy in Nuku’alofa on May 9, 2023”, State Department spokesman Matthew Miller said in a statement.\n“This opening symbolises the renewal of our relationship and underlines the strength of our commitment to our bilateral relations, to the people of Tonga, and to our partnerships in the Indo-Pacific region,” the statement said.\nMr Miller added that the embassy would allow Washington to deploy additional diplomatic staff and resources, including the potential appointment of a resident ambassador to Tonga, with which the US has had diplomatic relations since 1972.\nWashington\nafter a 30-year absence, the top US diplomat for East Asia, Mr Daniel Kritenbrink, said on May 3\nHe said Washington is continuing to engage with Vanuatu and Kiribati about opening proposed new embassies in those countries.\nDespite the diplomatic push, the Solomon Islands announced in March it had\nto upgrade an international port in Honiara.\nThe US and regional allies Australia and New Zealand have had concerns that China has ambitions to build a naval base in the region since the Solomon Islands struck a security pact with Beijing in 2022.\nWashington\nwith the Marshall Islands, Palau and the Federated States of Micronesia under which it retains responsibility for the islands’ defence and gains exclusive access to huge swathes of the Pacific.\nThe embassy announcement came after the White House said on Tuesday that President Joe Biden will become the first US sitting president to\nfollowing the Group of Seven summit in Japan, underscoring his administration’s investment in the Pacific region to counter China. REUTER"},
{"url": "http://www.straitstimes.com/world/europe/britain-set-to-blacklist-russias-wagner-group-report", "title": "Britain set to blacklist Russia’s Wagner group: Report", "date": "2023-05-10T08:30:00+08:00", "content": "LONDON – Britain is set to formally blacklist Russia’s mercenary force Wagner group as a terrorist organisation to increase pressure on Russia, The Times newspaper reported on Tuesday.\nWagner mercenaries have spearheaded Russia’s months-long assault on Bakhmut in the industrial Donbas region.\nAfter two months of building a legal case, proscription or a formal blacklisting of the group was “imminent” and likely to be enacted within weeks, the newspaper reported citing a government source.\nThis would make it a criminal offence to belong to Wagner, attend its meetings, encourage support for it or carry its logo in public, The Times said.\nIt would also impose financial sanctions on the group and there would be implications for Wagner’s ability to raise money if any funds went through British financial institutions, the newspaper added.\nBritain’s foreign ministry did not immediately respond to a Reuters request for comment.\nBakhmut has been under Russian attack for more than nine months, with Russia’s Wagner Group mercenaries leading repeated attempts to advance on what was once a city of 70,000.\nThe group’s leader, Mr Yevgeny Prigozhin, said in a social media message on Monday that his troops were beginning to receive ammunition needed to press their advance.\nTroops had advanced a maximum of 130m amid fierce fighting, Mr Prigozhin said. REUTER"},
{"url": "http://www.straitstimes.com/world/united-states/former-fox-news-host-tucker-carlson-will-relaunch-his-show-on-twitter", "title": "Former Fox News host Tucker Carlson will relaunch his show on Twitter", "date": "2023-05-10T08:55:00+08:00", "content": "NEW YORK CITY – Former Fox News host Tucker Carlson,\nsaid on Tuesday he would relaunch his show on Twitter “soon”.\nFox News Media and Mr Carlson agreed to part ways in April, shortly after parent company Fox Corp\nin which the top-rated host played a starring role.\nThe outspoken Mr Carlson embraced conservative issues and delivered his views with a style that made his prime time show, “Tucker Carlson Tonight”, the highest-rated cable news programme in the key 25 to 54-age demographic on the most-watched United States cable news network.\nRatings slumped after his departure.\n“Starting soon, we’ll be bringing a new version of the show we’ve been doing for the last six and a half years to Twitter,” Mr Carlson said in a video posted on the social media platform. “We bring some other things too, which we’ll tell you about. But for now, we’re just grateful to be here.”\nMr Carlson’s announcement comes weeks after Twitter-owner Elon Musk sat for a two-part interview with Mr Carlson on Fox News.\nMr Musk, who is chief executive of Twitter and has referred to himself as a “free speech absolutist”, has said his goal is to make Twitter a digital town hall where users can share diverse viewpoints.\n“We have not signed a deal of any kind whatsoever,” Mr Musk tweeted on Tuesday. “Mr Tucker is subject to the same rules & rewards as all content creators.”\nThat includes subscription and a share of advertising revenue, Mr Musk said, adding, “still working on the software needed for (the) latter”.\nMr Musk said he hopes that others, “particularly from the left”, would also choose to be content creators on Twitter.\nAxios reported that Mr Carlson’s lawyers sent a letter to Fox accusing it of fraud and breach of contract.\nMr Carlson’s attorney did not respond to requests for comment. A spokesman for Fox Corp declined to comment. REUTER"},
{"url": "http://www.straitstimes.com/asia/australianz/how-much-is-sleep-worth-air-new-zealand-prices-in-economy-bunk-beds", "title": "How much is sleep worth? Air New Zealand prices in economy bunk beds", "date": "2023-05-10T09:38:00+08:00", "content": "WELLINGTON – Sleep can be almost priceless for passengers jammed upright in economy class on long haul flights. Now, Air New Zealand plans to sell it for around US$100 (S$133) an hour.\nThe airline is installing bunk beds on its ultra-long Auckland-New York and Auckland-Chicago routes in 2024.\nFour-hour sessions, only available for travellers in economy class, will probably cost between NZ$400 (S$336) and NZ$600, Air New Zealand said on Wednesday. That works out at US$64-US$95 per hour. The exact price has not yet been determined.\n– will be available from September 2024.\nEach bed will have a pillow, sheets and blanket, ear plugs, and a reading light. Passengers will be limited to one booking per flight, and time limits are set to be strictly enforced.\n“Crew will politely wake any passengers who sleep through,” Air New Zealand said.\nCustomers on the 17-hour direct New York flights – launched in September 2022 – can already opt for Air New Zealand’s Skycouch, which transforms a row of three economy seats into an improvised bed. BLOOMBER"},
{"url": "http://www.straitstimes.com/world/europe/germany-looking-overseas-for-workers-to-ease-acute-labour-shortages", "title": "Germany looking overseas for workers to ease acute labour shortages", "date": "2023-05-10T11:47:00+08:00", "content": "LONDON - Germany wants to attract skilled workers from overseas, including Kenya, to reduce acute labour shortages that are becoming a drag on the German economy.\n“We see great potential in Kenya for the migration of skilled workers in many areas of our economy,” German Chancellor Olaf Scholz said during a visit to the East African state over the weekend.\nAlready a subscriber?\nGet exclusive reports and insights with more than 500 subscriber-only articles every month\nNo contract\nST app access on 1 mobile device\nSubscribe now\nAll subscriber-only content on ST app and straitstimes.com\nEasy access any time via ST app on 1 mobile device\nE-paper with 2-week archive so you won't miss out on content that matters to yo"},
{"url": "http://www.straitstimes.com/world/musk-says-video-and-audio-calls-coming-to-twitter", "title": "Musk says video and audio calls coming to Twitter", "date": "2023-05-10T10:35:00+08:00", "content": "NEW YORK – Twitter boss Elon Musk on Tuesday put out word that audio and video calls are coming to the platform.\n“Coming soon will be voice and video chat from your handle to anyone on this platform,” Mr Musk said in a tweet.\n“So you can talk to people anywhere in the world without giving them your phone number.”\nIn a subsequent comment fired off on Twitter, Mr Musk contended that the WhatsApp messaging service operated by Meta “cannot be trusted”.\nA messaging feature at Twitter would compete with an array of free services including Messenger, Signal, Telegram and WhatsApp.\nMr Musk added that Twitter on Wednesday will start encrypting direct messages on the platform, scrambling content to safeguard privacy.\nSince\nMr Musk has implemented changes in seemingly impulsive ways, sometimes causing chaos for users.\nThe Twitter boss has talked publicly of building an all-purpose “X” application that combines messages, payments and more.\nMr Musk recently\ngetting rid of the Twitter company name but continuing to use it for the service. AF"},
{"url": "http://www.straitstimes.com/world/united-states/us-urges-who-to-invite-taiwan-to-observe-may-meeting", "title": "US urges WHO to invite Taiwan to observe May meeting", "date": "2023-05-10T12:35:00+08:00", "content": "WASHINGTON – The United States is encouraging the World Health Organisation (WHO) to invite Taiwan as an observer at its annual meeting in Geneva from May 21 to 30, Secretary of State Antony Blinken said on Tuesday.\nChina, which considers Taiwan to be one of its provinces, began blocking its participation in the WHO’s annual assembly from 2017, in a diplomatic campaign to isolate the island. Taiwan rejects the Chinese sovereignty claims.\n“Inviting Taiwan as an observer would exemplify the WHO’s commitment to an inclusive, ‘health for all’ approach to international health cooperation,” Mr Blinken said in a statement.\nThe US support for participation is in line with Washington’s one-China policy, he added.\nIn a statement, Taiwan’s Foreign Ministry thanked the US for its strong support for participation, adding that the island’s exclusion would be “completely beyond reason” and harm global health cooperation. REUTER"},
{"url": "http://www.straitstimes.com/world/world-not-ready-yet-to-switch-off-fossil-fuels-cop28-host-uae-says", "title": "World not ready yet to ‘switch off’ fossil fuels: COP28 host UAE", "date": "2023-05-10T12:15:00+08:00", "content": "WASHINGTON – The United Arab Emirates said on Tuesday that countries should agree to phase out fuel emissions – not the production of oil, gas and coal – at the upcoming United Nations climate change negotiations that it will host this December.\nThe comments reflect deep divisions between nations over how to combat global warming ahead of the talks, called COP28. Some wealthy Western governments and climate-afflicted island nations have been pushing for a phase out of fossil fuels, while resource-rich countries have campaigned to keep drilling and mining.\nUAE Minister of Climate Change and Environment Mariam Almheiri told Reuters in an interview that phasing out fossil fuels would hurt countries that depend on them for revenue or can not easily replace them with renewable sources.\nShe favoured phasing out fossil fuel emissions using capture and storage technologies while ramping up renewable energy, saying this strategy lets countries fight warming while continuing to produce oil, gas, and coal.\n“The renewable space is advancing and accelerating extremely fast but we are nowhere near to be able to say that we can switch off fossil fuels and solely depend on clean and renewable energy,” Ms Almheiri said on the sidelines of the Agriculture Innovation Mission (AIM) for Climate conference in Washington.\n“We are now in a transition and this transition needs to be just and pragmatic because not all countries have the resources,” she added.\nThe UAE is co-hosting the AIM conference with the United States.\nover 80 countries including the EU and small island nations agreed to include language in the final outcome calling for a phase down of all fossil fuels. Countries including Saudi Arabia and China urged Egypt not to include that language in the final text.\nThis month, G7 countries agreed to hasten their phaseout of fossil fuel consumption, although they did not set a firm date.\nMs Almheiri pointed to the UAE’s example of relying on new carbon capture technology and renewables to decrease the emissions intensity of the Opec-member’s oil and gas operations.\nThe UAE has a goal to get 50 per cent of its electricity from renewables by 2050 from the current level of 25 per cent, and could strengthen that goal, she said.\nMs Almheiri added that alongside energy, global food supply will be a major focus of COP28 because it accounts for nearly a third of global emissions.\nAs with energy, technology and innovation can solve food security problems, Ms Almheiri said, noting that it has helped the UAE, with its parched desert landscape, devise a food security strategy.\nTackling inefficiencies of the global food system can also help address problems like malnutrition, food waste and climate change all at once, she said.\n“We are making sure that the food systems dialogue is on centre stage along with the energy dialogue at COP28,” she said.  REUTER"},
{"url": "http://www.straitstimes.com/asia/east-asia/china-warns-severe-heat-means-another-summer-of-power-risks", "title": "China warns severe heat means another summer of power risks", "date": "2023-05-10T10:50:00+08:00", "content": "BEIJING – Asia’s brutally hot weather is expected to hit China this summer, threatening a new round of power shortages that in 2022 disrupted global supply chains of everything from cars to solar panels.\nThe electricity supply situation will be tight across the entire nation this summer, state-run China Energy News reported, citing the State Grid Energy Research Institute.\nCentral, eastern, and south-western provinces are likely to experience shortages during periods of peak demand, according to the institute.\nA\neven before the official start of the Northern Hemisphere summer.\nIt has sent temperatures to\nshut schools early in the Philippines and\nClimate change is exacerbating the frequency of extreme weather incidents, according to scientists at research groups like World Weather Attribution.\nIn China, temperatures in most parts of the nation will be relatively high this summer, with several regions forecast to experience periodic heatwaves, according to the China Meteorological Administration.\nMore frequent droughts and flood-inducing rainstorms are also expected.\nIn 2022,\ndried up the Yangtze River, with water reaching the lowest level on record in some stretches.\nThat caused severe power shortages in areas dependent on hydroelectricity, such as Sichuan and Yunnan provinces. It led officials to curtail supply to factories to ensure people could run air-conditioners at home.\nToyota Motor Corp and Honda Motor Co were among impacted companies.\nIn Yunnan, a key aluminium hub, power rationing began anew in April after another severe drought.\nExtreme weather is also affecting crops from rubber to peanuts, potentially requiring more imports to fill the gap and roiling global trade flows.\nBeijing has prepared by ramping up production of coal, still its most important source of electricity even as utilites add record amounts of new wind and solar.\nApprovals have also been granted for a massive expansion of power plants using the fuel, many of which are intended to be fully utilised only at times of stress on power supply.\nCurrent high coal inventories mean a nationwide power crisis is unlikely, according to BloombergNEF analyst Nannan Kou. BLOOMBER"},
{"url": "http://www.straitstimes.com/asia/australianz/body-found-in-new-zealand-caves-where-teen-is-missing", "title": "Body found in New Zealand caves where teen is missing", "date": "2023-05-10T10:30:00+08:00", "content": "WELLINGTON – New Zealand police said on Wednesday they had found a body in the caves where a high school student went missing on a school trip a day earlier.\nLocal media reported a flash flood had washed through and swept away the teenager.\nOne student went missing at the Abbey Caves near Whangarei on the upper North Island after a group of 15 high school students and two adults got into difficulty amid a heavy rainstorm. The remaining 16 are accounted for.\nThe police said in a statement that emergency rescue crew had located and recovered a body late on Tuesday evening, but formal identification has yet to take place.\n“We acknowledge this event has been very distressing for the school and wider community, and that there are a number of questions the public will have,” the police said.\nThe incident happened as heavy rain swept across the upper North Island causing flooding and closing schools and roads.\nAuckland, New Zealand’s largest city, remains under a state of emergency.\nHowever, Ms Rachel Kelleher from Auckland Emergency Management said at a briefing on Wednesday that most roads were now open and public transport was operating.\nCouncil teams will be out assessing damage to buildings on Wednesday, she added. REUTER"},
{"url": "http://www.straitstimes.com/asia/se-asia/thai-queen-s-basketry-bags-a-hit-with-fashionistas-after-appearance-at-king-charles-coronation", "title": "Thai Queen’s basketry bags a hit with fashionistas after appearance at King Charles’ coronation", "date": "2023-05-10T10:25:00+08:00", "content": "LONDON – Thailand’s King and Queen were in London from May 4 to 7 to attend\nQueen Suthida was spotted with a hand-woven bag made of vines, also known as a Yan Lipao purse, which drew praise on social media.\nOne netizen tweeted: “That purse is fabulous. Anyone knows who made it?”\nLipao is a plant in a climbing fern family commonly found in rainforests and is native to the Nakhon Si Thammarat province in Southern Thailand. It is a suitable material to be woven as bags due to its sturdy and tough fibre.\nYan Lipao basketry has grown in popularity in other parts of the world as Queen Suthida promotes it often to generate income for people in the South of Thailand. THE NATION/ ASIA NEWS NETWOR"},
{"url": "http://www.straitstimes.com/asia/south-asia/indian-villages-in-north-eastern-manipur-state-burnt-to-ashes-in-ethnic-violence", "title": "Indian villages in north-eastern Manipur state burnt to ashes in ethnic violence", "date": "2023-05-10T11:23:00+08:00", "content": "HEIROKLIAN, India – The road to Heiroklian is smooth and freshly laid, with a sign proclaiming it part of an Indian government development initiative. But ethnic violence has reduced the village itself to little more than smouldering ashes.\nMr Sanatomba picked through the ruins of his sister’s home in the north-eastern state of Manipur, trying to salvage anything of value, but could only recover a traditional stool.\n“This used to be my sister’s kitchen,” the 20-year-old says.\n“That was her room and she kept her TV there, the fridge there, the almirah (cupboard) for clothes there. But now everything she shared with her husband, four children and other family members is gone forever.”\nin the hilly border region in clashes between the majority Meitei people, who are mostly Hindus, and the mainly Christian Kuki tribe.\nwhile around 23,000 residents have fled their homes for the safety of ad-hoc army-run camps for the displaced.\nMr Sanatomba’s sibling is among them. They are Kuki, and he is sure she and her family will never be able to return.\n“She told me to come here and look for anything I can find,” he says, his hands and feet covered in black soot.\nThe rest of the village suffered a similar fate, its three settlements littered with broken doors, burnt-down water tanks, and forced-open metal trunks.\nThe towering village church, a school building, and even a jackfruit tree were set on fire by the attackers.\nThe raiders stole residents’ cattle and poultry, Mr Sanatomba said.\n“Those animals they couldn’t take alive, they killed and took away as meat.\n“I am afraid of Meitei people.”\nThe far-flung states of north-east India – sandwiched between Bangladesh, China and Myanmar – have long been a tinderbox of tensions between different ethnic groups.\nThe spark for the latest ethnic clash was a protest about plans to give the Meitei “Scheduled Tribe” status.\nA form of affirmative action to combat structural inequality and discrimination, that classification would give them guaranteed quotas of government jobs and college admissions.\nViolence erupted in the regional capital Imphal and elsewhere, with protesters setting fire to vehicles and buildings.\nAccording to villagers, Meitei mobs armed with guns and petrol cans then attacked Kuki settlements in the hills.\nThe authorities are concerned there could be more reprisal attacks “as both communities have now accumulated weapons”, an army officer said.\n“Are you sure that none of you have any weapons that you would like to surrender?“ a senior officer asked a Kuki gathering at a village outside Imphal on Monday.\n“The other community has promised to surrender their weapons if you do too,” he added. “I want you to consider this as it doesn’t help either community to have these weapons in circulation.”\nNone of the mostly male audience did so.\nMr Thanglallem Kuki, 32, a teacher at a private school, watched from a hilltop as his village of Kamuching was attacked and burnt to the ground.\nHe spent two nights in the jungle before being rescued and taken to an army camp.\nHe said the Meitei mob went from house to house, retrieving valuables, electronic gadgets, cooking gas cylinders, and even mattresses, loading their loot into vehicles.\n“After that they burnt the houses and they were burning one house to another house.\n“For the first time when they burnt the houses, they left some houses unburnt and they stormed in after two days again and they completely burnt it.”\nHe had been left with nothing, he said.\n“We were looking and crying with broken hearts and we looked down on our houses being burnt to ashes with helplessness and without hope.” AF"},
{"url": "http://www.straitstimes.com/asia/se-asia/asean-must-stay-cohesive-and-united-given-troubled-external-environment-says-pm-lee", "title": "Asean must stay cohesive and united, given troubled external environment, says PM Lee", "date": "2023-05-10T12:00:00+08:00", "content": "LABUAN BAJO - Asean countries cooperated well during the Covid-19 pandemic and the grouping must stay cohesive and united at the highest levels given the troubled global outlook, said Prime Minster Lee Hsien Loong on Wednesday.\nAddressing fellow South-east Asian leaders on the first day of the 42nd Asean Summit, PM Lee called on them to continue providing opportunities for the region’s people to prosper and engage external partners.\nLeaders of the regional grouping are in Labuan Bajo, a town on the western tip of Indonesia’s Flores island, for the\nSaid PM Lee: “The world has come through the Covid-19 pandemic, but the global environment is increasingly troubled. Against this backdrop, Asean must press on with our regional integration efforts.”\nOne way for the bloc to do so is to deepen its economic collaboration and expand into new growth areas, such as the digital and green economies.\nPM Lee stressed that economic integration must always remain Asean’s priority.\nUnderscoring how effective regional integration underpins Asean centrality, he said the grouping needs to upgrade its core agreements, such as the Asean Trade in Goods Agreement, to keep them relevant to evolving business practices.\nPM Lee also said Singapore strongly supports Indonesia’s efforts to develop\nand welcomes the proposed Leaders’ Statement to develop the agreement, which is targeted to be issued later this year.\n“We can reap tremendous economic gains by improving the digital connectivity and literacy of our peoples,” he said.\nTurning to the green economy, he said Singapore supports the strengthening of energy interconnectivity under Indonesia’s chairmanship of Asean. PM Lee held up the success of\nand said it shows that multilateral power trading in the region is feasible.\nThe intergovernmental project was set up in 2014 to study the feasibility of cross-border power trade, and Singapore began importing renewable energy from Laos via Thailand and Malaysia in 2022.\n“We should build on this and work towards an Asean Power Grid, which will strengthen member states’ energy security and resilience, and advance regional decarbonisation,” said PM Lee.\nOn Asean’s external partners, PM Lee noted that negotiations on the Second Protocol to Amend the Agreement Establishing the Asean-Australia-New Zealand Free Trade Area (AANZFTA) were recently concluded, and negotiations on a second upgrade of the Asean-China Free Trade Area (ACFTA) have begun.\n“Both upgrades include new areas such as the digital economy, green economy and supply chain connectivity,” he said.\nBeyond the economic sphere, Asean should also step up cooperation on transnational issues. PM Lee said this includes protecting the region’s people from increasingly sophisticated cross-border threats.\nSingapore supports Indonesia’s initiative for a Declaration on Combating Trafficking in Persons Caused by the Abuse of Technology, he said. Indonesia had earlier announced that\nat this week’s summit, amid growing concern over the rising number of cases in the region.\nAsean also should enhance cyber security cooperation, said PM Lee, who added he was happy that good progress has been made on the Asean Regional Computer Emergency Response Team (Cert) proposal. This team will strengthen regional cyber cooperation and incident response capabilities against sophisticated cyberthreats, he added.\nDeepening cooperation in Asean requires strong political support, said PM Lee as he called on the leaders to stay united and embrace a shared vision for Asean’s future.\nHe welcomed statements from the leaders on the development of the future Asean community as well as strengthening the bloc’s capacity for institutional effectiveness.\nThe statements, which are planned to be adopted at the summit, affirm the bloc’s shared commitment to the proposed core elements of the Post-2025 Vision submitted to Asean last year, said PM Lee.\nHe added that among other things, this vision calls on the Asean community to remain open, transparent, inclusive and rules-based, with deeper external engagements, as well as to pursue new areas of cooperation.\nThe vision also seeks to strengthen Asean as an institution, and PM Lee said that Singapore welcomes efforts to review the grouping’s capacity and institutional effectiveness.\n“We should streamline and optimise Asean processes, and strengthen the Asean Secretariat and the role of the Asean Secretary-General to enable them to more effectively implement our key priorities,” he said.\nTimor-Leste Prime Minister Taur Matan Ruak attended this week’s Asean Summit for the first time as an observer. This comes after the grouping decided at its previous summit in Cambodia to admit the island-nation in-principle as its 11th member.\nPM Lee said Asean looks forward to welcoming Timor-Leste into the grouping, adding that the bloc took a significant step on Wednesday by adopting the roadmap to its membership.\nThis plan sets out the obligations and commitments of membership which Timor-Leste needs to fulfill. PM Lee said the roadmap is robust and comprehensive, and has been extensively discussed and carefully designed.\nHe noted that the roadmap also has Asean’s full support, and Singapore looks forward to working with Timor-Leste to complete all the requirements, including negotiations to accede to Asean’s extensive set of treaties and agreements, so that Timor-Leste can join the grouping soon.\n“Singapore will continue to support Timor-Leste to build its capacity as it prepares to join Asean. I am sure fellow member states and our external partners will do so too,” he said"},
{"url": "http://www.straitstimes.com/asia/hong-kong-security-chief-criticises-wall-street-journal-opinion-piece-on-subversive-art", "title": "Wall Street Journal opinion piece on ‘subversive’ art is misleading: Hong Kong security chief", "date": "2023-05-10T10:45:00+08:00", "content": "HONG KONG – Hong Kong’s security chief Chris Tang criticised an opinion piece in the Wall Street Journal (WSJ) on a seizure by the authorities of a statue commemorating Beijing’s Tiananmen Square crackdown on democracy protesters in 1989.\nMr Tang said in a letter to the newspaper that the WSJ opinion piece, titled Subversive Art Is A Crime In Hong Kong, contained “groundless remarks” that mislead readers, broadcaster RTHK reported on Tuesday.\nReuters was not able to independently verify the letter and both the WSJ and Hong Kong government did not immediately respond to requests for comment.\nWSJ said in its opinion piece that\nof the Pillar Of Shame statue was quietly executed and done without due process.\nMr Tang said this was untrue and that officers took action with a court warrant on Friday and issued a press release on the operation.\n“That the opinion piece presented the exhibit of the criminal investigation as an ‘artwork’ and the case as one concerning mere ‘dissent’ is totally misleading,” the RTHK cited Mr Tang as writing.\nPillar Of Shame, created by Danish sculptor Jens Galschiot, is a 8m-tall statue depicting dozens of torn and twisted bodies that commemorates protesters killed in the crackdown in and around Tiananmen Square in 1989.\nThe two-tonne copper Pillar Of Shame was first exhibited at a Tiananmen Square commemoration in Hong Kong in 1997, the same year Britain handed the city back to China.\nIn 2021, the University of Hong Kong dismantled and removed the statue “based on external legal advice and risk assessment for the best interest of the university”. It has since been kept in a cargo container on university-owned land.\nThe seizure comes weeks ahead of the June 4 anniversary of the Tiananmen Square crackdown.\nHong Kong had traditionally held the largest annual vigils in the world to commemorate the crackdown, but vigils have been barred by police from taking place since 2020 due to coronavirus restrictions. REUTER"},
{"url": "http://www.straitstimes.com/life/entertainment/at-the-movies-in-still-actor-michael-j-fox-is-at-peace", "title": "At The Movies: In Still, actor Michael J. Fox is at peace", "date": "2023-05-10T12:30:00+08:00", "content": "Canadian-American actor Michael J. Fox tells the story of his life, from boyhood to the present day. With film clips, re-enactments and on-camera interviews, a tale is spun of a kid from Burnaby, British Columbia, who has his Hollywood dream come true – only to have it all darkened by the shadow of a debilitating disease.\nNo crying, no pity – that was the instruction Fox gave director Davis Guggenheim before the start of the project.\nThe result is a biographical documentary that frames the actor’s life as a feel-good story in the first half and a taut psychological drama in the second.\nThe turning point is his diagnosis of early-onset Parkinson’s disease. When the movie and television star – who had been at the top of the world with the Back To The Future science-fiction film series (1985 to 1990) and the sitcom Spin City (1996 to 2000) – is told of his diagnosis, his life is in torment.\nHe turns to alcohol. When filming, he connives to position his hands in ways that camouflage the spasms. Clips from Spin City featuring odd hand placement are shown to illustrate the point.\n“You’re only as sick as your secrets,” says Fox of that emotionally turbulent period.\nIf that quote sounds pulled from a motivational speech, you have to consider the film-maker.\nGuggenheim specialises in inspirational projects – his resume includes the Oscar-winning An Inconvenient Truth (2006), which follows former United States vice-president Al Gore as he makes arresting arguments about climate change.\nThe director also won an Emmy for the uplifting He Named Me Malala (2015), the biography of Pakistani activist Malala Yousafzai, who was shot by the Taliban for promoting education for girls.\nA cynic might say Still, like the portrait of Gore or Yousafzai, aims to sell Fox as a – shudder – “thought leader” in the field of disease activism.\nThere is a grain of truth to this. But, while not a thorough work of journalism, this film does cover the key areas of work and family and, more importantly, never forgets to let Fox shine on camera as a sweet man with a cheeky sense of humour.\nThis window into Fox’s life avoids sentimentality. Instead, it frames him as an inspirational figure, someone who was cut down in his prime but still finds life worth living because of his loved ones"},
{"url": "http://www.straitstimes.com/world/europe/russia-marks-victory-day-with-new-strikes-on-ukraine-but-pared-back-parade", "title": "Russia marks Victory Day with new strikes on Ukraine, but pared-back parade", "date": "2023-05-10T08:22:00+08:00", "content": "MOSCOW - Russia fired cruise missiles at Kyiv on Tuesday and paraded troops across Moscow’s Red Square for\npared back amid shortages of manpower and arms at the front after a failed winter campaign in Ukraine.\nIn a fiery 10-minute speech in front of the Kremlin, President Vladimir Putin thundered against “Western global elites” and said civilisation was at “a decisive turning point”.\n“A real war has been unleashed against our homeland,” said the Russian leader, who in 2022\ndestroying cities and killing thousands of civilians.\nUnderlining how the war has isolated Russia from most of Europe and pushed Ukraine closer to the West,\nwhere she called Ukraine “the beating heart of today’s European values”.\nThe holiday commemorating the Soviet victory in World War II is the most important day in the calendar in Russia under Mr Putin.\nHe casts his invasion of Ukraine as analogous to Russia’s fight against the Nazis.\nUkraine, which suffered proportionally greater losses than Russia in World War II, calls that an abuse of shared history to justify aggression.\nThe parade was full of traditional pomp but unmistakably scaled down from previous years.\nIn place of phalanxes of modern battle tanks, a single World War II-vintage T-34 rolled across Red Square. The usual fighter jet flyover was cancelled.\nMr Putin’s message was also undermined by a new profanity-laced tirade from the boss of Russia’s Wagner private army directed at Moscow’s generals for failing to give his forces enough weapons.\n“A combat order came yesterday which clearly stated that if we leave our positions (in Bakhmut), it will be regarded as treason against the motherland,” Mr Yevgeny Prigozhin said in an audio message. “(But) if there is no ammunition, then we will leave our positions and be the ones asking who is really betraying the motherland.”\nUkrainian President Volodymyr Zelensky said Moscow\ndespite a self-imposed deadline to give Mr Putin a battlefield trophy in time for the holiday.\nMoscow regards capturing Bakhmut as a stepping stone towards taking other cities in Ukraine’s industrial east.\nUkraine said its air defences had shot down 23 of 25 Russian cruise missiles fired chiefly at the capital Kyiv overnight, and there were no reported casualties.\nRussia’s Defence Ministry said it had “launched a concentrated strike using high-precision, long-range sea and air-based weapons aimed against enemy barracks and ammunition depots”.\nAfter a weeks-long hiatus, Russia in late April resumed its tactic of long-range missile strikes against Ukraine and has launched a flurry of attacks in recent days.\nThe day provided Mr Zelensky an opportunity to demonstrate Ukraine’s clear break from Moscow by hosting Ms von der Leyen.\n“Our efforts for a united Europe, for security and peace, need to be as strong as Russia’s desire to destroy our security, our freedom, our Europe,” Mr Zelensky said at their joint press conference in Kyiv.\nRussia’s increasing diplomatic isolation has drawn Moscow closer to China.\nChinese Foreign Minister Qin Gang said on Tuesday Beijing would maintain lines of communication with all parties to the war in Ukraine in seeking a ceasefire.\n“As a permanent member of the United Nations Security Council and responsible major country, China will neither watch the fire from the other bank nor add fuel to the fire,” Mr Qin told reporters alongside German counterpart Annalena Baerbock during a visit to Berlin.\nEuropean nations have criticised China for declining to describe Russia’s sending troops into Ukraine as an invasion or call for a Russian withdrawal.\nIn Washington, the White House announced a\nthat includes additional air defence systems and artillery rounds.\nMr Putin struck a rousing note in his Victory Day speech, saying all of Russia was praying for its heroes at the front and concluding with a cheer for “Russia, for our valiant armed forces, for victory!”\nAfter he spoke, a band struck up and cannon fired a salute. Soldiers marched through Red Square followed by armoured vehicles and nuclear-capable intercontinental ballistic missiles.\nBut the Moscow parade was much shorter than usual.\nSecurity concerns following attacks including drones that exploded over the Kremlin citadel last week meant parades in some other cities were scaled back or called off.\nTraditional “Immortal Regiment” processions, in which people carry portraits of relatives who fought against the Nazis, were cancelled.\nIn Kyiv there were no reported casualties from Russia’s latest volley of air strikes on the capital.\nDebris fell on a house in the Holosiivskyi district in the south-west of Kyiv but caused little damage, Mayor Vitalii Klitschko said. Debris lay in a road in Kyiv’s central Shevchenkivskyi district.\n“As at the front, the plans of the aggressor failed,” said Mr Sergei Popko, head of the Kyiv city military administration.\nRussia has stepped up its attacks in anticipation of a Ukrainian counter-offensive, after Moscow’s winter campaign captured little territory despite the bloodiest ground combat in Europe since World War II.\nRussia marks the Nazi surrender of May 8, 1945, on the following day, because it took effect when it was already after midnight in Moscow.\nUkraine symbolised its break from Moscow on Monday by announcing it was shifting its observance to May 8.\nInstead, Kyiv proclaimed May 9 as Europe Day, a date observed by the EU to commemorate the post-war integration movement that led to the founding of the bloc.\n“Kyiv, as the capital of Ukraine, is the beating heart of today’s European values,” Ms von der Leyen said at her news conference with Mr Zelensky. “Courageously, Ukraine is fighting for the ideals of Europe that we celebrate today.” REUTER"},
{"url": "http://www.straitstimes.com/asia/se-asia/indonesian-president-calls-on-asean-to-play-a-role-in-keeping-regions-peace", "title": "Asean Summit: Jokowi calls for unity to stay competitive, ensure regional peace", "date": "2023-05-10T09:45:00+08:00", "content": "LABUAN BAJO – Indonesian President Joko Widodo on Wednesday urged his South-east Asian counterparts to maintain the unity of Asean as a driving force to remain competitive and ensure peace in the region, amid rising geopolitical tensions.\nIn his opening remarks at a two-day Asean Summit in Labuan Bajo, a fishing town in East Nusa Tenggara province, Mr Joko outlined some of the challenges facing the world today -  the “global economy has not fully recovered, major power rivalries continue to sharpen, and global dynamics become more unpredictable”.\n“This raises the question: Will Asean remain a spectator, will Asean remain silent, and will Asean be capable of being an engine for peace and economic growth?”  he said.\nMr Widodo, or Jokowi as he is better known, expressed his confidence that Asean would be able to rise above the challenges as long as it stays united.\nAsean has “strong assets as the epicentrum of growth”, he stressed, citing its economy which “grows far above” the world’s average, a demographic bonus of some 668 million people, and regional stability.\n“We are confident that Asean is capable as long as we hold a key element – unity. With unity, Asean will be able to be a central player in bringing peace and growth,” he said.\nIndonesia is the rotating chair of the 10-nation regional bloc in 2023, and the 42nd Asean Summit is the first of two conferences, with the latter scheduled to be held in Jakarta in September.\nMr Widodo urged Asean countries to continue to strengthen the bloc’s efforts, including enforcing inclusive cooperation, as well as strengthening economic integration, health architecture, food security, and financial stability.\n“Let’s work hard to realise Asean Matters: Epicentrum of Growth,” he said, referring to the theme of the summit.\nThe president’s remarks came days after\nAsean’s member country that has plunged into civil unrest after a military coup on Feb 1, 2021 which has killed hundreds of civilians and displaced hundreds of thousands.\nThe convoy from the Asean Coordinating Centre for Humanitarian Assistance on Disaster Management, or AHA Centre, was accompanied by an Asean monitoring team.\nIndonesia and Singapore, whose officials were part of the convoy,\nAt the summit on  Wednesday, Asean leaders also decried the attack.\n“We were deeply concerned with ongoing violence in Myanmar and urged the immediate cessation of all forms of violence and the use of force to create a conducive environment for the safe and timely delivery of humanitarian assistance and inclusive national dialogues.,” the leaders said in a statement.\n“We condemned the attack and underlined that the perpetrators must be held accountable. We supported the efforts of the Chair of Asean, including its continued engagements with all stakeholders in Myanmar, to encourage progress in the implementation of the five-point consensus,” it added.\nAsean has barred Myanmar’s military junta\ndue to its failure to implement a five-point peace plan, which includes starting talks with its opponents and ending the violence. The bloc has invited non-political representatives from Myanmar to attend instead.\nMyanmar’s seat on Wednesday was vacant as it did not send a non-political representative to the summit. Thai Prime Minister Prayut Chan-o-cha was also absent due to\nand he was   represented by his Foreign Minister Don Pramudwinai.\nBesides the eight South-east Asian leaders at the summit, Timor-Leste Prime Minister Taur Matan Ruak also attended the meeting for the first time as an observer\nAsean secretary-general Kao Kim Hourn was also present.\nSpeaking in Portuguese, Mr Taur thanked Asean leaders for their “unwavering support and commitment over the years” to realise the country’s top goal of becoming an Asean member.\nHe said: “I can stand here as Prime Minister of Timor-Leste and say: Timor-Leste will meet all its obligations for full membership in Asean”.\nThe drafting of a road map to full Asean membership for Timor-Leste, the crisis in Myanmar, and\nare among the issues on the agenda at the two-day summit.\nAsean leaders are expected to attend eight meetings in plenary and retreat formats, seven of which will be chaired by Mr Widodo.\nMore than 2,600 security personnel have been deployed for the summit, including officers from the national and regional police force"}
]